Repository: ChaosSpiritVS/eSIM
Catalog: Simigo/Simigo/Resources/Localizable/*.lproj/Localizable.strings
Languages: ar, es, id, ja, ko, ms, pt, th, vi, zh_hans, zh_hant

# 语言：简体中文
source: Language: Simplified Chinese
ar: اللغة: الصينية المبسطة
es: Idioma: chino simplificado
id: Bahasa: Tionghoa Sederhana
ja: 言語：簡体字中国語
ko: 언어: 중국어 간체
ms: Bahasa: Cina Ringkas
pt: Idioma: Chinês simplificado
th: ภาษา: จีนตัวย่อ
vi: Ngôn ngữ: Tiếng Trung giản thể
zh_hans: 语言：简体中文
zh_hant: 語言：簡體中文

# 货币：英镑 (GBP) £
source: Currency: British Pound (GBP) £
ar: العملة: الجنيه الإسترليني (GBP) £
es: Moneda: libra esterlina (GBP) £
ja: 通貨：英ポンド (GBP) £
ko: 통화: 영국 파운드 (GBP) £
ms: Mata wang: Paun British (GBP) £
pt: Moeda: Libra esterlina (GBP) £
th: สกุลเงิน: ปอนด์อังกฤษ (GBP) £
vi: Tiền tệ: Bảng Anh (GBP) £
zh_hans: 货币：英镑 (GBP) £
zh_hant: 货币：英镑 (GBP) £

# 与朋友分享
source: Share with friends
ar: مشاركة مع الأصدقاء
es: Compartir con amigos
id: Bagikan kepada teman
ja: 友達と共有
ko: 친구와 공유
ms: Kongsi dengan rakan
pt: Compartilhar com amigos
th: แชร์กับเพื่อน
vi: Chia sẻ với bạn bè
zh_hans: 与朋友分享
zh_hant: 與朋友分享

# 为应用评分
source: Rate the app
ar: تقييم التطبيق
es: Valorar la app
id: Beri nilai aplikasi
ja: アプリを評価
ko: 앱 평가
ms: Nilai aplikasi
pt: Avaliar o app
th: ให้คะแนนแอป
vi: Đánh giá ứng dụng
zh_hans: 为应用评分
zh_hant: 為應用評分

# 更多信息
source: More Information
ar: معلومات إضافية
es: Más información
id: Informasi lainnya
ja: 詳細情報
ko: 추가 정보
ms: Maklumat lanjut
pt: Mais informações
th: ข้อมูลเพิ่มเติม
vi: Thông tin thêm
zh_hans: 更多信息
zh_hant: 更多資訊

# 语言
source: Language
ar: اللغة
es: Idioma
id: Bahasa
ja: 言語
ko: 언어
ms: Bahasa
pt: Idioma
th: ภาษา
vi: Ngôn ngữ
zh_hans: 语言
zh_hant: 語言

# 设备语言
source: Device Languages
ar: لغات الجهاز
es: Idiomas del dispositivo
id: Bahasa perangkat
ja: デバイスの言語
ko: 기기 언어
ms: Bahasa peranti
th: ภาษาของอุปกรณ์
vi: Ngôn ngữ thiết bị
zh_hans: 设备语言
zh_hant: 設備語言

# 货币
source: Currency
ar: العملة
id: Mata uang
ja: 通貨
ko: 통화
ms: Mata wang
pt: Moeda
th: สกุลเงิน
vi: Tiền tệ
zh_hans: 货币
zh_hant: 貨幣

# 购买与退款需遵循当地法律与平台规则。
source: Purchases and refunds follow local laws and platform rules.
ar: تخضع المشتريات والاستردادات للقوانين المحلية وقواعد المنصة
es: Las compras y reembolsos se rigen por las leyes locales y las normas de la plataforma.
id: Pembelian dan pengembalian dana mengikuti hukum lokal dan aturan platform.
ja: 購入と返金は現地の法律およびプラットフォームの規則に従います。
ko: 구매 및 환불은 현지 법률과 플랫폼 규정을 따릅니다
ms: Pembelian dan bayaran balik tertakluk kepada undang-undang tempatan dan peraturan platform.
th: การซื้อและการคืนเงินเป็นไปตามกฎหมายท้องถิ่นและกฎของแพลตฟอร์ม
vi: Mua hàng và hoàn tiền tuân theo luật địa phương và quy định nền tảng
zh_hans: 购买与退款需遵循当地法律与平台规则。
zh_hant: 購買與退款需遵循當地法律與平台規則。

# 套餐覆盖与速度以运营商实际为准。
source: Coverage and speed depend on carriers in practice.
ar: تعتمد التغطية والسرعة على شركات الاتصالات عمليًا
es: La cobertura y la velocidad dependen de los operadores.
ja: 通信範囲と速度は実際の通信事業者に依存します。
ko: 커버리지와 속도는 실제 통신사에 따라 달라집니다
ms: Liputan dan kelajuan bergantung pada pengendali.
th: พื้นที่ให้บริการและความเร็วขึ้นอยู่กับผู้ให้บริการ
vi: Phạm vi phủ sóng và tốc độ phụ thuộc vào nhà mạng
zh_hans: 套餐覆盖与速度以运营商实际为准。
zh_hant: 套餐涵蓋與速度以電信商實際為準。

# 使用 eSIM 需符合设备与地区要求。
source: Using eSIM requires compatible devices and regions.
ar: يتطلب استخدام eSIM أجهزة ومناطق متوافقة
es: El uso de eSIM requiere dispositivos y regiones compatibles.
ja: eSIM を使用するには、デバイスおよび地域の要件を満たす必要があります。
ko: eSIM 사용은 호환되는 기기 및 지역이 필요합니다
ms: Penggunaan eSIM memerlukan peranti dan wilayah yang serasi.
th: การใช้งาน eSIM ต้องใช้อุปกรณ์และภูมิภาคที่รองรับ
vi: Sử dụng eSIM yêu cầu thiết bị và khu vực tương thích
zh_hans: 使用 eSIM 需符合设备与地区要求。
zh_hant: 使用 eSIM 需符合設備與地區要求。

# 重置邮件已发送，请检查你的邮箱
source: Reset email sent. Please check your inbox.
ar: تم إرسال بريد إعادة التعيين، يرجى التحقق من بريدك
es: Correo de restablecimiento enviado. Revisa tu bandeja de entrada.
id: Email pengaturan ulang telah dikirim. Silakan periksa kotak masuk Anda.
ja: リセットメールを送信しました。受信箱を確認してください。
ko: 재설정 이메일이 전송되었습니다. 받은편지함을 확인하세요.
ms: Emel set semula telah dihantar. Sila semak peti masuk anda.
pt: E-mail de redefinição enviado. Verifique sua caixa de entrada.
th: ส่งอีเมลรีเซ็ตแล้ว โปรดตรวจสอบกล่องจดหมายของคุณ
vi: Email đặt lại đã được gửi. Vui lòng kiểm tra hộp thư đến.
zh_hans: 重置邮件已发送，请检查你的邮箱
zh_hant: 重置郵件已發送，請檢查你的郵箱

# 大写
source: Uppercase letter
ar: حرف كبير
es: Mayúscula
id: Huruf besar
ja: 大文字
ko: 대문자
ms: Huruf besar
pt: Letra maiúscula
th: ตัวอักษรตัวใหญ่
vi: Chữ hoa
zh_hans: 大写
zh_hant: 大寫

# 小写
source: Lowercase letter
ar: حرف صغير
es: Minúscula
id: Huruf kecil
ja: 小文字
ko: 소문자
ms: Huruf kecil
pt: Letra minúscula
th: ตัวอักษรตัวเล็ก
vi: Chữ thường
zh_hans: 小写
zh_hant: 小寫

# 数字 1234567890
source: Number 0–9
ar: رقم 0–9
es: Número 0–9
id: Angka 0–9
ja: 数字 0〜9
ko: 숫자 0–9
ms: Nombor 0–9
pt: Número 0–9
th: ตัวเลข 0–9
vi: Số 0–9
zh_hans: 数字 1234567890
zh_hant: 數字 1234567890

# 一个符号 +-*/?:=!%$#
source: One symbol +-*/?:=!%$#
ar: رمز واحد +-*/?:=!%$#
es: Un símbolo +-*/?:=!%$#
id: Satu simbol +-*/?:=!%$#
ja: 記号 +-*/?:=!%$# を1つ
ko: 기호 1개 +-*/?:=!%$#
ms: Satu simbol +-*/?:=!%$#
pt: Um símbolo +-*/?:=!%$#
th: สัญลักษณ์หนึ่งตัว +-*/?:=!%$#
vi: Một ký hiệu +-*/?:=!%$#
zh_hans: 一个符号 +-*/?:=!%$#
zh_hant: 一個符號 +-*/?:=!%$#

# 重试
source: Retry
ar: إعادة المحاولة
es: Reintentar
id: Coba lagi
ja: 再試行
ko: 재시도
ms: Cuba lagi
pt: Tentar novamente
th: ลองอีกครั้ง
vi: Thử lại
zh_hans: 重试
zh_hant: 重試

# 刷新
source: Refresh
ar: تحديث
es: Actualizar
id: Muat ulang
ja: 更新
ko: 새로고침
ms: Segar semula
pt: Atualizar
th: รีเฟรช
vi: Làm mới
zh_hans: 刷新
zh_hant: 重新整理

# 正在恢复会话…
source: Restoring session…
ar: جارٍ استعادة الجلسة…
es: Restaurando sesión…
id: Memulihkan sesi…
ja: セッションを復元中…
ko: 세션 복원 중…
ms: Memulihkan sesi…
pt: Restaurando sessão…
th: กำลังกู้คืนเซสชัน…
vi: Đang khôi phục phiên…
zh_hans: 正在恢复会话…
zh_hant: 正在恢復會話…

# 退出
source: Logout
ar: تسجيل الخروج
es: Cerrar sesión
id: Keluar
ja: やめる
ko: 로그아웃
ms: Log keluar
pt: Sair
th: ออกจากระบบ
vi: Đăng xuất
zh_hans: 退出
zh_hant: 登出

# 我的套餐
source: My Bundles
ar: الباقات الخاصة بي
es: Mis paquetes
ja: マイプラン
ko: 내 패키지
ms: Pakej Saya
th: แพ็กเกจของฉัน
vi: Gói của tôi
zh_hans: 我的套餐
zh_hant: 我的套餐

# 暂无套餐
source: No bundles yet
ar: لا توجد حزم بعد
es: Aún no hay paquetes
id: Belum ada paket
ja: 利用可能なパッケージはありません
ko: 아직 패키지가 없습니다
ms: Tiada pakej lagi
pt: Ainda não há pacotes
th: ยังไม่มีแพ็กเกจ
vi: Chưa có gói
zh_hans: 暂无套餐
zh_hant: 暫無套餐

# 加载中...
source: Loading...
ar: جارٍ التحميل...
es: Cargando...
id: Memuat...
ja: 読み込み中...
ko: 로딩 중...
ms: Memuatkan...
pt: Carregando...
th: กำลังโหลด...
vi: Đang tải...
zh_hans: 加载中...
zh_hant: 載入中...

# 加载更多
source: Load more
ar: تحميل المزيد
es: Cargar más
id: Muat lebih banyak
ja: さらに読み込む
ko: 더 보기
ms: Muatkan lagi
pt: Carregar mais
th: โหลดเพิ่มเติม
vi: Tải thêm
zh_hans: 加载更多
zh_hant: 載入更多

# 前往我的 eSIM 查看安装与用量
source: Go to My eSIM to view installation and usage
ar: انتقل إلى eSIM الخاصة بي لعرض التثبيت والاستخدام
es: Ir a Mi eSIM para ver instalación y uso
id: Buka eSIM Saya untuk melihat pemasangan dan penggunaan
ja: マイ eSIM に移動してインストールと使用量を表示
ko: 내 eSIM으로 이동하여 설치 및 사용량 확인
ms: Pergi ke eSIM Saya untuk melihat pemasangan dan penggunaan
pt: Ir à Minha eSIM para ver instalação e uso
th: ไปที่ eSIM ของฉันเพื่อดูการติดตั้งและการใช้งาน
vi: Tới eSIM của tôi để xem cài đặt và mức dùng
zh_hans: 前往我的 eSIM 查看安装与用量
zh_hant: 前往我的 eSIM 查看安裝與用量

# 操作
source: Actions
ar: الإجراءات
es: Acciones
id: Tindakan
ja: 操作
ko: 작업
ms: Tindakan
pt: Ações
th: การทำงาน
vi: Hành động
zh_hans: 操作
zh_hant: 操作

# 退款原因
source: Refund reason
ar: سبب الاسترداد
es: Motivo del reembolso
ja: 返金理由
ko: 환불 사유
ms: Sebab bayaran balik
th: เหตุผลในการขอคืนเงิน
vi: Lý do hoàn tiền
zh_hans: 退款原因
zh_hant: 退款原因

# 请输入退款原因
source: Please enter a refund reason
ar: يرجى إدخال سبب الاسترداد
es: Introduce el motivo del reembolso
ja: 返金理由を入力してください
ko: 환불 사유를 입력하세요
ms: Sila masukkan sebab bayaran balik
th: โปรดระบุเหตุผลในการขอคืนเงิน
vi: Vui lòng nhập lý do hoàn tiền
zh_hans: 请输入退款原因
zh_hant: 请输入退款原因

# 请至少输入 5 个字符
source: Please enter at least 5 characters
ar: يرجى إدخال 5 أحرف على الأقل
es: Introduce al menos 5 caracteres
ja: 5文字以上で入力してください
ko: 최소 5자 이상 입력하세요
ms: Sila masukkan sekurang-kurangnya 5 aksara
th: โปรดกรอกอย่างน้อย 5 ตัวอักษร
vi: Vui lòng nhập ít nhất 5 ký tự
zh_hans: 请至少输入 5 个字符
zh_hant: 请至少输入 5 个字符

# 提交退款申请
source: Submit refund request
ar: إرسال طلب الاسترداد
es: Enviar solicitud de reembolso
ja: 返金申請を送信
ko: 환불 신청 제출
ms: Hantar permohonan bayaran balik
th: ส่งคำขอคืนเงิน
vi: Gửi yêu cầu hoàn tiền
zh_hans: 提交退款申请
zh_hant: 提交退款申请

# 套餐类型
source: Bundle Category
ar: نوع الباقة
es: Tipo de paquete
id: Jenis paket
ko: 패키지 유형
ms: Jenis pakej
pt: Tipo de pacote
th: ประเภทแพ็กเกจ
vi: Loại gói
zh_hans: 套餐类型
zh_hant: 套餐類型

# 国家/地区
source: Country/Region
ar: البلد/المنطقة
es: País/Región
id: Negara/Wilayah
ja: 国/地域
ko: 국가/지역
ms: Negara/Wilayah
pt: País/Região
th: ประเทศ/ภูมิภาค
vi: Quốc gia/Khu vực
zh_hans: 国家/地区
zh_hant: 國家/地區

# 已开始
source: Started
ar: بدأ
es: Iniciado
id: Sudah dimulai
ja: 開始済み
ko: 시작됨
ms: Telah bermula
pt: Iniciado
th: เริ่มแล้ว
vi: Đã bắt đầu
zh_hans: 已开始
zh_hant: 已開始

# 好的
source: OK
ar: حسنًا
es: Aceptar
id: Oke
ko: 확인
ms: Baik
pt: Certo
th: ตกลง
zh_hans: 好的
zh_hant: 好的

# 暂无订单
source: No orders yet
ar: لا توجد طلبات بعد
es: Aún no hay pedidos
id: Belum ada pesanan
ja: 注文はまだありません
ko: 주문이 아직 없습니다
ms: Tiada pesanan lagi
pt: Ainda não há pedidos
th: ยังไม่มีคำสั่งซื้อ
vi: Chưa có đơn hàng
zh_hans: 暂无订单
zh_hant: 暫無訂單

# 套餐
source: Bundle
ar: حزمة
es: Paquete
id: Paket
ja: コンボ
ko: 패키지
ms: Pakej
pt: Pacote
th: แพ็กเกจ
vi: Gói
zh_hans: 套餐
zh_hant: 套餐

# 购买前确认
source: Confirm before purchase
ar: تأكيد قبل الشراء
es: Confirmar antes de comprar
id: Konfirmasi sebelum membeli
ja: 購入前の確認
ko: 구매 전 확인
ms: Sahkan sebelum membeli
pt: Confirmar antes de comprar
th: ยืนยันก่อนซื้อ
vi: Xác nhận trước khi mua
zh_hans: 购买前确认
zh_hant: 購買前確認

# 同意并继续
source: Agree and continue
ar: الموافقة والمتابعة
es: Aceptar y continuar
id: Setuju dan lanjutkan
ja: 同意して続行
ko: 동의하고 계속
ms: Setuju dan teruskan
pt: Concordar e continuar
th: ยอมรับและดำเนินการต่อ
vi: Đồng ý và tiếp tục
zh_hans: 同意并继续
zh_hant: 同意並繼續

# 查看隐私政策
source: View Privacy Policy
ar: عرض سياسة الخصوصية
es: Ver Política de privacidad
id: Lihat Kebijakan Privasi
ja: プライバシーポリシーを見る
ko: 개인정보처리방침 보기
ms: Lihat Dasar Privasi
pt: Ver Política de privacidade
th: ดูนโยบายความเป็นส่วนตัว
vi: Xem Chính sách quyền riêng tư
zh_hans: 查看隐私政策
zh_hant: 查看隱私政策

# 购买即表示同意
source: By purchasing you agree to
ar: عند الشراء فإنك توافق
es: Al comprar aceptas
id: Dengan membeli Anda menyetujui
ja: 購入すると次に同意したものとみなされます
ko: 구매 시 동의한 것으로 간주
ms: Dengan membeli anda bersetuju
pt: Ao comprar você concorda
th: การซื้อถือว่าเป็นการยอมรับ
vi: Khi mua, bạn đồng ý
zh_hans: 购买即表示同意
zh_hant: 購買即表示同意

# 与
source: and
ar: و
es: y
id: dan
ja: と
ko: 및
ms: dan
pt: e
th: และ
vi: và
zh_hans: 与
zh_hant: 與

# 总计
source: Total
ar: الإجمالي
ja: 合計
ko: 합계
ms: Jumlah
th: รวม
vi: Tổng
zh_hans: 总计
zh_hant: 總計

# 正在下单…
source: Placing order…
ar: جاري إنشاء الطلب…
es: Realizando pedido…
id: Memproses pesanan…
ja: 注文を作成中…
ko: 주문 처리 중…
ms: Memproses pesanan…
pt: Realizando pedido…
th: กำลังสร้างคำสั่งซื้อ…
vi: Đang tạo đơn hàng…
zh_hans: 正在下单…
zh_hant: 正在下單…

# 本地
source: Local
ar: محلي
id: Lokal
ja: 地元
ko: 로컬
ms: Tempatan
th: ภายในประเทศ
vi: Cục bộ
zh_hans: 本地
zh_hant: 本地

# 区域
source: Region
ar: منطقة
es: Región
id: Wilayah
ja: 地域
ko: 지역
ms: Wilayah
pt: Região
th: ภูมิภาค
vi: Khu vực
zh_hans: 区域
zh_hant: 區域

# 全球
source: Global
ar: عالمي
id: Seluruh dunia
ja: 世界中で
ko: 글로벌
ms: Sejagat
th: ทั่วโลก
vi: Toàn cầu
zh_hans: 全球
zh_hant: 全球

# 共 %d 个套餐
source: Total %d bundles
ar: الإجمالي %d حزمة
es: Total %d paquetes
id: Total %d paket
ja: 合計 %d プラン
ko: 총 %d개 패키지
ms: Jumlah %d pakej
pt: Total de %d pacotes
th: รวม %d แพ็กเกจ
vi: Tổng %d gói
zh_hans: 共 %d 个套餐
zh_hant: 共 %d 個套餐

# 是
source: Yes
ar: نعم
es: Sí
id: Ya
ko: 예
ms: Ya
pt: Sim
th: ใช่
vi: Có
zh_hans: 是
zh_hant: 是

# 否
source: No
ar: لا
id: Tidak
ko: 아니오
ms: Tidak
pt: Não
th: ไม่
vi: Không
zh_hans: 否
zh_hant: 否

# 修复订单归属
source: Fix order ownership
ar: إصلاح ملكية الطلب
es: Reparar titularidad de pedidos
id: Perbaiki kepemilikan pesanan
ja: 注文の所有権を修復
ko: 주문 소유권 수정
ms: Betulkan pemilikan pesanan
pt: Corrigir titularidade dos pedidos
th: แก้ไขความเป็นเจ้าของคำสั่งซื้อ
vi: Sửa quyền sở hữu đơn hàng
zh_hans: 修复订单归属
zh_hant: 修復訂單歸屬

# 订单归属修复完成：已检查 %d，修复 %d
source: Ownership fix completed: checked %d, updated %d
ar: اكتمل الإصلاح: تم التحقق من %d، تم تحديث %d
es: Reparación de titularidad completada: verificados %d, actualizados %d
id: Perbaikan selesai: diperiksa %d, diperbarui %d
ja: 所有権の修復が完了：%d 件を確認、%d 件を修復
ko: 수정 완료: 확인 %d, 업데이트 %d
ms: Pembetulan selesai: disemak %d, dikemas kini %d
pt: Correção concluída: verificados %d, atualizados %d
th: แก้ไขเสร็จสิ้น: ตรวจสอบ %d อัปเดต %d
vi: Hoàn tất sửa: đã kiểm tra %d, cập nhật %d
zh_hans: 订单归属修复完成：已检查 %d，修复 %d
zh_hant: 訂單歸屬修復完成：已檢查 %d，修復 %d

# 套餐摘要
source: Bundle Summary
ar: ملخص الباقة
es: Resumen del paquete
id: Ringkasan paket
ja: プラン概要
ko: 패키지 요약
ms: Ringkasan pakej
pt: Resumo do pacote
th: สรุปแพ็กเกจ
vi: Tóm tắt gói
zh_hans: 套餐摘要
zh_hant: 套餐摘要

# 请稍候…
source: Please wait…
ar: يرجى الانتظار…
es: Por favor, espera…
id: Harap tunggu…
ja: しばらくお待ちください…
ko: 잠시만 기다려주세요…
ms: Sila tunggu…
pt: Aguarde…
th: โปรดรอสักครู่…
vi: Vui lòng đợi…
zh_hans: 请稍候…
zh_hant: 请稍候…

# 使用情况
source: Usage
ar: الاستخدام
es: Uso
id: Penggunaan
ja: 利用状況
ko: 사용 현황
ms: Penggunaan
pt: Utilização
th: การใช้งาน
vi: Sử dụng
zh_hans: 使用情况
zh_hant: 使用情況

# 安装信息
source: Installation
ar: معلومات التثبيت
es: Instalación
id: Informasi instalasi
ja: インストール情報
ko: 설치 정보
ms: Maklumat pemasangan
pt: Instalação
th: ข้อมูลการติดตั้ง
vi: Thông tin cài đặt
zh_hans: 安装信息
zh_hant: 安裝資訊

# 上架中
source: Available
ar: متاح
es: Disponible
id: Tersedia
ja: 販売中
ko: 판매 중
ms: Tersedia
pt: Disponível
th: พร้อมจำหน่าย
vi: Đang bán
zh_hans: 上架中
zh_hant: 上架中

# 已下架
source: Unavailable
ar: غير متاح
es: No disponible
id: Tidak tersedia
ja: 販売停止
ko: 판매 중지
ms: Tidak tersedia
pt: Indisponível
th: เลิกจำหน่าย
vi: Ngừng bán
zh_hans: 已下架
zh_hant: 已下架

# 此设备是否支持？
source: Is this device supported?
ar: هل يدعم هذا الجهاز؟
es: ¿Este dispositivo es compatible?
id: Apakah perangkat ini didukung?
ja: このデバイスは対応していますか？
ko: 이 기기가 지원되나요?
ms: Adakah peranti ini disokong?
pt: Este dispositivo é compatível?
th: อุปกรณ์นี้รองรับหรือไม่?
vi: Thiết bị này có được hỗ trợ không?
zh_hans: 此设备是否支持？
zh_hant: 此設備是否支持？

# 标签
source: Tags
ar: العلامات
es: Etiquetas
id: Tag
ja: ラベル
ko: 태그
ms: Tag
pt: Etiquetas
th: แท็ก
vi: Thẻ
zh_hans: 标签
zh_hant: 標籤

# 收起
source: Show less
ar: إظهار أقل
es: Mostrar menos
id: Tampilkan lebih sedikit
ja: 折りたたむ
ko: 접기
ms: Tunjukkan lebih sedikit
pt: Mostrar menos
th: ย่อ
vi: Thu gọn
zh_hans: 收起
zh_hant: 收起

# 展开更多
source: Show more
ar: عرض المزيد
es: Mostrar más
id: Tampilkan lebih banyak
ja: さらに表示
ko: 더보기
ms: Tunjukkan lebih banyak
pt: Mostrar mais
th: แสดงเพิ่มเติม
vi: Xem thêm
zh_hans: 展开更多
zh_hant: 展開更多

# 常见问题解答
source: FAQ
ar: الأسئلة الشائعة
es: Preguntas frecuentes
ja: よくある質問
ko: 자주 묻는 질문
ms: Soalan Lazim
pt: Perguntas frequentes
th: คำถามที่พบบ่อย
vi: Câu hỏi thường gặp
zh_hans: 常见问题解答
zh_hant: 常見問題解答

# 支持
source: Support
ar: الدعم
es: Soporte
id: Dukungan
ja: サポート
ko: 지원
ms: Sokongan
pt: Suporte
th: สนับสนุน
vi: Hỗ trợ
zh_hans: 支持
zh_hant: 支援

# 需要帮助？我们提供全天候多语言支持。
source: Need help? We offer 24/7 multilingual support.
ar: بحاجة إلى مساعدة؟ نوفر دعمًا متعدد اللغات على مدار الساعة.
es: ¿Necesitas ayuda? Ofrecemos soporte multilingüe 24/7.
id: Butuh bantuan? Kami menyediakan dukungan multibahasa 24/7.
ja: ヘルプが必要ですか？24時間多言語サポートをご提供しています。
ko: 도움이 필요하신가요? 24시간 다국어 지원을 제공합니다.
ms: Perlukan bantuan? Kami menawarkan sokongan berbilang bahasa 24/7.
pt: Precisa de ajuda? Oferecemos suporte multilíngue 24/7.
th: ต้องการความช่วยเหลือหรือไม่? เรามีทีมสนับสนุนหลายภาษาตลอด 24 ชั่วโมง
vi: Cần trợ giúp? Chúng tôi hỗ trợ đa ngôn ngữ 24/7.
zh_hans: 需要帮助？我们提供全天候多语言支持。
zh_hant: 需要幫助？我們提供全天候多語言支援。

# 联系支持团队
source: Contact Support Team
ar: اتصل بفريق الدعم
es: Contactar al equipo de soporte
id: Hubungi tim dukungan
ja: サポートチームに連絡
ko: 지원팀에 문의
ms: Hubungi pasukan sokongan
pt: Contactar a equipa de suporte
th: ติดต่อทีมสนับสนุน
vi: Liên hệ đội hỗ trợ
zh_hans: 联系支持团队
zh_hant: 聯絡支援團隊

# 套餐详细信息
source: Bundle details
ar: تفاصيل الباقة
es: Detalles del paquete
id: Detail paket
ja: プラン詳細
ko: 상품 상세 정보
ms: Butiran pakej
pt: Detalhes do pacote
th: รายละเอียดแพ็คเกจ
vi: Chi tiết gói
zh_hans: 套餐详细信息
zh_hant: 套餐詳細資訊

# 完成订单，即表示您确认目标设备支持 eSIM 且网络已解锁。
source: By completing the order you confirm the device supports eSIM and is unlocked.
ar: بإتمام الطلب تؤكد أن الجهاز يدعم eSIM وأن الشبكة غير مقفلة.
es: Al completar el pedido confirmas que tu dispositivo soporta eSIM y está desbloqueado.
id: Dengan menyelesaikan pesanan, Anda mengonfirmasi perangkat mendukung eSIM dan jaringannya tidak terkunci.
ja: 注文を完了すると、対象デバイスが eSIM に対応し、ネットワークが解除されていることを確認したものとみなされます。
ko: 주문을 완료하면 대상 기기가 eSIM을 지원하고 네트워크가 잠금 해제됨을 확인한 것으로 간주됩니다.
ms: Dengan melengkapkan pesanan, anda mengesahkan peranti menyokong eSIM dan rangkaian telah dinyahkunci.
pt: Ao concluir o pedido, confirma que o dispositivo suporta eSIM e está desbloqueado.
th: เมื่อทำรายการสั่งซื้อเสร็จ ถือว่าคุณยืนยันว่าอุปกรณ์รองรับ eSIM และเครือข่ายถูกปลดล็อกแล้ว
vi: Hoàn tất đơn hàng đồng nghĩa bạn xác nhận thiết bị hỗ trợ eSIM và mạng đã mở khóa.
zh_hans: 完成订单，即表示您确认目标设备支持 eSIM 且网络已解锁。
zh_hant: 完成訂單即表示您確認目標設備支援 eSIM 且網路已解鎖。

# 该套餐已下架，暂不可购买。
source: This bundle is unavailable.
ar: هذه الباقة غير متاحة للشراء حاليًا.
es: Este paquete no está disponible para su compra.
id: Paket ini tidak tersedia untuk dibeli.
ja: このプランは販売停止中のため購入できません。
ko: 이 상품은 판매 중지되어 구매할 수 없습니다.
ms: Pakej ini tidak tersedia untuk dibeli.
pt: Este pacote não está disponível para compra.
th: แพ็คเกจนี้ถูกยกเลิกจำหน่าย ชั่วคราวไม่สามารถซื้อได้
vi: Gói này đã ngừng bán, tạm thời không thể mua.
zh_hans: 该套餐已下架，暂不可购买。
zh_hant: 該套餐已下架，暫不可購買。

# 安全结账
source: Secure Checkout
ar: الدفع الآمن
es: Pago seguro
id: Pembayaran aman
ja: 安全なチェックアウト
ko: 안전한 결제
ms: Pembayaran selamat
pt: Checkout seguro
th: ชำระเงินอย่างปลอดภัย
vi: Thanh toán an toàn
zh_hans: 安全结账
zh_hant: 安全結帳

# 国家
source: Country
ar: البلد
es: País
id: Negara
ja: 国
ko: 국가
ms: Negara
pt: País
th: ประเทศ
vi: Quốc gia
zh_hans: 国家
zh_hant: 國家

# 地区
source: Region
ar: المنطقة
es: Región
id: Wilayah
ja: 地域
ko: 지역
ms: Wilayah
pt: Região
th: ภูมิภาค
vi: Khu vực
zh_hans: 地区
zh_hant: 地區

# 我正在使用 Simigo eSIM 应用，快来试试吧！
source: I'm using eSIM Home — try it!
ar: أستخدم تطبيق eSIM Home — جرّبه!
es: Estoy usando Simigo eSIM — ¡pruébalo!
id: Saya menggunakan eSIM Home — coba juga!
ja: Simigo eSIM アプリを使っています — 試してみてください！
ko: eSIM Home을 사용 중입니다 — 한번 써보세요!
ms: Saya menggunakan Simigo eSIM — cuba juga!
pt: Estou a usar o eSIM Home — experimente!
th: ฉันกำลังใช้ eSIM Home — ลองเลย!
vi: Tôi đang dùng Simigo eSIM — thử ngay!
zh_hans: 我正在使用 eSIM Home 应用，快来试试吧！
zh_hant: 我正在使用 eSIM Home 應用，快來試試吧！

# 连接到网络
source: Connect to network
ar: الاتصال بالشبكة
es: Conectar a la red
id: Hubungkan ke jaringan
ja: ネットワークに接続
ko: 네트워크 연결
ms: Sambung ke rangkaian
pt: Ligar à rede
th: เชื่อมต่อเครือข่าย
vi: Kết nối mạng
zh_hans: 连接到网络
zh_hant: 連接到網路

# 安装教程
source: Installation Tutorial
ar: دليل التثبيت
es: Tutorial de instalación
id: Panduan instalasi
ja: インストールチュートリアル
ko: 설치 안내
ms: Panduan pemasangan
pt: Tutorial de instalação
th: ขั้นตอนการติดตั้ง
vi: Hướng dẫn cài đặt
zh_hans: 安装教程
zh_hant: 安裝教學

# 点击 添加蜂窝套餐（Add eSIM / Add Cellular Plan）
source: Tap Add eSIM / Add Cellular Plan
ar: اضغط إضافة eSIM / إضافة خطة خلوية
es: Tocar Añadir eSIM / Añadir plan de datos
id: Ketuk Tambah eSIM / Tambah Paket Seluler
ja: 「eSIM を追加 / モバイル通信プランを追加」をタップ
ko: eSIM 추가 / 셀룰러 요금제 추가 탭
ms: Ketik Tambah eSIM / Tambah Pelan Selular
pt: Tocar Adicionar eSIM / Adicionar plano móvel
th: แตะ เพิ่ม eSIM / เพิ่มแพลนเซลลูลาร์
vi: Chạm Thêm eSIM / Thêm gói di động
zh_hans: 点击 添加蜂窝套餐（Add eSIM / Add Cellular Plan）
zh_hant: 點選 新增行動方案（Add eSIM / Add Cellular Plan）

# 根据提示信息，添加蜂窝套餐（Add Cellular Plan）
source: Follow prompts to add Cellular Plan
ar: اتبع الإرشادات لإضافة خطة خلوية
es: Seguir las indicaciones para añadir el plan de datos
id: Ikuti petunjuk untuk menambahkan Paket Seluler
ja: 案内に従ってモバイル通信プランを追加
ko: 안내에 따라 셀룰러 요금제 추가
ms: Ikuti arahan untuk menambah Pelan Selular
pt: Seguir as instruções para adicionar o plano móvel
th: ทำตามคำแนะนำเพื่อเพิ่มแพลนเซลลูลาร์
vi: Làm theo hướng dẫn để thêm gói di động
zh_hans: 根据提示信息，添加蜂窝套餐（Add Cellular Plan）
zh_hant: 依照提示新增行動方案（Add Cellular Plan）

# 返回设置主页，确认 eSIM 套餐状态为“已激活”
source: Go back to Settings and confirm the eSIM status is Active
ar: ارجع للإعدادات وتأكد أن حالة eSIM هي ‘مفعّل’
es: Volver a Ajustes y confirmar que el estado de eSIM es ‘Activado’
id: Kembali ke Pengaturan dan pastikan status eSIM adalah Aktif
ja: 設定のホームに戻り、eSIM プランの状態が「有効」になっていることを確認
ko: 설정으로 돌아가 eSIM 상태가 ‘활성’인지 확인
ms: Kembali ke Tetapan dan pastikan status eSIM ialah Aktif
pt: Voltar às Definições e confirmar que a eSIM está ‘Ativa’
th: กลับไปหน้าหลักการตั้งค่าและยืนยันว่า eSIM เป็นสถานะ ‘เปิดใช้งาน’
vi: Quay lại Cài đặt và xác nhận eSIM ở trạng thái Đã kích hoạt
zh_hans: 返回设置主页，确认 eSIM 套餐状态为“已激活”
zh_hant: 返回設定首頁，確認 eSIM 方案狀態為「已啟用」

# 输入以下信息：
source: Enter the following:
ar: أدخل ما يلي:
es: Introduce lo siguiente:
id: Masukkan yang berikut:
ja: 次の情報を入力：
ko: 다음을 입력:
ms: Masukkan yang berikut:
pt: Introduza o seguinte:
th: กรอกข้อมูลต่อไปนี้:
vi: Nhập các thông tin sau:
zh_hans: 输入以下信息：
zh_hant: 輸入以下資訊：

# 点击下一步，等待系统添加套餐，安装完成后即可使用
source: Tap Next and wait for the plan to be added
ar: اضغط التالي وانتظر إضافة الخطة
es: Toca Siguiente y espera a que se añada el plan
id: Ketuk Berikutnya dan tunggu hingga paket ditambahkan
ja: 次へ をタップしてプランの追加を待ち、インストール完了後に利用できます
ko: 다음을 탭하고 추가 완료까지 기다리세요
ms: Ketik Seterusnya dan tunggu pelan ditambah
pt: Toque Seguinte e aguarde a adição do plano
th: แตะ ถัดไป และรอระบบเพิ่มแพ็กเกจเพื่อใช้งาน
vi: Chạm Tiếp theo và chờ thêm gói hoàn tất
zh_hans: 点击下一步，等待系统添加套餐，安装完成后即可使用
zh_hant: 點選下一步，等待系統新增方案，安裝完成後即可使用

# 激活使用
source: Activation and usage
ar: التفعيل والاستخدام
es: Activación y uso
id: Aktivasi dan penggunaan
ja: アクティベーションと使用
ko: 활성화 및 사용
ms: Pengaktifan dan penggunaan
pt: Ativação e uso
th: เปิดใช้งานและใช้งาน
vi: Kích hoạt và sử dụng
zh_hans: 激活使用
zh_hant: 啟用與使用

# 测试网络连接，首次连接可能需要等待一段时间
source: Test network connection; first connection may take some time
ar: اختبر الاتصال بالشبكة؛ قد يستغرق الاتصال الأول بعض الوقت
es: Probar la conexión; la primera conexión puede tardar
id: Uji koneksi jaringan; koneksi pertama mungkin memakan waktu
ja: ネットワーク接続をテスト。初回接続には時間がかかる場合があります
ko: 네트워크 연결 테스트 (첫 연결은 시간이 걸릴 수 있음)
ms: Uji sambungan rangkaian; sambungan pertama mungkin mengambil masa
pt: Testar a ligação; a primeira ligação pode demorar
th: ทดสอบการเชื่อมต่อเครือข่าย ครั้งแรกอาจใช้เวลา
vi: Kiểm tra kết nối mạng; lần đầu có thể mất thời gian
zh_hans: 测试网络连接，首次连接可能需要等待一段时间
zh_hant: 測試網路連線，首次連線可能需要等待一段時間

# 选择 添加 eSIM / 添加移动网络
source: Select Add eSIM / Add mobile network
ar: اختر إضافة eSIM / إضافة شبكة المحمول
es: Seleccionar Añadir eSIM / Añadir red móvil
id: Pilih Tambah eSIM / Tambah jaringan seluler
ja: 「eSIM を追加 / モバイルネットワークを追加」を選択
ko: eSIM 추가 / 모바일 네트워크 추가 선택
ms: Pilih Tambah eSIM / Tambah rangkaian mudah alih
pt: Selecionar Adicionar eSIM / Adicionar rede móvel
th: เลือก เพิ่ม eSIM / เพิ่มเครือข่ายมือถือ
vi: Chọn Thêm eSIM / Thêm mạng di động
zh_hans: 选择 添加 eSIM / 添加移动网络
zh_hant: 選擇 新增 eSIM / 新增行動網路

# 点击 安装/添加，完成安装
source: Tap Install/Add to complete
ar: اضغط تثبيت/إضافة للإكمال
es: Tocar Instalar/Añadir para completar
id: Ketuk Instal/Tambah untuk menyelesaikan
ja: 「インストール/追加」をタップして完了
ko: 설치/추가를 탭하여 완료
ms: Ketuk Pasang/Tambah untuk selesai
pt: Tocar Instalar/Adicionar para concluir
th: แตะ ติดตั้ง/เพิ่ม เพื่อเสร็จสิ้น
vi: Chạm Cài đặt/Thêm để hoàn tất
zh_hans: 点击 安装/添加，完成安装
zh_hant: 點選 安裝/新增，完成安裝
