Repository: ChaosSpiritVS/eSIM
Catalog: Simigo/Simigo/Resources/Localizable/*.lproj/Localizable.strings
Languages: ar, es, id, ja, ko, ms, pt, th, vi, zh_hans, zh_hant

# 应该什么时候购买 eSIM?
source: When should I buy an eSIM?
ar: متى يجب أن أشتري eSIM؟
es: ¿Cuándo debo comprar la eSIM?
id: Kapan sebaiknya saya membeli eSIM?
ja: eSIMはいつ購入すればよいですか?
ko: eSIM은 언제 구매해야 하나요?
ms: Bila patut saya membeli eSIM?
pt: Quando devo comprar a eSIM?
th: ควรซื้อ eSIM เมื่อใด?
vi: Tôi nên mua eSIM khi nào?
zh_hans: 应该什么时候购买 eSIM?
zh_hant: 應該什麼時候購買 eSIM?

# 应该什么时候安装 eSIM?
source: When should I install the eSIM?
ar: متى يجب تثبيت eSIM؟
es: ¿Cuándo debo instalar la eSIM?
id: Kapan sebaiknya saya memasang eSIM?
ja: eSIMはいつインストールすればよいですか?
ko: eSIM은 언제 설치해야 하나요?
ms: Bila patut saya memasang eSIM?
pt: Quando devo instalar a eSIM?
th: ควรติดตั้ง eSIM เมื่อใด?
vi: Tôi nên cài đặt eSIM khi nào?
zh_hans: 应该什么时候安装 eSIM?
zh_hant: 應該什麼時候安裝 eSIM?

# 可以重复使用我的 eSIM 吗?
source: Can I reuse my eSIM?
ar: هل يمكنني إعادة استخدام eSIM الخاص بي؟
es: ¿Puedo reutilizar mi eSIM?
id: Bisakah saya menggunakan eSIM saya kembali?
ja: eSIMを再利用できますか？
ko: eSIM을 재사용할 수 있나요?
ms: Bolehkah saya guna semula eSIM saya?
pt: Posso reutilizar minha eSIM?
th: สามารถใช้ eSIM ซ้ำได้หรือไม่?
vi: Tôi có thể tái sử dụng eSIM của mình không?
zh_hans: 可以重复使用我的 eSIM 吗?
zh_hant: 可以重複使用我的 eSIM 嗎?

# 操作成功：%@
source: Operation succeeded: %@
ar: نجحت العملية: %@
es: Operación exitosa: %@
id: Berhasil: %@
ja: 操作が成功しました：%@
ko: 작업 성공: %@
ms: Berjaya: %@
pt: Operação bem-sucedida: %@
th: ดำเนินการสำเร็จ: %@
vi: Thành công: %@
zh_hans: 操作成功：%@
zh_hant: 操作成功：%@

# 提示：%@
source: Note: %@
ar: ملاحظة: %@
es: Nota: %@
id: Catatan: %@
ja: ヒント：%@
ko: 안내: %@
ms: Nota: %@
pt: Nota: %@
th: หมายเหตุ: %@
vi: Lưu ý: %@
zh_hans: 提示：%@
zh_hant: 提示：%@

# 已受理
source: Requested
ar: تم الاستلام
es: Solicitado
id: Diterima
ja: 受け付けました
ko: 요청됨
ms: Diterima
pt: Aceito
th: รับคำขอแล้ว
vi: Đã yêu cầu
zh_hans: 已受理
zh_hant: 已受理

# 审核中
source: Reviewing
ar: قيد المراجعة
es: En revisión
id: Dalam peninjauan
ja: 審査中
ko: 검토 중
ms: Dalam semakan
pt: Em análise
th: กำลังตรวจสอบ
vi: Đang xem xét
zh_hans: 审核中
zh_hant: 審核中

# 已完成
source: Completed
ar: مكتمل
es: Completado
id: Selesai
ja: 完了
ko: 완료됨
ms: Selesai
pt: Concluído
th: เสร็จสิ้น
vi: Hoàn thành
zh_hans: 已完成
zh_hant: 已完成

# 已拒绝
source: Rejected
ar: مرفوض
es: Rechazado
id: Ditolak
ja: 拒否されました
ko: 거부됨
ms: Ditolak
pt: Rejeitado
th: ถูกปฏิเสธ
vi: Bị từ chối
zh_hans: 已拒绝
zh_hant: 已拒絕

# 官方网站
source: Official website
ar: الموقع الرسمي
es: Sitio oficial
id: Situs resmi
ja: 公式サイト
ko: 공식 웹사이트
ms: Laman rasmi
pt: Site oficial
th: เว็บไซต์ทางการ
vi: Trang web chính thức
zh_hans: 官方网站
zh_hant: 官方網站

# 模式
source: Mode
ar: الوضع
es: Modo
ko: 모드
ms: Mod
pt: Modo
th: โหมด
vi: Chế độ
zh_hans: 模式
zh_hant: 模式

# 名字
source: First name
ar: الاسم الأول
es: Nombre
id: Nama depan
ja: 名
ko: 이름
ms: Nama pertama
pt: Nome
th: ชื่อ
vi: Tên
zh_hans: 名字
zh_hant: 名字

# 请填写必填项
source: Please fill in the required fields
ar: يرجى ملء الحقول المطلوبة
es: Por favor, completa los campos obligatorios
id: Harap isi bidang yang wajib
ja: 必須項目を入力してください
ko: 필수 항목을 입력하세요
ms: Sila isi medan wajib
pt: Preencha os campos obrigatórios
th: กรุณากรอกข้อมูลที่จำเป็น
vi: Vui lòng điền các trường bắt buộc
zh_hans: 请填写必填项
zh_hant: 請填寫必填項

# 账户信息
source: Account Information
ar: معلومات الحساب
es: Información de la cuenta
id: Informasi akun
ja: アカウント情報
ko: 계정 정보
ms: Maklumat akaun
pt: Informações da conta
th: ข้อมูลบัญชี
vi: Thông tin tài khoản
zh_hans: 账户信息
zh_hant: 帳戶資訊

# 可选
source: Optional
ar: اختياري
es: Opcional
id: Opsional
ja: 任意
ko: 선택
ms: Pilihan
pt: Opcional
th: ไม่บังคับ
vi: Tùy chọn
zh_hans: 可选
zh_hant: 可選

# 原因
source: Reason
ar: السبب
es: Motivo
id: Alasan
ja: 理由
ko: 사유
ms: Sebab
pt: Motivo
th: เหตุผล
vi: Lý do
zh_hans: 原因
zh_hant: 原因

# 选择原因
source: Choose a reason
ar: اختر السبب
es: Elegir motivo
id: Pilih alasan
ja: 理由を選択
ko: 사유 선택
ms: Pilih sebab
pt: Escolher motivo
th: เลือกเหตุผล
vi: Chọn lý do
zh_hans: 选择原因
zh_hant: 選擇原因

# 不兼容的设备
source: Incompatible device
ar: جهاز غير متوافق
es: Dispositivo incompatible
id: Perangkat tidak kompatibel
ja: 非対応のデバイス
ko: 호환되지 않는 기기
ms: Peranti tidak serasi
pt: Dispositivo incompatível
th: อุปกรณ์ไม่รองรับ
vi: Thiết bị không tương thích
zh_hans: 不兼容的设备
zh_hant: 不相容的裝置

# 数字安全
source: Digital security
ar: الأمن الرقمي
es: Seguridad digital
id: Keamanan digital
ja: デジタルセキュリティ
ko: 디지털 보안
ms: Keselamatan digital
pt: Segurança digital
th: ความปลอดภัยดิจิทัล
vi: Bảo mật số
zh_hans: 数字安全
zh_hant: 數位安全

# 不再需要
source: No longer needed
ar: لم يعد مطلوبًا
es: Ya no es necesario
id: Tidak diperlukan lagi
ja: 不要になった
ko: 더 이상 필요 없음
ms: Tidak diperlukan lagi
pt: Não é mais necessário
th: ไม่ต้องการแล้ว
vi: Không còn cần thiết
zh_hans: 不再需要
zh_hant: 不再需要

# 糟糕的客户服务
source: Poor customer service
ar: خدمة عملاء سيئة
es: Atención al cliente deficiente
id: Layanan pelanggan buruk
ja: 不十分なカスタマーサービス
ko: 열악한 고객 서비스
ms: Khidmat pelanggan teruk
pt: Atendimento ao cliente ruim
th: การบริการลูกค้าไม่ดี
vi: Dịch vụ khách hàng kém
zh_hans: 糟糕的客户服务
zh_hant: 糟糕的客服

# 不佳的用户体验
source: Poor user experience
ar: تجربة مستخدم غير جيدة
es: Mala experiencia de usuario
id: Pengalaman pengguna buruk
ja: 良くないユーザー体験
ko: 나쁜 사용자 경험
ms: Pengalaman pengguna kurang baik
pt: Má experiência do usuário
th: ประสบการณ์ผู้ใช้ไม่ดี
vi: Trải nghiệm người dùng kém
zh_hans: 不佳的用户体验
zh_hant: 不佳的使用者體驗

# 其他
source: Other
ar: أخرى
es: Otro
id: Lainnya
ja: その他
ko: 기타
ms: Lain-lain
pt: Outro
th: อื่น ๆ
vi: Khác
zh_hans: 其他
zh_hant: 其他

# 请输入...
source: Enter...
ar: أدخل...
es: Introduce...
id: Masukkan...
ja: 入力してください...
ko: 입력...
ms: Masukkan...
pt: Digite...
th: กรอก...
vi: Nhập...
zh_hans: 请输入...
zh_hant: 請輸入…

# 确认删除
source: Confirm Delete
ar: تأكيد الحذف
es: Confirmar eliminación
id: Konfirmasi hapus
ja: 削除を確認
ko: 삭제 확인
ms: Sahkan pemadaman
pt: Confirmar exclusão
th: ยืนยันการลบ
vi: Xác nhận xóa
zh_hans: 确认删除
zh_hant: 確認刪除

# 至少 8 位且包含大小写字母、数字与符号。
source: At least 8 characters and include uppercase, lowercase, numbers, and symbols.
ar: ثمانية أحرف على الأقل وتتضمن أحرفًا كبيرة وصغيرة وأرقامًا ورموزًا.
es: Al menos 8 caracteres e incluir mayúsculas, minúsculas, números y símbolos.
id: Minimal 8 karakter dan mencakup huruf besar, kecil, angka, dan simbol.
ja: 8文字以上で、大文字・小文字・数字・記号を含めてください。
ko: 8자 이상이며 대문자, 소문자, 숫자, 기호를 포함해야 합니다.
ms: Sekurang-kurangnya 8 aksara dan termasuk huruf besar/kecil, nombor, simbol.
pt: Pelo menos 8 caracteres e incluir letras maiúsculas/minúsculas, números e símbolos.
th: อย่างน้อย 8 อักขระ และมีตัวพิมพ์ใหญ่ เล็ก ตัวเลข และสัญลักษณ์
vi: Ít nhất 8 ký tự và bao gồm chữ hoa, chữ thường, số và ký hiệu.
zh_hans: 至少 8 位且包含大小写字母、数字与符号。
zh_hant: 至少 8 位且包含大小寫字母、數字與符號。

# 继续
source: Continue
ar: متابعة
es: Continuar
id: Lanjut
ja: 続行
ko: 계속
ms: Teruskan
pt: Continuar
th: ดำเนินการต่อ
vi: Tiếp tục
zh_hans: 继续
zh_hant: 繼續

# 语言：%@
source: Language: %@
ar: اللغة: %@
es: Idioma: %@
id: Bahasa: %@
ja: 言語：%@
ko: 언어: %@
ms: Bahasa: %@
pt: Idioma: %@
th: ภาษา: %@
vi: Ngôn ngữ: %@
zh_hans: 语言：%@
zh_hant: 語言：%@

# 安装成功，已刷新详情与用量
source: Installation succeeded; refreshed details and usage
ar: تم التثبيت بنجاح؛ تم تحديث التفاصيل والاستخدام
es: Instalación exitosa; detalles y uso actualizados
id: Instalasi berhasil; detail dan penggunaan telah diperbarui
ja: インストールに成功しました。詳細と使用量を更新しました
ko: 설치 성공; 상세 정보와 사용량을 새로고침했습니다
ms: Pemasangan berjaya; butiran dan penggunaan telah dikemas kini
pt: Instalação bem-sucedida; detalhes e uso atualizados
th: ติดตั้งสำเร็จ; รีเฟรชรายละเอียดและการใช้งานแล้ว
vi: Cài đặt thành công; đã làm mới chi tiết và mức dùng
zh_hans: 安装成功，已刷新详情与用量
zh_hant: 安装成功，已刷新详情与用量

# 货币：%@
source: Currency: %@
ar: العملة: %@
es: Moneda: %@
id: Mata uang: %@
ja: 通貨：%@
ko: 통화: %@
ms: Mata wang: %@
pt: Moeda: %@
th: สกุลเงิน: %@
vi: Tiền tệ: %@
zh_hans: 货币：%@
zh_hant: 貨幣：%@

# 隐私政策
source: Privacy Policy
ar: سياسة الخصوصية
es: Política de privacidad
id: Kebijakan Privasi
ja: プライバシーポリシー
ko: 개인정보 처리방침
ms: Dasar Privasi
pt: Política de Privacidade
th: นโยบายความเป็นส่วนตัว
vi: Chính sách quyền riêng tư
zh_hans: 隐私政策
zh_hant: 隱私政策

# 服务条款
source: Terms of Service
ar: شروط الخدمة
es: Términos de servicio
id: Ketentuan Layanan
ja: 利用規約
ko: 이용 약관
ms: Syarat Perkhidmatan
pt: Termos de Serviço
th: ข้อกำหนดการให้บริการ
vi: Điều khoản dịch vụ
zh_hans: 服务条款
zh_hant: 服務條款

# 关于
source: About
ar: حول
es: Acerca de
id: Tentang
ja: このアプリについて
ko: 정보
ms: Perihal
pt: Sobre
th: เกี่ยวกับ
vi: Giới thiệu
zh_hans: 关于
zh_hant: 關於

# 未发现匹配的套餐
source: No matching bundles found
ar: لم يتم العثور على باقات مطابقة
es: No se encontraron paquetes coincidentes
id: Tidak ada paket yang cocok
ja: 該当するプランが見つかりません
ko: 일치하는 패키지를 찾을 수 없습니다
ms: Tiada pakej yang sepadan ditemui
pt: Nenhum pacote correspondente encontrado
th: ไม่พบแพ็กเกจที่ตรงกัน
vi: Không tìm thấy gói phù hợp
zh_hans: 未发现匹配的套餐
zh_hant: 未發現匹配的套餐

# 允许匿名使用统计
source: Allow anonymous usage analytics
ar: السماح بتحليلات الاستخدام المجهولة
es: Permitir analítica de uso anónima
id: Izinkan analitik penggunaan anonim
ja: 匿名の使用分析を許可
ko: 익명 사용 분석 허용
ms: Benarkan analitik penggunaan tanpa nama
pt: Permitir análise de uso anônima
th: อนุญาตการวิเคราะห์การใช้งานแบบไม่ระบุตัวตน
vi: Cho phép phân tích sử dụng ẩn danh
zh_hans: 允许匿名使用统计
zh_hant: 允許匿名使用統計

# 允许诊断与崩溃日志
source: Allow diagnostics & crash logs
ar: السماح بالتشخيصات وسجلات الأعطال
es: Permitir diagnósticos y registros de fallos
id: Izinkan diagnostik & log kerusakan
ja: 診断とクラッシュログを許可
ko: 진단 및 크래시 로그 허용
ms: Benarkan diagnostik & log kerosakan
pt: Permitir diagnósticos e registros de falhas
th: อนุญาตบันทึกการวินิจฉัยและการขัดข้อง
vi: Cho phép chẩn đoán và nhật ký sự cố
zh_hans: 允许诊断与崩溃日志
zh_hant: 允許診斷與崩潰日誌

# %d 天
source: %d days
ar: %d يومًا
es: %d días
id: %d hari
ja: %d 日
ko: %d일
ms: %d hari
pt: %d dias
th: %d วัน
vi: %d ngày
zh_hans: %d 天
zh_hant: %d 天

# 是否更改为%@?
source: Switch to %@?
ar: هل تريد التبديل إلى %@؟
es: ¿Cambiar a %@?
id: Ubah ke %@?
ja: %@ に変更しますか？
ko: %@로 변경하시겠습니까?
ms: Tukar ke %@?
pt: Alterar para %@?
th: ต้องการเปลี่ยนเป็น %@ หรือไม่?
vi: Chuyển sang %@?
zh_hans: 是否更改为%@?
zh_hant: 是否更改為%@？

# 所有信息将以所选语言显示。
source: All information will be shown in the selected language.
ar: ستُعرض جميع المعلومات باللغة المحددة.
es: Toda la información se mostrará en el idioma seleccionado.
id: Semua informasi akan ditampilkan dalam bahasa yang dipilih.
ja: すべての情報は選択した言語で表示されます。
ko: 모든 정보가 선택한 언어로 표시됩니다.
ms: Semua maklumat akan dipaparkan dalam bahasa yang dipilih.
pt: Todas as informações serão exibidas no idioma selecionado.
th: ข้อมูลทั้งหมดจะแสดงเป็นภาษาที่เลือก
vi: Mọi thông tin sẽ hiển thị theo ngôn ngữ đã chọn.
zh_hans: 所有信息将以所选语言显示。
zh_hant: 所有資訊將以所選語言顯示。

# 更改
source: Change
ar: تغيير
es: Cambiar
id: Ubah
ja: 変更
ko: 변경
ms: Tukar
pt: Alterar
th: เปลี่ยน
vi: Thay đổi
zh_hans: 更改
zh_hant: 更改

# 有效期政策
source: Validity Policy
ar: سياسة الصلاحية
es: Política de validez
id: Kebijakan masa berlaku
ja: 有効期限ポリシー
ko: 유효기간 정책
ms: Polisi tempoh sah
pt: Política de validade
th: นโยบายระยะเวลาใช้งาน
vi: Chính sách hiệu lực
zh_hans: 有效期政策
zh_hant: 有效期政策

# 当 eSIM 连接到其覆盖范围内的移动网络时，有限期开始计算。如果您在覆盖范围以外安装 eSIM，则可以在到达后连接到网络。
source: Validity starts when the eSIM connects within its coverage area. If you install outside coverage, connect to a network after arrival.
ar: تبدأ الصلاحية عندما تتصل eSIM بشبكة جوّالة داخل نطاق التغطية. إذا قمت بالتثبيت خارج التغطية، اتصل بالشبكة بعد الوصول.
es: La validez comienza cuando la eSIM se conecta dentro de su área de cobertura. Si instalas fuera de cobertura, conéctate a una red después de llegar.
id: Masa berlaku dimulai saat eSIM terhubung ke jaringan seluler dalam area cakupan. Jika memasang di luar cakupan, sambungkan ke jaringan setelah tiba.
ja: eSIM がカバー範囲内のモバイルネットワークに接続すると有効期限の計測が開始されます。カバー範囲外で eSIM をインストールした場合は、到着後にネットワークへ接続してください。
ko: eSIM이 커버리지 내의 모바일 네트워크에 연결되면 유효기간 계산이 시작됩니다. 커버리지 외에서 eSIM을 설치한 경우 도착 후 네트워크에 연결하세요.
ms: Tempoh sah bermula apabila eSIM bersambung ke rangkaian mudah alih dalam kawasan liputan. Jika dipasang di luar liputan, sambung ke rangkaian selepas tiba.
pt: A validade começa quando a eSIM se liga dentro da área de cobertura. Se instalar fora da cobertura, ligue-se a uma rede após a chegada.
th: เมื่อ eSIM เชื่อมต่อกับเครือข่ายมือถือในพื้นที่ครอบคลุม จะเริ่มนับระยะเวลาใช้งาน หากติดตั้งนอกพื้นที่ครอบคลุม ให้เชื่อมต่อเครือข่ายหลังจากถึงปลายทาง
vi: Thời hạn bắt đầu khi eSIM kết nối trong vùng phủ sóng. Nếu cài đặt ngoài vùng phủ sóng, hãy kết nối mạng sau khi đến nơi.
zh_hans: 当 eSIM 连接到其覆盖范围内的移动网络时，有限期开始计算。如果您在覆盖范围以外安装 eSIM，则可以在到达后连接到网络。
zh_hant: 當 eSIM 連接到其覆蓋範圍內的行動網路時，效期開始計算。若您在覆蓋範圍以外安裝 eSIM，則可在抵達後連線至網路。

# IP 路由
source: IP Routing
ar: توجيه IP
es: Enrutamiento IP
id: Perutean IP
ja: IP ルーティング
ko: IP 라우팅
ms: Penghalaan IP
pt: Encaminhamento IP
th: การกำหนดเส้นทาง IP
vi: Định tuyến IP
zh_hans: IP 路由
zh_hant: IP 路由

# 您可能会注意到此 eSIM 有一个备用 IP 地址。这不会影响您使用的流量。
source: You may notice a secondary IP address for this eSIM. This does not affect your data usage.
ar: قد تلاحظ وجود عنوان IP ثانوي لهذه eSIM. هذا لا يؤثر على استهلاك البيانات.
es: Es posible que esta eSIM tenga una dirección IP secundaria. Esto no afecta tu consumo de datos.
id: Anda mungkin melihat alamat IP sekunder untuk eSIM ini. Hal ini tidak memengaruhi penggunaan data Anda.
ja: この eSIM にはセカンダリ IP アドレスが付与される場合があります。データ使用量への影響はありません。
ko: 이 eSIM에서 보조 IP 주소가 표시될 수 있습니다. 데이터 사용량에는 영향을 주지 않습니다.
ms: Anda mungkin melihat alamat IP sekunder untuk eSIM ini. Ini tidak menjejaskan penggunaan data anda.
pt: Pode notar um endereço IP secundário para esta eSIM. Isto não afeta o seu consumo de dados.
th: คุณอาจพบว่า eSIM นี้มีที่อยู่ IP สำรอง ซึ่งไม่ส่งผลต่อการใช้ดาต้าของคุณ
vi: Bạn có thể thấy eSIM này có địa chỉ IP phụ. Điều này không ảnh hưởng đến mức dữ liệu sử dụng của bạn.
zh_hans: 您可能会注意到此 eSIM 有一个备用 IP 地址。这不会影响您使用的流量。
zh_hant: 您可能會注意到此 eSIM 有一個備用 IP 位址。這不會影響您的流量使用。

# 续费/充值
source: Renewal / Top-up
ar: تجديد / تعبئة رصيد
es: Renovación / Recarga
id: Perpanjangan / Isi Ulang
ja: 更新／チャージ
ko: 갱신/충전
ms: Pembaharuan / Tambah nilai
pt: Renovação / Recarga
th: ต่ออายุ/เติมเงิน
vi: Gia hạn / Nạp tiền
zh_hans: 续费/充值
zh_hant: 續費/充值

# 当前套餐续费功能暂未开放。流量用完或到期后，请重新购买新的套餐以继续使用。
source: Renewal is not available for this bundle. When data is used up or expires, please purchase a new bundle to continue using the service.
ar: ميزة التجديد غير متاحة لهذه الباقة حاليًا. عند نفاد البيانات أو انتهاء الصلاحية، يرجى شراء باقة جديدة لمتابعة الخدمة.
es: La renovación no está disponible para este paquete. Cuando los datos se agoten o caduquen, compra un nuevo paquete para continuar usando el servicio.
id: Fitur perpanjangan untuk paket ini belum tersedia. Saat data habis atau kedaluwarsa, silakan beli paket baru untuk melanjutkan penggunaan layanan.
ja: このプランの更新機能は現在ご利用いただけません。データが使い切るか有効期限が切れた場合は、新しいプランを購入してご利用ください。
ko: 해당 요금제는 현재 갱신을 지원하지 않습니다. 데이터가 소진되거나 만료되면 계속 사용하려면 새 요금제를 구매하세요.
ms: Fungsi pembaharuan untuk pakej ini belum tersedia. Apabila data habis atau tamat, sila beli pakej baharu untuk terus menggunakan perkhidmatan.
pt: A renovação não está disponível para esta oferta. Quando os dados terminarem ou expirarem, adquira uma nova oferta para continuar a utilizar o serviço.
th: แพ็กเกจนี้ยังไม่รองรับการต่ออายุ เมื่อข้อมูลหมดหรือหมดอายุ โปรดซื้อแพ็กเกจใหม่เพื่อใช้งานต่อ
vi: Gói này hiện chưa hỗ trợ gia hạn. Khi dữ liệu hết hoặc hết hạn, hãy mua gói mới để tiếp tục sử dụng dịch vụ.
zh_hans: 当前套餐续费功能暂未开放。流量用完或到期后，请重新购买新的套餐以继续使用。
zh_hant: 目前套餐續費功能暫未開放。流量用完或到期後，請重新購買新的套餐以繼續使用。

# 按照以下步骤使用你的 eSIM，请记住，您的 eSIM 只能在连接到网络时获得支持。
source: Follow the steps below to use your eSIM. Remember, your eSIM is only supported when connected to a network.
ar: اتبع الخطوات أدناه لاستخدام شريحة eSIM الخاصة بك. تذكّر أن eSIM مدعوم فقط عند الاتصال بالشبكة.
es: Sigue los pasos siguientes para usar tu eSIM. Recuerda que tu eSIM solo está soportada cuando está conectada a una red.
id: Ikuti langkah di bawah untuk menggunakan eSIM Anda. Ingat, eSIM Anda hanya didukung saat terhubung ke jaringan.
ja: 以下の手順に従って eSIM を使用してください。eSIM はネットワークに接続されている場合のみサポートされます。
ko: 아래 단계에 따라 eSIM을 사용하세요. eSIM은 네트워크에 연결된 경우에만 지원됩니다.
ms: Ikuti langkah di bawah untuk menggunakan eSIM anda. Ingat, eSIM anda hanya disokong apabila disambungkan ke rangkaian.
pt: Siga os passos abaixo para usar sua eSIM. Lembre-se: sua eSIM só é suportada quando estiver conectada a uma rede.
th: ทำตามขั้นตอนด้านล่างเพื่อใช้งาน eSIM โปรดทราบว่า eSIM จะได้รับการรองรับเฉพาะเมื่อเชื่อมต่อเครือข่ายเท่านั้น
vi: Làm theo các bước dưới đây để sử dụng eSIM của bạn. Lưu ý: eSIM chỉ được hỗ trợ khi kết nối mạng.
zh_hans: 按照以下步骤使用你的 eSIM，请记住，您的 eSIM 只能在连接到网络时获得支持。
zh_hant: 請按照以下步驟使用你的 eSIM，請注意，eSIM 僅在連接到網路時才受支援。

# 返回
source: Back
ar: رجوع
es: Atrás
id: Kembali
ja: 戻る
ko: 뒤로
ms: Kembali
pt: Voltar
th: กลับ
vi: Quay lại
zh_hans: 返回
zh_hant: 返回

# 货币名_USD
source: US Dollar (USD) $
ar: الدولار الأمريكي (USD) $
es: Dólar estadounidense (USD) $
id: Dolar AS (USD) $
ja: 米ドル (USD) $
ko: 미국 달러 (USD) $
ms: Dolar AS (USD) $
pt: Dólar americano (USD) $
th: ดอลลาร์สหรัฐ (USD) $
vi: Đô la Mỹ (USD) $
zh_hans: 美元 (USD) $
zh_hant: 美元 (USD) $

# 货币名_CHF
source: Swiss Franc (CHF) CHF
ar: الفرنك السويسري (CHF) CHF
es: Franco suizo (CHF) CHF
id: Franc Swiss (CHF) CHF
ja: スイスフラン (CHF) CHF
ko: 스위스 프랑 (CHF) CHF
ms: Franc Swiss (CHF) CHF
pt: Franco suíço (CHF) CHF
th: ฟรังก์สวิส (CHF) CHF
vi: Frăng Thụy Sĩ (CHF) CHF
zh_hans: 瑞士法郎 (CHF) CHF
zh_hant: 瑞士法郎 (CHF) CHF

# 货币名_CNY
source: Chinese Yuan (CNY) ¥
ar: اليوان الصيني (CNY) ¥
es: Yuan chino (CNY) ¥
id: Yuan Tiongkok (CNY) ¥
ja: 人民元 (CNY) ¥
ko: 중국 위안 (CNY) ¥
ms: Yuan China (CNY) ¥
pt: Yuan chinês (CNY) ¥
th: หยวนจีน (CNY) ¥
vi: Nhân dân tệ (CNY) ¥
zh_hans: 人民币 (CNY) ¥
zh_hant: 人民幣 (CNY) ¥

# 货币名_EUR
source: Euro (EUR) €
ar: اليورو (EUR) €
ja: ユーロ (EUR) €
ko: 유로 (EUR) €
th: ยูโร (EUR) €
zh_hans: 欧元 (EUR) €
zh_hant: 歐元 (EUR) €

# 货币名_GBP
source: British Pound (GBP) £
ar: الجنيه الإسترليني (GBP) £
es: Libra esterlina (GBP) £
id: Pound Inggris (GBP) £
ja: 英ポンド (GBP) £
ko: 영국 파운드 (GBP) £
ms: Pound British (GBP) £
pt: Libra esterlina (GBP) £
th: ปอนด์อังกฤษ (GBP) £
vi: Bảng Anh (GBP) £
zh_hans: 英镑 (GBP) £
zh_hant: 英鎊 (GBP) £

# 货币名_HKD
source: Hong Kong Dollar (HKD) HK$
ar: دولار هونغ كونغ (HKD) HK$
es: Dólar de Hong Kong (HKD) HK$
id: Dolar Hong Kong (HKD) HK$
ja: 香港ドル (HKD) HK$
ko: 홍콩 달러 (HKD) HK$
ms: Dolar Hong Kong (HKD) HK$
pt: Dólar de Hong Kong (HKD) HK$
th: ดอลลาร์ฮ่องกง (HKD) HK$
vi: Đô la Hồng Kông (HKD) HK$
zh_hans: 港币 (HKD) HK$
zh_hant: 港幣 (HKD) HK$

# 货币名_JPY
source: Japanese Yen (JPY) ¥
ar: الين الياباني (JPY) ¥
es: Yen japonés (JPY) ¥
id: Yen Jepang (JPY) ¥
ja: 日本円 (JPY) ¥
ko: 일본 엔 (JPY) ¥
ms: Yen Jepun (JPY) ¥
pt: Iene japonês (JPY) ¥
th: เยนญี่ปุ่น (JPY) ¥
vi: Yên Nhật (JPY) ¥
zh_hans: 日元 (JPY) ¥
zh_hant: 日圓 (JPY) ¥

# 货币名_SGD
source: Singapore Dollar (SGD) S$
ar: دولار سنغافورة (SGD) S$
es: Dólar singapurense (SGD) S$
id: Dolar Singapura (SGD) S$
ja: シンガポールドル (SGD) S$
ko: 싱가포르 달러 (SGD) S$
ms: Dolar Singapura (SGD) S$
pt: Dólar de Singapura (SGD) S$
th: ดอลลาร์สิงคโปร์ (SGD) S$
vi: Đô la Singapore (SGD) S$
zh_hans: 新加坡元 (SGD) S$
zh_hant: 新加坡元 (SGD) S$

# 价格将以所选货币显示。
source: Prices will be shown in the selected currency.
ar: سيتم عرض السعر بالعملة المحددة.
es: El precio se mostrará en la moneda seleccionada.
id: Harga akan ditampilkan dalam mata uang yang dipilih.
ja: 価格は選択した通貨で表示されます。
ko: 가격은 선택한 통화로 표시됩니다.
ms: Harga akan dipaparkan dalam mata wang yang dipilih.
pt: O preço será exibido na moeda selecionada.
th: ราคาจะแสดงเป็นสกุลเงินที่คุณเลือก
vi: Giá sẽ được hiển thị theo đơn vị tiền tệ đã chọn.
zh_hans: 价格将以所选货币显示。
zh_hant: 價格將以所選貨幣顯示。

# 货币名_KRW
source: South Korean Won (KRW) ₩
ar: وون كوري جنوبي (KRW) ₩
es: Won surcoreano (KRW) ₩
id: Won Korea Selatan (KRW) ₩
ja: 韓国ウォン (KRW) ₩
ko: 대한민국 원 (KRW) ₩
ms: Won Korea Selatan (KRW) ₩
pt: Won sul-coreano (KRW) ₩
th: วอนเกาหลีใต้ (KRW) ₩
vi: Won Hàn Quốc (KRW) ₩
zh_hans: 韩元 (KRW) ₩
zh_hant: 韓圓 (KRW) ₩

# 货币名_THB
source: Thai Baht (THB) ฿
ar: بات تايلاندي (THB) ฿
es: Baht tailandés (THB) ฿
id: Baht Thailand (THB) ฿
ja: タイバーツ (THB) ฿
ko: 태국 바트 (THB) ฿
ms: Baht Thai (THB) ฿
pt: Baht tailandês (THB) ฿
th: บาทไทย (THB) ฿
vi: Baht Thái (THB) ฿
zh_hans: 泰铢 (THB) ฿
zh_hant: 泰銖 (THB) ฿

# 货币名_IDR
source: Indonesian Rupiah (IDR) Rp
ar: روبية إندونيسية (IDR) Rp
es: Rupia indonesia (IDR) Rp
id: Rupiah Indonesia (IDR) Rp
ja: インドネシアルピア (IDR) Rp
ko: 인도네시아 루피아 (IDR) Rp
ms: Rupiah Indonesia (IDR) Rp
pt: Rupia indonésia (IDR) Rp
th: รูเปียห์อินโดนีเซีย (IDR) Rp
vi: Rupiah Indonesia (IDR) Rp
zh_hans: 印尼卢比 (IDR) Rp
zh_hant: 印尼盾 (IDR) Rp

# 货币名_MYR
source: Malaysian Ringgit (MYR) RM
ar: رينجيت ماليزي (MYR) RM
es: Ringgit malayo (MYR) RM
id: Ringgit Malaysia (MYR) RM
ja: マレーシアリンギット (MYR) RM
ko: 말레이시아 링깃 (MYR) RM
ms: Ringgit Malaysia (MYR) RM
pt: Ringgit malaio (MYR) RM
th: ริงกิตมาเลเซีย (MYR) RM
vi: Ringgit Malaysia (MYR) RM
zh_hans: 马来西亚林吉特 (MYR) RM
zh_hant: 馬來西亞令吉 (MYR) RM

# 货币名_VND
source: Vietnamese Dong (VND) ₫
ar: دونغ فيتنامي (VND) ₫
es: Dong vietnamita (VND) ₫
id: Dong Vietnam (VND) ₫
ja: ベトナムドン (VND) ₫
ko: 베트남 동 (VND) ₫
ms: Dong Vietnam (VND) ₫
pt: Dong vietnamita (VND) ₫
th: ดองเวียดนาม (VND) ₫
vi: Đồng Việt Nam (VND) ₫
zh_hans: 越南盾 (VND) ₫
zh_hant: 越南盾 (VND) ₫

# 货币名_BRL
source: Brazilian Real (BRL) R$
ar: ريال برازيلي (BRL) R$
es: Real brasileño (BRL) R$
id: Real Brasil (BRL) R$
ja: ブラジルレアル (BRL) R$
ko: 브라질 레알 (BRL) R$
ms: Real Brazil (BRL) R$
pt: Real brasileiro (BRL) R$
th: เรียลบราซิล (BRL) R$
vi: Real Brazil (BRL) R$
zh_hans: 巴西雷亚尔 (BRL) R$
zh_hant: 巴西雷亞爾 (BRL) R$

# 货币名_MXN
source: Mexican Peso (MXN) MX$
ar: بيزو مكسيكي (MXN) MX$
es: Peso mexicano (MXN) MX$
id: Peso Meksiko (MXN) MX$
ja: メキシコペソ (MXN) MX$
ko: 멕시코 페소 (MXN) MX$
ms: Peso Mexico (MXN) MX$
pt: Peso mexicano (MXN) MX$
th: เปโซเม็กซิโก (MXN) MX$
vi: Peso Mexico (MXN) MX$
zh_hans: 墨西哥比索 (MXN) MX$
zh_hant: 墨西哥比索 (MXN) MX$

# 货币名_TWD
source: New Taiwan Dollar (TWD) NT$
ar: دولار تايواني جديد (TWD) NT$
es: Nuevo dólar taiwanés (TWD) NT$
id: Dolar Taiwan Baru (TWD) NT$
ja: 新台湾ドル (TWD) NT$
ko: 신타이완 달러 (TWD) NT$
ms: Dolar Taiwan Baru (TWD) NT$
pt: Novo dólar taiwanês (TWD) NT$
th: ดอลลาร์ไต้หวันใหม่ (TWD) NT$
vi: Đô la Đài Loan mới (TWD) NT$
zh_hans: 新台币 (TWD) NT$
zh_hant: 新台幣 (TWD) NT$

# 货币名_AED
source: UAE Dirham (AED) AED
ar: درهم إماراتي (AED) AED
es: Dírham de EAU (AED) AED
id: Dirham UEA (AED) AED
ja: UAEディルハム (AED) AED
ko: 아랍에미리트 디르함 (AED) AED
ms: Dirham UAE (AED) AED
pt: Dirham dos EAU (AED) AED
th: เดิร์แฮมสหรัฐอาหรับเอมิเรตส์ (AED) AED
vi: Dirham UAE (AED) AED
zh_hans: 阿联酋迪拉姆 (AED) AED
zh_hant: 阿聯酋迪拉姆 (AED) AED

# 货币名_SAR
source: Saudi Riyal (SAR) SAR
ar: ريال سعودي (SAR) SAR
es: Riyal saudí (SAR) SAR
id: Riyal Saudi (SAR) SAR
ja: サウジリヤル (SAR) SAR
ko: 사우디 리얄 (SAR) SAR
ms: Riyal Arab Saudi (SAR) SAR
pt: Rial saudita (SAR) SAR
th: ริยาลซาอุ (SAR) SAR
vi: Riyal Ả Rập Saudi (SAR) SAR
zh_hans: 沙特里亚尔 (SAR) SAR
zh_hant: 沙特里亞爾 (SAR) SAR

# 货币名_AUD
source: Australian Dollar (AUD) A$
ar: دولار أسترالي (AUD) A$
es: Dólar australiano (AUD) A$
id: Dolar Australia (AUD) A$
ja: オーストラリアドル (AUD) A$
ko: 호주 달러 (AUD) A$
ms: Dolar Australia (AUD) A$
pt: Dólar australiano (AUD) A$
th: ดอลลาร์ออสเตรเลีย (AUD) A$
vi: Đô la Úc (AUD) A$
zh_hans: 澳大利亚元 (AUD) A$
zh_hant: 澳元 (AUD) A$

# 货币名_CAD
source: Canadian Dollar (CAD) C$
ar: دولار كندي (CAD) C$
es: Dólar canadiense (CAD) C$
id: Dolar Kanada (CAD) C$
ja: カナダドル (CAD) C$
ko: 캐나다 달러 (CAD) C$
ms: Dolar Kanada (CAD) C$
pt: Dólar canadense (CAD) C$
th: ดอลลาร์แคนาดา (CAD) C$
vi: Đô la Canada (CAD) C$
zh_hans: 加拿大元 (CAD) C$
zh_hant: 加元 (CAD) C$

# 帮助中心
source: Help Center
ar: مركز المساعدة
id: Pusat Bantuan
ja: ヘルプセンター
ko: 도움말 센터
pt: Centro de Ajuda
th: ศูนย์ช่วยเหลือ
zh_hans: 帮助中心
zh_hant: 幫助中心

# 一般条款
source: General Terms
ar: الشروط العامة
pt: Termos gerais
zh_hans: 一般条款

# 使用条款
source: Terms of Service
ar: شروط الاستخدام
pt: Termos de uso
zh_hans: 使用条款

# 合理使用政策
source: Acceptable Use Policy
ar: سياسة الاستخدام المناسب
pt: Política de uso aceitável
zh_hans: 合理使用政策

# Cookie 政策
source: Cookie Policy
ar: سياسة الكوكيز
pt: Política de cookies
zh_hans: Cookie 政策

# 一般条款简介
source: General Terms Overview
zh_hans: 一般条款简介
