Repository: ChaosSpiritVS/eSIM
Catalog: Simigo/Simigo/Resources/Localizable/*.lproj/Localizable.strings
Languages: ar, es, id, ja, ko, ms, pt, th, vi, zh_hans, zh_hant

# 商店
source: Store
ar: المتجر
es: Tienda
id: Toko
ja: ストア
ko: 스토어
ms: Kedai
pt: Loja
th: ร้านค้า
vi: Cửa hàng
zh_hans: 商店
zh_hant: 商店

# 我的 eSIM
source: My eSIM
ar: eSIM الخاصة بي
es: Mi eSIM
id: eSIM saya
ja: マイ eSIM
ko: 내 eSIM
ms: eSIM saya
pt: Minha eSIM
th: eSIM ของฉัน
vi: eSIM của tôi
zh_hans: 我的 eSIM
zh_hant: 我的 eSIM

# 个人资料
source: Profile
ar: الملف الشخصي
es: Perfil
id: Profil
ja: プロフィール
ko: 프로필
ms: Profil
pt: Perfil
th: โปรไฟล์
vi: Hồ sơ
zh_hans: 个人资料
zh_hant: 個人資料

# 订单
source: Orders
ar: الطلبات
es: Pedidos
id: Pesanan
ja: 注文
ko: 주문
ms: Pesanan
pt: Pedidos
th: คำสั่งซื้อ
vi: Đơn hàng
zh_hans: 订单
zh_hant: 訂單

# 客服与支持
source: Support
ar: الدعم
es: Soporte
id: Dukungan
ja: サポート
ko: 지원
ms: Sokongan
pt: Suporte
th: ฝ่ายสนับสนุน
vi: Hỗ trợ
zh_hans: 客服与支持
zh_hant: 客服與支持

# 热门
source: Popular
ar: شائع
es: Populares
id: Populer
ja: 人気
ko: 인기
pt: Populares
th: ยอดนิยม
vi: Phổ biến
zh_hans: 热门
zh_hant: 熱門

# 未找到匹配的套餐
source: No matching bundles found
ar: لم يتم العثور على باقات مطابقة
es: No se encontraron paquetes coincidentes
id: Tidak ada paket yang cocok
ja: 該当するプランが見つかりません
ko: 일치하는 패키지를 찾을 수 없습니다
ms: Tiada pakej yang sepadan ditemui
pt: Nenhum pacote correspondente encontrado
th: ไม่พบแพ็กเกจที่ตรงกัน
vi: Không tìm thấy gói phù hợp
zh_hans: 未找到匹配的套餐
zh_hant: 未找到匹配的套餐

# 查看套餐
source: View Bundle
ar: عرض الباقة
es: Ver paquete
id: Lihat Paket
ja: プランを見る
ko: 패키지 보기
ms: Lihat pakej
pt: Ver pacote
th: ดูแพ็กเกจ
vi: Xem gói
zh_hans: 查看套餐
zh_hant: 查看套餐

# 搜索国家/地区或流量
source: Search country/region or data
ar: ابحث عن بلد/منطقة أو بيانات
es: Buscar país/región o datos
id: Cari negara/wilayah atau data
ja: 国/地域またはデータ量を検索
ko: 국가/지역 또는 데이터 검색
ms: Cari negara/wilayah atau data
th: ค้นหาประเทศ/ภูมิภาคหรือข้อมูล
vi: Tìm quốc gia/khu vực hoặc dữ liệu
zh_hans: 搜索国家/地区或流量
zh_hant: 搜尋國家/地區或流量

# 排序
source: Sort
ar: فرز
es: Ordenar
id: Urutkan
ja: 並び替え
ko: 정렬
ms: Isih
pt: Ordenar
th: จัดเรียง
vi: Sắp xếp
zh_hans: 排序
zh_hant: 排序

# 价格：
source: Price:
ar: السعر:
es: Precio:
id: Harga:
ja: 価格：
ko: 가격:
ms: Harga:
pt: Preço:
th: ราคา:
vi: Giá:
zh_hans: 价格：
zh_hant: 價格：

# 搜索订单ID或套餐ID
source: Search order ID or bundle ID
ar: ابحث عن رقم الطلب أو رقم الباقة
es: Buscar ID de pedido o ID de paquete
id: Cari ID pesanan atau ID paket
ja: 注文IDまたはプランIDを検索
ko: 주문 ID 또는 패키지 ID 검색
ms: Cari ID pesanan atau ID pakej
th: ค้นหา ID คำสั่งซื้อหรือ ID แพ็กเกจ
vi: Tìm ID đơn hàng hoặc ID gói
zh_hans: 搜索订单ID或套餐ID
zh_hant: 搜尋訂單ID或套餐ID

# 订单加载完成后可查看套餐或支付
source: View bundle or pay after order loads
ar: بعد تحميل الطلب يمكنك عرض الباقة أو الدفع
es: Tras cargarse el pedido, podrás ver el paquete o pagar
id: Setelah pesanan dimuat, Anda bisa melihat paket atau membayar
ja: 注文の読み込みが完了すると、プランの表示または支払いができます
ko: 주문 로드 후 상품 확인 또는 결제 가능
ms: Selepas pesanan dimuat, anda boleh lihat pakej atau membuat bayaran
pt: Após carregar o pedido, poderá ver o pacote ou pagar
th: เมื่อโหลดคำสั่งซื้อเสร็จ สามารถดูแพ็กเกจหรือชำระเงินได้
vi: Sau khi tải đơn hàng xong, bạn có thể xem gói hoặc thanh toán
zh_hans: 订单加载完成后可查看套餐或支付
zh_hant: 訂單載入完成後可查看套餐或支付

# 剩余流量
source: Remaining Data
ar: البيانات المتبقية
es: Datos restantes
id: Sisa data
ja: 残りデータ
ko: 남은 데이터
ms: Data baki
pt: Dados restantes
th: ข้อมูลคงเหลือ
vi: Dữ liệu còn lại
zh_hans: 剩余流量
zh_hant: 剩餘流量

# 查看套餐详情
source: View Bundle Details
ar: عرض تفاصيل الباقة
es: Ver detalles del paquete
id: Lihat detail paket
ja: プランの詳細を見る
ko: 상품 상세 보기
ms: Lihat butiran pakej
pt: Ver detalhes do pacote
th: ดูรายละเอียดแพ็กเกจ
vi: Xem chi tiết gói
zh_hans: 查看套餐详情
zh_hant: 查看套餐詳情

# 按语言搜索
source: Search languages
ar: ابحث حسب اللغة
es: Buscar por idioma
id: Cari berdasarkan bahasa
ja: 言語で検索
ko: 언어로 검색
ms: Cari mengikut bahasa
th: ค้นหาตามภาษา
vi: Tìm theo ngôn ngữ
zh_hans: 按语言搜索
zh_hant: 按語言搜尋

# 按货币搜索
source: Search currencies
ar: بحث حسب العملة
es: Buscar por moneda
id: Cari berdasarkan mata uang
ja: 通貨で検索
ko: 통화로 검색
ms: Cari mengikut mata wang
pt: Pesquisar por moeda
th: ค้นหาตามสกุลเงิน
vi: Tìm theo loại tiền tệ
zh_hans: 按货币搜索
zh_hant: 按貨幣搜尋

# 搜索
source: Search
ar: بحث
es: Buscar
id: Cari
ja: 検索
ko: 검색
ms: Cari
pt: Pesquisar
th: ค้นหา
vi: Tìm kiếm
zh_hans: 搜索
zh_hant: 搜尋

# 搜索订单ID
source: Search order ID
ar: بحث عن معرف الطلب
es: Buscar ID de pedido
id: Cari ID pesanan
ja: 注文IDを検索
ko: 주문 ID 검색
ms: Cari ID pesanan
pt: Pesquisar ID do pedido
th: ค้นหา ID คำสั่งซื้อ
vi: Tìm ID đơn hàng
zh_hans: 搜索订单ID
zh_hant: 搜尋訂單ID

# 分类
source: Category
ar: فئة
es: Categoría
id: Kategori
ja: カテゴリ
ko: 카테고리
ms: Kategori
pt: Categoria
th: หมวดหมู่
vi: Danh mục
zh_hans: 分类
zh_hant: 分類

# 可用套餐
source: Available Bundles
ar: باقات متاحة
es: Paquetes disponibles
id: Paket yang tersedia
ja: 利用可能なプラン
ko: 사용 가능한 패키지
ms: Pakej tersedia
pt: Pacotes disponíveis
th: แพ็กเกจที่มี
vi: Gói khả dụng
zh_hans: 可用套餐
zh_hant: 可用套餐

# 查看更多
source: View more
ar: عرض المزيد
es: Ver más
id: Lihat lebih banyak
ja: さらに表示
ko: 더보기
ms: Lihat lagi
pt: Ver mais
th: ดูเพิ่มเติม
vi: Xem thêm
zh_hans: 查看更多
zh_hant: 查看更多

# 您需要哪里的 eSIM?
source: Which region's eSIM do you need?
ar: تحتاج إلى eSIM لأي منطقة؟
es: ¿De qué región necesitas la eSIM?
id: Anda perlu eSIM wilayah mana?
ja: どの地域の eSIM が必要ですか？
ko: 어느 지역의 eSIM이 필요하신가요?
ms: Anda perlukan eSIM untuk wilayah mana?
pt: De que região precisa da eSIM?
th: คุณต้องการ eSIM ของภูมิภาคใด?
vi: Bạn cần eSIM cho khu vực nào?
zh_hans: 您需要哪里的 eSIM?
zh_hant: 您需要哪裡的 eSIM?

# 退出编辑
source: Exit editing
ar: إنهاء التحرير
es: Salir de la edición
id: Keluar dari penyuntingan
ja: 編集を終了
ko: 편집 종료
ms: Keluar daripada mod edit
pt: Sair da edição
th: ออกจากการแก้ไข
vi: Thoát chế độ chỉnh sửa
zh_hans: 退出编辑
zh_hant: 退出編輯

# 最近搜索
source: Recent searches
ar: عمليات البحث الأخيرة
es: Búsquedas recientes
id: Pencarian terbaru
ja: 最近の検索
ko: 최근 검색
ms: Carian terkini
pt: Pesquisas recentes
th: การค้นหาล่าสุด
vi: Tìm kiếm gần đây
zh_hans: 最近搜索
zh_hant: 最近搜尋

# 未找到相关内容
source: No related content found
ar: لم يتم العثور على محتوى ذي صلة
es: No se encontró contenido relacionado
id: Tidak ditemukan konten terkait
ja: 関連する内容が見つかりません
ko: 관련 콘텐츠를 찾을 수 없습니다
ms: Tiada kandungan berkaitan ditemui
pt: Nenhum conteúdo relacionado encontrado
th: ไม่พบเนื้อหาที่เกี่ยวข้อง
vi: Không tìm thấy nội dung liên quan
zh_hans: 未找到相关内容
zh_hant: 未找到相關內容

# 试试更短的关键词，或切换分类
source: Try shorter keywords or switch category
ar: جرّب كلمات مفتاحية أقصر أو بدّل الفئة
es: Prueba palabras clave más cortas o cambia de categoría
id: Coba kata kunci yang lebih pendek atau ganti kategori
ja: 短いキーワードにするか、カテゴリーを切り替えてください
ko: 더 짧은 키워드를 사용하거나 카테고리를 변경해 보세요
ms: Cuba kata kunci yang lebih pendek, atau tukar kategori
pt: Experimente palavras‑chave mais curtas ou mude de categoria
th: ลองใช้คำค้นที่สั้นลง หรือสลับหมวดหมู่
vi: Hãy thử từ khóa ngắn hơn hoặc đổi danh mục
zh_hans: 试试更短的关键词，或切换分类
zh_hant: 試試更短的關鍵字，或切換分類

# 价格（↑）
source: Price (↑)
ar: السعر (↑)
es: Precio (↑)
id: Harga (↑)
ja: 価格（↑）
ko: 가격(↑)
ms: Harga (↑)
pt: Preço (↑)
th: ราคา (↑)
vi: Giá (↑)
zh_hans: 价格（↑）
zh_hant: 價格（↑）

# 价格（↓）
source: Price (↓)
ar: السعر (↓)
es: Precio (↓)
id: Harga (↓)
ja: 価格（↓）
ko: 가격(↓)
ms: Harga (↓)
pt: Preço (↓)
th: ราคา (↓)
vi: Giá (↓)
zh_hans: 价格（↓）
zh_hant: 價格（↓）

# 价格
source: Price
ar: السعر
es: Precio
id: Harga
ja: 価格
ko: 가격
ms: Harga
th: ราคา
vi: Giá
zh_hans: 价格
zh_hant: 價格

# 流量（↑）
source: Data (↑)
ar: البيانات (↑)
es: Datos (↑)
ja: データ（↑）
ko: 데이터(↑)
pt: Dados (↑)
th: ข้อมูล (↑)
vi: Dữ liệu (↑)
zh_hans: 流量（↑）
zh_hant: 流量（↑）

# 流量（↓）
source: Data (↓)
ar: البيانات (↓)
es: Datos (↓)
ja: データ（↓）
ko: 데이터(↓)
pt: Dados (↓)
th: ข้อมูล (↓)
vi: Dữ liệu (↓)
zh_hans: 流量（↓）
zh_hant: 流量（↓）

# 流量
source: Data
ar: البيانات
es: Datos
ja: データ量
ko: 데이터
pt: Dados
th: ข้อมูล
vi: Dữ liệu
zh_hans: 流量
zh_hant: 流量

# 总流量
source: Total data
ar: البيانات المخصصة
es: Datos asignados
id: Data dialokasikan
ja: 総データ量
ko: 총 데이터
ms: Data diperuntukkan
pt: Dados alocados
th: ข้อมูลทั้งหมด
vi: Dữ liệu cấp
zh_hans: 总流量
zh_hant: 總流量

# 已用流量
source: Used data
ar: البيانات المستخدمة
es: Datos usados
id: Data terpakai
ja: 使用済みデータ
ko: 사용된 데이터
ms: Data digunakan
pt: Dados usados
th: ข้อมูลที่ใช้แล้ว
vi: Dữ liệu đã dùng
zh_hans: 已用流量
zh_hant: 已用流量

# 当前套餐不支持续费。流量用尽或到期后需要重新购买新的套餐；已安装的 eSIM 不可复用到新的订单。
source: This bundle doesn't support renewal. After data is used or expires, purchase a new bundle; an installed eSIM can't be reused for new orders.
ar: هذه الباقة لا تدعم التجديد. بعد نفاد البيانات أو انتهاء الصلاحية، يرجى شراء باقة جديدة؛ لا يمكن إعادة استخدام eSIM المثبتة لطلبات جديدة
es: Este paquete no admite renovación. Cuando se agoten los datos o caduque, compra un nuevo paquete; la eSIM instalada no se puede reutilizar en nuevos pedidos.
id: Paket ini tidak mendukung perpanjangan. Setelah data habis atau kedaluwarsa, beli paket baru; eSIM yang telah terpasang tidak dapat digunakan kembali untuk pesanan baru.
ja: このプランは更新に対応していません。データの使い切りまたは有効期限後は新しいプランを購入してください。インストール済みの eSIM は新しい注文で再利用できません
ko: 이 플랜은 갱신을 지원하지 않습니다. 데이터가 소진되거나 만료되면 새 플랜을 구매하세요; 설치된 eSIM은 새 주문에 재사용할 수 없습니다
ms: Pakej ini tidak menyokong pembaharuan. Setelah data habis atau tamat tempoh, beli pakej baharu; eSIM yang telah dipasang tidak boleh digunakan semula untuk pesanan baharu.
pt: Este pacote não permite renovação. Quando os dados acabarem ou expirarem, compre um novo pacote; a eSIM instalada não pode ser reutilizada em novos pedidos.
th: แพ็กเกจนี้ไม่รองรับการต่ออายุ เมื่อใช้ข้อมูลหมดหรือหมดอายุ ให้ซื้อแพ็กเกจใหม่; eSIM ที่ติดตั้งแล้วไม่สามารถใช้ซ้ำกับคำสั่งซื้อใหม่ได้
vi: Gói này không hỗ trợ gia hạn. Khi dữ liệu hết hoặc hết hạn, hãy mua gói mới; eSIM đã cài đặt không thể dùng lại cho đơn hàng mới
zh_hans: 当前套餐不支持续费。流量用尽或到期后需要重新购买新的套餐；已安装的 eSIM 不可复用到新的订单。
zh_hant: 當前套餐不支援續費。流量用盡或到期後需要重新購買新的套餐；已安裝的 eSIM 不可重複用於新的訂單。

# 搜索结果
source: Search Results
ar: نتائج البحث
es: Resultados de búsqueda
id: Hasil pencarian
ja: 検索結果
ko: 검색 결과
ms: Keputusan carian
pt: Resultados da pesquisa
th: ผลการค้นหา
vi: Kết quả tìm kiếm
zh_hans: 搜索结果
zh_hant: 搜尋結果

# 名称（排序）
source: Name
ar: الاسم
es: Nombre
id: Nama
ja: 名前（並び替え）
ko: 이름
ms: Nama
pt: Nome
th: ชื่อ
vi: Tên
zh_hans: 名称
zh_hant: 名稱

# 我的订单
source: My Orders
ar: طلباتي
es: Mis pedidos
id: Pesanan saya
ja: マイオーダー
ko: 내 주문
ms: Pesanan saya
pt: Meus pedidos
th: คำสั่งซื้อของฉัน
vi: Đơn hàng của tôi
zh_hans: 我的订单
zh_hant: 我的訂單

# 状态
source: Status
ar: الحالة
es: Estado
id: Negara
ja: ステータス
ko: 상태
ms: Negeri
pt: Estado
th: สถานะ
vi: Trạng thái
zh_hans: 状态
zh_hant: 狀態

# 全部
source: All
ar: الكل
es: Todo
id: Semua
ja: すべて
ko: 전체
ms: Semua
pt: Tudo
th: ทั้งหมด
zh_hans: 全部
zh_hant: 全部

# 已创建
source: Created
ar: تم الإنشاء
es: Creado
id: Dibuat
ja: 作成済み
ko: 생성됨
ms: Dicipta
pt: Criado
th: สร้างแล้ว
vi: Đã tạo
zh_hans: 已创建
zh_hant: 已建立

# 已支付
source: Paid
ar: مدفوع
es: Pagado
id: Sudah dibayar
ja: 支払い済み
ko: 결제 완료
ms: Dibayar
pt: Pago
th: ชำระเงินแล้ว
vi: Đã thanh toán
zh_hans: 已支付
zh_hant: 已支付

# 失败
source: Failed
ar: فشل
es: Fallido
id: Gagal
ja: 失敗
ko: 실패
ms: Gagal
pt: Falhou
th: ล้มเหลว
vi: Thất bại
zh_hans: 失败
zh_hant: 失敗

# 刷新订单
source: Refresh Orders
ar: تحديث الطلبات
es: Actualizar pedidos
id: Muat ulang pesanan
ja: 注文を更新
ko: 주문 새로고침
ms: Segar semula pesanan
pt: Atualizar pedidos
th: รีเฟรชคำสั่งซื้อ
vi: Làm mới đơn hàng
zh_hans: 刷新订单
zh_hant: 重新整理訂單

# 重置筛选
source: Reset Filters
ar: إعادة تعيين المرشحات
es: Restablecer filtros
id: Atur ulang filter
ja: フィルターをリセット
ko: 필터 재설정
ms: Set semula penapis
pt: Restabelecer filtros
th: รีเซ็ตตัวกรอง
vi: Đặt lại bộ lọc
zh_hans: 重置筛选
zh_hant: 重設篩選

# 退款申请失败
source: Refund request failed
ar: فشل طلب الاسترداد
es: Solicitud de reembolso fallida
id: Permintaan pengembalian dana gagal
ja: 返金申請に失敗しました
ko: 환불 요청 실패
ms: Permohonan bayaran balik gagal
pt: Falha na solicitação de reembolso
th: คำขอคืนเงินล้มเหลว
vi: Yêu cầu hoàn tiền thất bại
zh_hans: 退款申请失败
zh_hant: 退款申請失敗

# 订单已创建：
source: Order created:
ar: تم إنشاء الطلب:
es: Pedido creado:
id: Pesanan dibuat:
ja: 注文が作成されました：
ko: 주문이 생성되었습니다:
ms: Pesanan telah dibuat:
pt: Pedido criado:
th: สร้างคำสั่งซื้อแล้ว:
vi: Đơn hàng đã được tạo:
zh_hans: 订单已创建：
zh_hant: 訂單已建立：

# 订单 #%@
source: Order #%@
ar: طلب #%@
es: Pedido #%@
id: Pesanan #%@
ja: 注文 #%@
ko: 주문 #%@
ms: Pesanan #%@
pt: Pedido #%@
th: คำสั่งซื้อ #%@
vi: Đơn hàng #%@
zh_hans: 订单 #%@
zh_hant: 訂單 #%@

# 创建日期：%@
source: Created: %@
ar: تاريخ الإنشاء: %@
es: Creado: %@
id: Dibuat: %@
ja: 作成日時：%@
ko: 생성일: %@
ms: Dicipta: %@
pt: Criado: %@
th: วันที่สร้าง: %@
vi: Tạo lúc: %@
zh_hans: 创建日期：%@
zh_hant: 建立日期：%@

# 待支付
source: Pending
ar: في انتظار الدفع
es: Pendiente
id: Menunggu pembayaran
ja: 支払い待ち
ko: 결제 대기
ms: Menunggu pembayaran
pt: Pendente
th: รอชำระเงิน
vi: Chờ thanh toán
zh_hans: 待支付
zh_hant: 待支付

# 订单归属修复失败：%@
source: Ownership fix failed: %@
ar: فشل الإصلاح: %@
es: Fallo en la reparación de titularidad: %@
id: Perbaikan gagal: %@
ja: 所有権の修復に失敗：%@
ko: 수정 실패: %@
ms: Pembetulan gagal: %@
pt: Falha na correção: %@
th: แก้ไขล้มเหลว: %@
vi: Sửa thất bại: %@
zh_hans: 订单归属修复失败：%@
zh_hant: 訂單歸屬修復失敗：%@

# 请求失败：%@，请重试
source: Request failed: %@, please try again
ar: فشل الطلب: %@، يرجى المحاولة مجددًا
es: La solicitud falló: %@, inténtalo de nuevo
id: Permintaan gagal: %@, coba lagi
ja: リクエストに失敗：%@、もう一度お試しください
ko: 요청 실패: %@, 다시 시도하세요
ms: Permintaan gagal: %@, sila cuba lagi
pt: Falha na requisição: %@, tente novamente
th: คำขอล้มเหลว: %@, โปรดลองอีกครั้ง
vi: Yêu cầu thất bại: %@, vui lòng thử lại
zh_hans: 请求失败：%@，请重试
zh_hant: 請求失敗：%@，請重試

# 支付失败：网络异常，请检查网络后重试（%@）
source: Payment failed: network error, check connection and retry (%@)
ar: فشل الدفع: خطأ في الشبكة، تحقق من الاتصال ثم أعد المحاولة (%@)
es: Pago fallido: error de red, verifica la conexión e inténtalo de nuevo (%@)
id: Pembayaran gagal: jaringan error, periksa koneksi lalu coba lagi (%@)
ja: 支払い失敗：ネットワーク異常。接続を確認して再試行してください（%@）
ko: 결제 실패: 네트워크 오류. 연결 확인 후 재시도 (%@)
ms: Bayaran gagal: ralat rangkaian, semak sambungan dan cuba lagi (%@)
pt: Falha no pagamento: erro de rede, verifique a ligação e tente novamente (%@)
th: ชำระเงินล้มเหลว: เครือข่ายผิดปกติ ตรวจสอบการเชื่อมต่อแล้วลองอีกครั้ง (%@)
vi: Thanh toán thất bại: lỗi mạng, kiểm tra kết nối và thử lại (%@)
zh_hans: 支付失败：网络异常，请检查网络后重试（%@）
zh_hant: 支付失敗：網路異常，請檢查後重試（%@）

# 支付失败：余额不足或发卡行拒绝（%@）
source: Payment failed: insufficient funds or issuer declined (%@)
ar: فشل الدفع: رصيد غير كافٍ أو رفض من الجهة المصدرة (%@)
es: Pago fallido: saldo insuficiente o rechazo del emisor (%@)
id: Pembayaran gagal: saldo kurang atau ditolak pihak penerbit (%@)
ja: 支払い失敗：残高不足または発行元により拒否されました（%@）
ko: 결제 실패: 잔액 부족 또는 발급사 거절 (%@)
ms: Bayaran gagal: baki tidak mencukupi atau ditolak penerbit (%@)
pt: Falha no pagamento: saldo insuficiente ou recusado pelo emissor (%@)
th: ชำระเงินล้มเหลว: ยอดเงินไม่พอหรือถูกธนาคารปฏิเสธ (%@)
vi: Thanh toán thất bại: số dư không đủ hoặc bị từ chối (%@)
zh_hans: 支付失败：余额不足或发卡行拒绝（%@）
zh_hant: 支付失敗：餘額不足或發卡行拒絕（%@）

# 支付失败：支付组件异常，请重试或更新（%@）
source: Payment failed: payment component error, try again or update (%@)
ar: فشل الدفع: خلل بمكوّن الدفع، أعد المحاولة أو حدّث (%@)
es: Pago fallido: componente de pago con error, intenta de nuevo o actualiza (%@)
id: Pembayaran gagal: komponen pembayaran bermasalah, coba lagi atau perbarui (%@)
ja: 支払い失敗：支払いコンポーネントの異常。再試行するか更新してください（%@）
ko: 결제 실패: 결제 컴포넌트 오류. 재시도 또는 업데이트 (%@)
ms: Bayaran gagal: komponen pembayaran bermasalah, cuba lagi atau kemas kini (%@)
pt: Falha no pagamento: problema no componente de pagamento, tente novamente ou atualize (%@)
th: ชำระเงินล้มเหลว: ส่วนประกอบการชำระเงินผิดปกติ โปรดลองอีกครั้งหรืออัปเดต (%@)
vi: Thanh toán thất bại: lỗi thành phần thanh toán, thử lại hoặc cập nhật (%@)
zh_hans: 支付失败：支付组件异常，请重试或更新（%@）
zh_hant: 支付失敗：支付元件異常，請重試或更新（%@）

# 支付失败：服务暂时不可用，请稍后重试（%@）
source: Payment failed: service unavailable, please try later (%@)
ar: فشل الدفع: الخدمة غير متاحة مؤقتًا، حاول لاحقًا (%@)
es: Pago fallido: servicio temporalmente no disponible, inténtalo más tarde (%@)
id: Pembayaran gagal: layanan tidak tersedia sementara, coba lagi nanti (%@)
ja: 支払い失敗：サービスは一時的に利用できません。後で再試行してください（%@）
ko: 결제 실패: 서비스 불가. 잠시 후 다시 시도 (%@)
ms: Bayaran gagal: perkhidmatan tidak tersedia buat sementara, cuba lagi kemudian (%@)
pt: Falha no pagamento: serviço temporariamente indisponível, tente mais tarde (%@)
th: ชำระเงินล้มเหลว: บริการไม่พร้อมใช้งานชั่วคราว โปรดลองภายหลัง (%@)
vi: Thanh toán thất bại: dịch vụ tạm thời không khả dụng, thử lại sau (%@)
zh_hans: 支付失败：服务暂时不可用，请稍后重试（%@）
zh_hant: 支付失敗：服務暫不可用，請稍後重試（%@）

# 支付失败：%@
source: Payment failed: %@
ar: فشل الدفع: %@
es: Pago fallido: %@
id: Pembayaran gagal: %@
ja: 支払い失敗：%@
ko: 결제 실패: %@
ms: Bayaran gagal: %@
pt: Falha no pagamento: %@
th: ชำระเงินล้มเหลว: %@
vi: Thanh toán thất bại: %@
zh_hans: 支付失败：%@
zh_hant: 支付失敗：%@

# 重置失败，请检查令牌与密码
source: Reset failed. Please check the token and password.
ar: فشل إعادة التعيين. يرجى التحقق من الرمز وكلمة المرور
es: Restablecimiento fallido. Verifica el token y la contraseña
id: Setel ulang gagal. Harap periksa token dan kata sandi.
ja: リセットに失敗。トークンとパスワードを確認してください。
ko: 재설정에 실패했습니다. 토큰과 비밀번호를 확인하세요.
ms: Set semula gagal. Sila semak token dan kata laluan.
pt: Falha na reposição. Verifique o token e a palavra‑passe.
th: การรีเซ็ตล้มเหลว โปรดตรวจสอบโทเค็นและรหัสผ่าน
vi: Đặt lại thất bại. Vui lòng kiểm tra mã và mật khẩu
zh_hans: 重置失败，请检查令牌与密码
zh_hant: 重置失敗，請檢查令牌與密碼

# 发送失败，请稍后重试
source: Sending failed. Please try again later
ar: فشل الإرسال. يرجى المحاولة لاحقًا
es: Error al enviar. Inténtalo más tarde
id: Pengiriman gagal. Silakan coba lagi nanti
ja: 送信に失敗しました。後でもう一度お試しください。
ko: 전송 실패. 나중에 다시 시도하세요.
ms: Penghantaran gagal. Sila cuba lagi kemudian
pt: Falha no envio. Tente novamente mais tarde
th: ส่งไม่สำเร็จ โปรดลองอีกครั้งในภายหลัง
vi: Gửi thất bại. Vui lòng thử lại sau
zh_hans: 发送失败，请稍后重试
zh_hant: 傳送失敗，請稍後重試

# 上游分配失败：%@
source: Upstream assignment failed: %@
ar: فشل التخصيص من المصدر: %@
es: Asignación upstream fallida: %@
id: Penugasan upstream gagal: %@
ja: 上流割り当てに失敗：%@
ko: 상위 할당 실패: %@
ms: Peruntukan upstream gagal: %@
pt: Falha na atribuição upstream: %@
th: การมอบหมายฝั่งต้นทางล้มเหลว: %@
vi: Phân bổ upstream thất bại: %@
zh_hans: 上游分配失败：%@
zh_hant: 上游分配失敗：%@

# 支付成功，已刷新订单与用量
source: Payment succeeded; refreshed orders and usage
ar: تم الدفع بنجاح؛ تم تحديث الطلبات والاستخدام
es: Pago exitoso; pedidos y uso actualizados
id: Pembayaran berhasil; pesanan dan penggunaan telah diperbarui
ja: 支払いに成功しました。注文と使用量を更新しました
ko: 결제 성공; 주문과 사용량을 새로고침했습니다
ms: Pembayaran berjaya; pesanan dan penggunaan telah dikemas kini
pt: Pagamento bem-sucedido; pedidos e uso atualizados
th: ชำระเงินสำเร็จ; รีเฟรชคำสั่งซื้อและการใช้งานแล้ว
vi: Thanh toán thành công; đã làm mới đơn hàng và mức dùng
zh_hans: 支付成功，已刷新订单与用量
zh_hant: 支付成功，已重新整理訂單與用量

# 支付失败
source: Payment failed
ar: فشل الدفع
es: Pago fallido
id: Pembayaran gagal
ja: 支払いに失敗しました
ko: 결제 실패
ms: Bayaran gagal
pt: Pagamento falhou
th: การชำระเงินล้มเหลว
vi: Thanh toán thất bại
zh_hans: 支付失败
zh_hant: 支付失敗

# 上游分配失败：套餐不存在或不可用
source: Upstream assignment failed: bundle not found or unavailable
ar: فشل التخصيص من المصدر: الباقة غير موجودة أو غير متاحة
es: Asignación upstream fallida: paquete no encontrado o no disponible
id: Penugasan upstream gagal: paket tidak ditemukan atau tidak tersedia
ja: 上流割り当てに失敗：プランが存在しないか利用できません
ko: 상위 할당 실패: 상품이 없거나 사용할 수 없습니다
ms: Peruntukan upstream gagal: pakej tiada atau tidak tersedia
pt: Falha na atribuição upstream: pacote inexistente ou indisponível
th: การมอบหมายฝั่งต้นทางล้มเหลว: ไม่พบแพ็กเกจหรือไม่พร้อมใช้งาน
vi: Phân bổ upstream thất bại: gói không tồn tại hoặc không khả dụng
zh_hans: 上游分配失败：套餐不存在或不可用
zh_hant: 上游分配失敗：套餐不存在或不可用

# 上游分配失败：交易编号重复，请更换并重试
source: Upstream assignment failed: duplicate order reference, change and retry
ar: فشل التخصيص من المصدر: رقم المرجع مكرر، غيّره وأعد المحاولة
es: Asignación upstream fallida: referencia de pedido duplicada, cambie y reintente
id: Penugasan upstream gagal: referensi pesanan duplikat, ubah dan coba lagi
ja: 上流割り当てに失敗：注文参照が重複しています。変更して再試行してください
ko: 상위 할당 실패: 주문 참조가 중복됨, 변경 후 다시 시도
ms: Peruntukan upstream gagal: rujukan pesanan duplikat, ubah dan cuba lagi
pt: Falha na atribuição upstream: referência de pedido duplicada, altere e tente novamente
th: การมอบหมายฝั่งต้นทางล้มเหลว: หมายเลขอ้างอิงคำสั่งซื้อซ้ำ ให้เปลี่ยนแล้วลองใหม่
vi: Phân bổ upstream thất bại: mã tham chiếu đơn hàng trùng, hãy đổi và thử lại
zh_hans: 上游分配失败：交易编号重复，请更换并重试
zh_hant: 上游分配失敗：交易編號重複，請更換並重試

# 订单详情
source: Order Detail
ar: تفاصيل الطلب
es: Detalle del pedido
id: Detail pesanan
ja: 注文の詳細
ko: 주문 상세
ms: Butiran pesanan
pt: Detalhes do pedido
th: รายละเอียดคำสั่งซื้อ
vi: Chi tiết đơn hàng
zh_hans: 订单详情
zh_hant: 訂單詳情

# 订单信息
source: Order Info
ar: معلومات الطلب
es: Información del pedido
id: Info pesanan
ja: 注文情報
ko: 주문 정보
ms: Maklumat pesanan
pt: Informações do pedido
th: ข้อมูลคำสั่งซื้อ
vi: Thông tin đơn hàng
zh_hans: 订单信息
zh_hant: 訂單信息

# 订单ID
source: Order ID
ar: معرّف الطلب
es: ID del pedido
id: ID pesanan
ja: 注文ID
ko: 주문 ID
ms: ID pesanan
pt: ID do pedido
th: รหัสคำสั่งซื้อ
vi: ID đơn hàng
zh_hans: 订单ID
zh_hant: 訂單ID

# 套餐名称
source: Bundle Name
ar: اسم الباقة
es: Nombre del paquete
id: Nama paket
ja: プラン名
ko: 패키지 이름
ms: Nama pakej
pt: Nome do pacote
th: ชื่อแพ็กเกจ
vi: Tên gói
zh_hans: 套餐名称
zh_hant: 套餐名稱

# 创建时间
source: Created At
ar: تاريخ الإنشاء
es: Fecha de creación
id: Waktu dibuat
ja: 作成日時
ko: 생성 시간
ms: Masa dicipta
pt: Data de criação
th: เวลาที่สร้าง
vi: Thời gian tạo
zh_hans: 创建时间
zh_hant: 建立時間

# 金额
source: Amount
ar: المبلغ
es: Importe
id: Jumlah
ja: 金額
ko: 금액
ms: Jumlah
pt: Valor
th: จำนวนเงิน
vi: Số tiền
zh_hans: 金额
zh_hant: 金額

# 支付方式
source: Payment Method
ar: طريقة الدفع
es: Método de pago
id: Metode pembayaran
ja: 支払い方法
ko: 결제 방법
ms: Kaedah pembayaran
pt: Forma de pagamento
th: วิธีชำระเงิน
vi: Phương thức thanh toán
zh_hans: 支付方式
zh_hant: 支付方式

# 计划状态
source: Plan Status
ar: حالة الخطة
es: Estado del plan
id: Status paket
ja: プランのステータス
ko: 플랜 상태
ms: Status pelan
pt: Status do plano
th: สถานะแผน
vi: Trạng thái gói
zh_hans: 计划状态
zh_hant: 計劃狀態

# 套餐代码
source: Bundle Code
ar: رمز الباقة
es: Código del paquete
id: Kode paket
ja: プランコード
ko: 패키지 코드
ms: Kod pakej
pt: Código do pacote
th: รหัสแพ็กเกจ
vi: Mã gói
zh_hans: 套餐代码
zh_hant: 套餐代碼

# 状态：
source: Status:
ar: الحالة:
es: Estado:
id: Negara:
ja: ステータス：
ko: 상태:
ms: Negeri:
pt: Estado:
th: สถานะ:
vi: Trạng thái:
zh_hans: 状态：
zh_hant: 狀態：

# 总计：
source: Total:
ar: الإجمالي:
ja: 合計：
ko: 합계:
ms: Jumlah:
th: รวม:
vi: Tổng:
zh_hans: 总计：
zh_hant: 總計：

# 支付方式：
source: Payment Method:
ar: طريقة الدفع:
es: Método de pago:
id: Metode pembayaran:
ja: 支払い方法：
ko: 결제 방법:
ms: Kaedah pembayaran:
pt: Forma de pagamento:
th: วิธีชำระเงิน:
vi: Phương thức thanh toán:
zh_hans: 支付方式：
zh_hant: 支付方式：

# 查看订单详情
source: View order details
ar: عرض تفاصيل الطلب
es: Ver detalles del pedido
id: Lihat rincian pesanan
ja: 注文詳細を見る
ko: 주문 상세 보기
ms: Lihat butiran pesanan
pt: Ver detalhes do pedido
th: ดูรายละเอียดคำสั่งซื้อ
vi: Xem chi tiết đơn hàng
zh_hans: 查看订单详情
zh_hant: 查看訂單詳情

# 使用相机扫描订单详情页的 eSIM 激活二维码
source: Scan the eSIM activation QR code from the order details page
ar: امسح رمز QR لتفعيل eSIM من صفحة تفاصيل الطلب
es: Escanear con la cámara el código QR de activación de eSIM desde la página del pedido
id: Pindai QR aktivasi eSIM dari halaman detail pesanan
ja: 注文詳細ページの eSIM アクティベーション用QRコードをスキャンしてください
ko: 주문 상세의 eSIM 활성화 QR 코드 스캔
ms: Imbas kod QR pengaktifan eSIM dari halaman butiran pesanan
pt: Digitalizar o QR de ativação da eSIM na página do pedido
th: สแกน QR โค้ดการเปิดใช้งาน eSIM จากหน้ารายละเอียดคำสั่งซื้อ
vi: Quét mã QR kích hoạt eSIM từ trang chi tiết đơn hàng
zh_hans: 使用相机扫描订单详情页的 eSIM 激活二维码
zh_hant: 使用相機掃描訂單詳情頁的 eSIM 啟用 QR 碼
