Repository: ChaosSpiritVS/eSIM
Catalog: Simigo/Simigo/Resources/Localizable/*.lproj/Localizable.strings
Languages: ar, es, id, ja, ko, ms, pt, th, vi, zh_hans, zh_hant

source: Install before departure or after arrival. If outside coverage, installation succeeds but won't activate until you connect inside coverage. Ensure your device supports eSIM and the network is unlocked. QR code and steps are in My eSIM details.
ar: يمكن التثبيت قبل السفر أو بعد الوصول. إذا كان خارج نطاق التغطية، ستنجح عملية التثبيت ولكن لن يتم التفعيل؛ عند الوصول إلى منطقة التغطية والاتصال بالشبكة المحمولة يمكن البدء بالاستخدام. تأكد من أن الجهاز يدعم eSIM وأن الشبكة غير مقفلة. رمز QR والخطوات موجودة في تفاصيل eSIM الخاصة بي
es: Puedes instalarla antes de salir o al llegar. Si instalas fuera de cobertura, la instalación será exitosa pero no se activará hasta conectarte dentro del área. Asegúrate de que tu dispositivo soporte eSIM y que la red esté desbloqueada. El QR y los pasos están en Mis eSIM.
id: Dapat diinstal sebelum berangkat atau setelah tiba. Jika di luar cakupan, pemasangan berhasil tetapi tidak akan aktif hingga Anda tersambung di dalam cakupan. Pastikan perangkat mendukung eSIM dan jaringan tidak dikunci. Kode QR dan langkah-langkah tersedia di detail eSIM Saya.
ja: 出発前または到着後にインストールできます。カバー範囲外でインストールした場合、インストールは成功してもアクティベーションは行われません。カバー地域に到着してモバイルネットワークに接続すると利用を開始できます。デバイスが eSIM に対応し、ネットワークが解除されていることを確認してください。インストール用QRコードと手順はマイ eSIM の詳細で確認できます。
ko: 출발 전 또는 도착 후 설치할 수 있습니다. 커버리지 외 지역에서 설치하면 설치는 완료되지만 활성화되지 않습니다; 커버리지 지역에 도착하여 모바일 네트워크에 연결하면 사용을 시작할 수 있습니다. 기기가 eSIM을 지원하고 네트워크가 잠금 해제되어 있는지 확인하세요. QR 코드와 단계는 내 eSIM 상세에서 확인할 수 있습니다
ms: Anda boleh memasang sebelum berlepas atau selepas tiba. Jika pemasangan dilakukan di luar kawasan liputan, pemasangan akan berjaya tetapi tidak akan diaktifkan; apabila berada dalam kawasan liputan dan disambungkan ke rangkaian mudah alih, penggunaan akan bermula. Pastikan peranti anda menyokong eSIM dan rangkaian tidak dikunci. Kod QR dan langkah pemasangan boleh dilihat dalam butiran eSIM Saya.
th: สามารถติดตั้งก่อนออกเดินทางหรือหลังถึงปลายทาง หากอยู่นอกพื้นที่ครอบคลุม การติดตั้งจะสำเร็จแต่จะไม่เปิดใช้งาน; เมื่ออยู่ในพื้นที่ครอบคลุมและเชื่อมต่อเครือข่ายมือถือจึงเริ่มใช้งานได้ ตรวจสอบว่าอุปกรณ์รองรับ eSIM และเครือข่ายปลดล็อกแล้ว QR และขั้นตอนอยู่ในรายละเอียด eSIM ของฉัน
vi: Có thể cài đặt trước khi khởi hành hoặc sau khi đến nơi. Nếu cài đặt ngoài vùng phủ sóng, việc cài đặt sẽ thành công nhưng chưa được kích hoạt; khi vào vùng phủ sóng và kết nối mạng di động bạn có thể bắt đầu sử dụng. Hãy bảo đảm thiết bị hỗ trợ eSIM và mạng đã mở khóa. Mã QR và các bước ở phần chi tiết eSIM của tôi
zh_hans: 可以在出发前或到达后安装。若不在覆盖范围内安装，安装成功但不会激活；到达覆盖区域并连接移动网络后即可开始使用。请确保设备支持 eSIM 且网络已解锁，安装二维码与步骤可在我的eSIM详情中查看。
zh_hant: 可以在出發前或到達後安裝。若不在覆蓋範圍內安裝，安裝成功但不會啟用；到達覆蓋區域並連接行動網路後即可開始使用。請確保設備支援 eSIM 且網路已解鎖，安裝 QR 碼與步驟可在我的 eSIM 詳情中查看。

# 到期时间
source: Expiry Date
ar: وقت الانتهاء
es: Fecha de vencimiento
id: Kedaluwarsa
ja: 有効期限
ko: 만료 시간
ms: Tamat tempoh
pt: Expiração
th: วันหมดอายุ
vi: Hết hạn
zh_hans: 到期时间
zh_hant: 到期時間

# 最后更新
source: Last updated
ar: آخر تحديث
es: Última actualización
id: Terakhir diperbarui
ja: 最終更新
ko: 마지막 업데이트
ms: Kemas kini terakhir
pt: Última atualização
th: อัปเดตล่าสุด
vi: Cập nhật cuối
zh_hans: 最后更新
zh_hant: 最後更新

# 刷新用量
source: Refresh usage
ar: تحديث الاستخدام
es: Actualizar uso
id: Muat ulang penggunaan
ja: 使用量を更新
ko: 사용량 새로고침
ms: Segar semula penggunaan
pt: Atualizar utilização
th: รีเฟรชการใช้งาน
vi: Làm mới mức dùng
zh_hans: 刷新用量
zh_hant: 重新整理用量

# 暂未获取到用量信息
source: Usage information not yet available
ar: معلومات الاستخدام غير متاحة بعد
es: Información de uso no disponible aún
id: Info penggunaan belum tersedia
ja: 使用量情報をまだ取得できません
ko: 사용량 정보를 아직 가져오지 못했습니다
ms: Maklumat penggunaan belum tersedia
pt: Informações de utilização ainda indisponíveis
th: ยังไม่ได้รับข้อมูลการใช้งาน
vi: Chưa có thông tin mức dùng
zh_hans: 暂未获取到用量信息
zh_hant: 尚未取得用量資訊

# 不限量
source: Unlimited
ar: غير محدود
es: Ilimitado
id: Tak terbatas
ja: 無制限
ko: 무제한
ms: Tanpa had
pt: Ilimitado
th: ไม่จำกัด
vi: Không giới hạn
zh_hans: 不限量
zh_hant: 不限量

# 账号信息
source: Account Info
ar: معلومات الحساب
es: Información de la cuenta
id: Info akun
ja: アカウント情報
ko: 계정 정보
ms: Maklumat akaun
pt: Informações da conta
th: ข้อมูลบัญชี
vi: Thông tin tài khoản
zh_hans: 账号信息
zh_hant: 帳號資訊

# 登录
source: Login
ar: تسجيل الدخول
es: Iniciar sesión
id: Masuk
ja: ログイン
ko: 로그인
ms: Log masuk
pt: Iniciar sessão
th: เข้าสู่ระบบ
vi: Đăng nhập
zh_hans: 登录
zh_hant: 登入

# 注册
source: Register
ar: إنشاء حساب
es: Registro
id: Daftar
ja: 新規登録
ko: 회원가입
ms: Daftar
pt: Registar
th: ลงทะเบียน
vi: Đăng ký
zh_hans: 注册
zh_hant: 註冊

# 登录 / 注册
source: Login / Register
ar: تسجيل الدخول / التسجيل
es: Iniciar sesión / Registrarse
id: Masuk / Daftar
ja: ログイン / 新規登録
ko: 로그인 / 가입
ms: Log masuk / Daftar
pt: Entrar / Registrar
th: เข้าสู่ระบบ / ลงทะเบียน
vi: Đăng nhập / Đăng ký
zh_hans: 登录 / 注册
zh_hant: 登入 / 註冊

# 电子邮件
source: Email
ar: البريد الإلكتروني
es: Correo electrónico
ja: メールアドレス
ko: 이메일
ms: E-mel
th: อีเมล
zh_hans: 电子邮件
zh_hant: 電子郵件

# 密码
source: Password
ar: كلمة المرور
es: Contraseña
id: Kata sandi
ja: パスワード
ko: 비밀번호
ms: Kata laluan
pt: Senha
th: รหัสผ่าน
vi: Mật khẩu
zh_hans: 密码
zh_hant: 密碼

# 您可通过设置控制数据与删除账户请求。
source: You can control data and request account deletion in Settings.
ar: يمكنك إدارة البيانات وتقديم طلب حذف الحساب من الإعدادات
id: Anda dapat mengontrol data dan mengajukan penghapusan akun di Pengaturan.
ja: 設定でデータの管理やアカウント削除の申請ができます。
ko: 설정에서 데이터 관리 및 계정 삭제 요청을 할 수 있습니다
ms: Anda boleh mengawal data dan membuat permintaan pemadaman akaun dalam Tetapan.
pt: Pode gerir dados e solicitar exclusão da conta nas Definições.
th: คุณสามารถจัดการข้อมูลและส่งคำขอลบบัญชีได้ใน การตั้งค่า
vi: Bạn có thể quản lý dữ liệu và yêu cầu xóa tài khoản trong Cài đặt
zh_hans: 您可通过设置控制数据与删除账户请求。
zh_hant: 您可透過設定控制資料並提出刪除帳戶請求。

# 忘记密码
source: Forgot Password
ar: نسيت كلمة المرور
es: ¿Olvidaste la contraseña?
id: Lupa kata sandi
ja: パスワードをお忘れですか
ko: 비밀번호를 잊으셨나요
ms: Lupa kata laluan
pt: Esqueceu a senha
th: ลืมรหัสผ่าน
vi: Quên mật khẩu
zh_hans: 忘记密码
zh_hant: 忘記密碼

# 发送重置邮件
source: Send Reset Email
ar: إرسال بريد إعادة التعيين
es: Enviar correo de restablecimiento
id: Kirim email pengaturan ulang
ja: リセットメールを送信
ko: 재설정 이메일 보내기
ms: Hantar emel set semula
pt: Enviar e-mail de redefinição
th: ส่งอีเมลรีเซ็ต
vi: Gửi email đặt lại
zh_hans: 发送重置邮件
zh_hant: 發送重置郵件

# 请输入注册邮箱以接收重置链接
source: Enter your account email to receive a reset link.
ar: أدخل بريد الحساب لاستلام رابط إعادة التعيين
es: Introduce tu correo de cuenta para recibir el enlace de restablecimiento.
id: Masukkan email akun untuk menerima tautan pengaturan ulang.
ja: 登録メールアドレスを入力してリセットリンクを受け取ってください。
ko: 계정 이메일을 입력하여 재설정 링크를 받으세요.
ms: Masukkan emel akaun untuk menerima pautan set semula.
pt: Digite o e-mail da conta para receber o link de redefinição.
th: กรอกอีเมลบัญชีเพื่อรับลิงก์รีเซ็ต
vi: Nhập email tài khoản để nhận liên kết đặt lại.
zh_hans: 请输入注册邮箱以接收重置链接
zh_hant: 請輸入註冊郵箱以接收重置連結

# 显示密码
source: Show Password
ar: إظهار كلمة المرور
es: Mostrar contraseña
id: Tampilkan kata sandi
ja: パスワードを表示
ko: 비밀번호 표시
ms: Tunjukkan kata laluan
pt: Mostrar senha
th: แสดงรหัสผ่าน
vi: Hiển thị mật khẩu
zh_hans: 显示密码
zh_hant: 顯示密碼

# 隐藏密码
source: Hide Password
ar: إخفاء كلمة المرور
es: Ocultar contraseña
id: Sembunyikan kata sandi
ja: パスワードを非表示
ko: 비밀번호 숨기기
ms: Sembunyikan kata laluan
pt: Ocultar senha
th: ซ่อนรหัสผ่าน
vi: Ẩn mật khẩu
zh_hans: 隐藏密码
zh_hant: 隱藏密碼

# 密码设置提示
source: Password Requirements
ar: متطلبات كلمة المرور
es: Requisitos de la contraseña
id: Persyaratan kata sandi
ja: パスワードの要件
ko: 비밀번호 요구 사항
ms: Keperluan kata laluan
pt: Requisitos de senha
th: ข้อกำหนดรหัสผ่าน
vi: Yêu cầu mật khẩu
zh_hans: 密码设置提示
zh_hant: 密碼設定提示

# 最少 8 个字符
source: At least 8 characters
ar: 8 أحرف على الأقل
es: Al menos 8 caracteres
id: Setidaknya 8 karakter
ja: 8文字以上
ko: 8자 이상
ms: Sekurang-kurangnya 8 aksara
pt: Pelo menos 8 caracteres
th: อย่างน้อย 8 อักขระ
vi: Ít nhất 8 ký tự
zh_hans: 最少 8 个字符
zh_hant: 最少 8 個字符

# 注册账户即表示我同意条款与条件与隐私政策
source: By creating an account I agree to the Terms & Privacy Policy.
ar: بإنشاء حساب فإنني أوافق على الشروط وسياسة الخصوصية
id: Dengan membuat akun, saya menyetujui Ketentuan & Kebijakan Privasi.
ja: アカウントを作成すると、利用規約およびプライバシーポリシーに同意したことになります。
ko: 계정을 만들면 약관 및 개인정보처리방침에 동의한 것으로 간주합니다
ms: Dengan mendaftar akaun, saya bersetuju dengan Terma & Syarat dan Dasar Privasi.
pt: Ao criar uma conta, concordo com os Termos e a Política de Privacidade.
th: การสร้างบัญชีถือว่า ฉันยอมรับข้อกำหนดและนโยบายความเป็นส่วนตัว
vi: Tạo tài khoản nghĩa là tôi đồng ý với Điều khoản & Chính sách quyền riêng tư
zh_hans: 注册账户即表示我同意条款与条件与隐私政策
zh_hant: 註冊帳戶即表示我同意條款與條件與隱私政策

# 未登录
source: Not logged in
ar: غير مسجل الدخول
es: No has iniciado sesión
id: Belum masuk
ja: 未ログイン
ko: 로그인되지 않음
ms: Belum log masuk
pt: Não autenticado
th: ยังไม่ได้เข้าสู่ระบบ
vi: Chưa đăng nhập
zh_hans: 未登录
zh_hant: 未登入

# 名称
source: Name
ar: الاسم الأول
es: Nombre
id: Nama
ja: 名前
ko: 이름
ms: Nama pertama
pt: Nome
th: ชื่อ
vi: Tên
zh_hans: 名称
zh_hant: 名稱

# 确认退出登录？
source: Confirm logout?
ar: تأكيد تسجيل الخروج؟
es: ¿Confirmar cierre de sesión?
id: Konfirmasi keluar?
ja: ログアウトしますか？
ko: 로그아웃을 확인하시겠습니까?
ms: Sahkan log keluar?
pt: Confirmar sair?
th: ยืนยันออกจากระบบหรือไม่?
vi: Xác nhận đăng xuất?
zh_hans: 确认退出登录？
zh_hant: 確認退出登入？

# 使用模拟 Apple 登录（开发）
source: Use simulated Apple Sign-In (dev)
ar: استخدام تسجيل دخول Apple المُحاكى (للتطوير)
es: Usar inicio de sesión de Apple simulado (dev)
id: Gunakan Apple Sign-In simulasi (dev)
ja: Apple サインインのシミュレーションを使用（開発用）
ko: 모의 Apple 로그인 사용(개발)
ms: Guna Apple Sign-In simulasi (dev)
pt: Usar início de sessão do Apple simulado (dev)
th: ใช้การลงชื่อเข้าใช้ Apple จำลอง (สำหรับพัฒนา)
vi: Dùng đăng nhập Apple giả lập (dev)
zh_hans: 使用模拟 Apple 登录（开发）
zh_hant: 使用模擬 Apple 登入（開發）

# 姓氏（可选）
source: Last name (optional)
ar: الكنية (اختياري)
es: Apellido (opcional)
id: Nama belakang (opsional)
ja: 姓（任意）
ko: 성(선택)
ms: Nama keluarga (pilihan)
pt: Sobrenome (opcional)
th: นามสกุล (ไม่บังคับ)
vi: Họ (tùy chọn)
zh_hans: 姓氏（可选）
zh_hant: 姓氏（可選）

# 注册账户即表示我同意
source: By creating an account I agree to
ar: بإنشاء حساب، فأنا أوافق على
es: Al crear una cuenta, acepto
id: Dengan membuat akun, saya setuju
ja: アカウントを作成すると、次に同意します
ko: 계정을 생성하면 다음에 동의합니다
ms: Dengan membuat akaun, saya bersetuju
pt: Ao criar uma conta, concordo
th: การสร้างบัญชีแสดงว่าฉันยอมรับ
vi: Tạo tài khoản nghĩa là tôi đồng ý
zh_hans: 注册账户即表示我同意
zh_hant: 註冊帳戶即表示我同意

# 请输入有效的电子邮件地址。
source: Please enter a valid email address.
ar: يرجى إدخال عنوان بريد إلكتروني صالح.
es: Introduce una dirección de correo válida.
id: Masukkan alamat email yang valid.
ja: 有効なメールアドレスを入力してください。
ko: 유효한 이메일 주소를 입력하세요.
ms: Masukkan alamat e-mel yang sah.
pt: Insira um e-mail válido.
th: กรุณาใส่อีเมลที่ถูกต้อง
vi: Vui lòng nhập địa chỉ email hợp lệ.
zh_hans: 请输入有效的电子邮件地址。
zh_hant: 請輸入有效的電子郵件地址。

# 请输入至少包含 8 个字符的密码。
source: Enter a password of at least 8 characters.
ar: أدخل كلمة مرور لا تقل عن 8 أحرف.
es: Introduce una contraseña de al menos 8 caracteres.
id: Masukkan kata sandi minimal 8 karakter.
ja: 8文字以上のパスワードを入力してください。
ko: 8자 이상 비밀번호를 입력하세요.
ms: Masukkan kata laluan sekurang-kurangnya 8 aksara.
pt: Insira uma senha com pelo menos 8 caracteres.
th: กรุณาใส่รหัสผ่านอย่างน้อย 8 อักขระ
vi: Nhập mật khẩu tối thiểu 8 ký tự.
zh_hans: 请输入至少包含 8 个字符的密码。
zh_hant: 請輸入至少包含 8 個字元的密碼。

# 请填写至少 2 个字符的名字。
source: Please enter at least 2 characters for the first name.
ar: يرجى إدخال اسم لا يقل عن حرفين.
es: Introduce al menos 2 caracteres para el nombre.
id: Masukkan nama depan minimal 2 karakter.
ja: 名前は2文字以上で入力してください。
ko: 이름을 최소 2자 이상 입력하세요.
ms: Masukkan nama sekurang-kurangnya 2 aksara.
pt: Insira pelo menos 2 caracteres para o nome.
th: กรุณากรอกชื่ออย่างน้อย 2 อักขระ
vi: Nhập tên tối thiểu 2 ký tự.
zh_hans: 请填写至少 2 个字符的名字。
zh_hant: 請填寫至少 2 個字元的名字。

# 请输入电子邮件与密码
source: Enter email and password
ar: أدخل البريد الإلكتروني وكلمة المرور
es: Introduce el correo y la contraseña
id: Masukkan email dan kata sandi
ja: メールアドレスとパスワードを入力してください
ko: 이메일과 비밀번호를 입력하세요
ms: Masukkan e-mel dan kata laluan
pt: Insira e-mail e senha
th: กรุณากรอกอีเมลและรหัสผ่าน
vi: Nhập email và mật khẩu
zh_hans: 请输入电子邮件与密码
zh_hant: 請輸入電子郵件與密碼

# 您的验证码已发送至 %@ — 请输入 4 位验证码完成验证。
source: Your verification code was sent to %@ — enter the 4-digit code to complete verification.
ar: تم إرسال رمز التحقق إلى %@ — أدخل الرمز المكون من 4 أرقام لإتمام التحقق.
es: Se envió el código de verificación a %@ — introduce el código de 4 dígitos para completar la verificación.
id: Kode verifikasi dikirim ke %@ — masukkan kode 4 digit untuk menyelesaikan verifikasi.
ja: 確認コードを%@に送信しました — 4桁のコードを入力して認証を完了してください。
ko: 확인 코드를 %@로 보냈습니다 — 인증을 완료하려면 4자리 코드를 입력하세요.
ms: Kod pengesahan telah dihantar ke %@ — masukkan kod 4 digit untuk melengkapkan pengesahan.
pt: Seu código de verificação foi enviado para %@ — insira o código de 4 dígitos para concluir a verificação.
th: รหัสยืนยันถูกส่งไปยัง %@ — กรุณากรอกรหัส 4 หลักเพื่อยืนยัน
vi: Mã xác minh đã được gửi tới %@ — nhập mã 4 chữ số để hoàn tất xác minh.
zh_hans: 您的验证码已发送至 %@ — 请输入 4 位验证码完成验证。
zh_hant: 驗證碼已傳送至 %@ — 請輸入 4 位數完成驗證。

# 验证码
source: Verification Code
ar: رمز التحقق
es: Código de verificación
id: Kode verifikasi
ja: 認証コード
ko: 인증 코드
ms: Kod pengesahan
pt: Código de verificação
th: รหัสยืนยัน
vi: Mã xác minh
zh_hans: 验证码
zh_hant: 驗證碼

# 重新发送验证码
source: Resend Code
ar: إعادة إرسال الرمز
es: Reenviar código
id: Kirim ulang kode
ja: コードを再送
ko: 코드 다시 보내기
ms: Hantar kod semula
pt: Reenviar código
th: ส่งรหัสอีกครั้ง
vi: Gửi lại mã
zh_hans: 重新发送验证码
zh_hant: 重新傳送驗證碼

# 输入代码
source: Submit Code
ar: إدخال الرمز
es: Introducir código
id: Masukkan kode
ja: コードを送信
ko: 코드 입력
ms: Masukkan kod
pt: Inserir código
th: กรอกรหัส
vi: Nhập mã
zh_hans: 输入代码
zh_hant: 輸入代碼

# 请输入邮件中的重置令牌以及新的密码
source: Enter the reset token from your email and a new password.
ar: أدخل رمز إعادة التعيين من البريد الإلكتروني وكلمة مرور جديدة
es: Introduce el token de restablecimiento de tu correo y una nueva contraseña.
id: Masukkan token pengaturan ulang dari email dan kata sandi baru.
ja: メールに記載のリセットトークンと新しいパスワードを入力してください。
ko: 이메일의 재설정 토큰과 새 비밀번호를 입력하세요.
ms: Masukkan token set semula dari emel dan kata laluan baharu.
pt: Introduza o token de redefinição do seu e‑mail e uma nova senha.
th: ป้อนโทเค็นรีเซ็ตจากอีเมลและรหัสผ่านใหม่
vi: Nhập mã đặt lại từ email và mật khẩu mới
zh_hans: 请输入邮件中的重置令牌以及新的密码
zh_hant: 請輸入郵件中的重置令牌以及新的密碼

# 重置令牌
source: Reset Token
ar: رمز إعادة التعيين
es: Token de restablecimiento
id: Token pengaturan ulang
ko: 재설정 토큰
ms: Token set semula
pt: Token de redefinição
th: โทเค็นรีเซ็ต
vi: Mã đặt lại
zh_hans: 重置令牌
zh_hant: 重置令牌

# 新密码
source: New Password
ar: كلمة مرور جديدة
id: Kata sandi baru
ja: 新しいパスワード
ko: 새 비밀번호
th: รหัสผ่านใหม่
vi: Mật khẩu mới
zh_hans: 新密码
zh_hant: 新密碼

# 重置密码
source: Reset Password
ar: إعادة تعيين كلمة المرور
es: Restablecer contraseña
id: Atur ulang kata sandi
ja: パスワードをリセットする
ko: 비밀번호 재설정
ms: Set semula kata laluan
pt: Redefinir senha
th: รีเซ็ตรหัสผ่าน
vi: Đặt lại mật khẩu
zh_hans: 重置密码
zh_hant: 重置密碼

# 密码已重置，请使用新密码登录
source: Password reset successful. Please sign in with your new password.
ar: تمت إعادة تعيين كلمة المرور. يرجى تسجيل الدخول بكلمة المرور الجديدة
es: Contraseña restablecida. Inicia sesión con tu nueva contraseña.
id: Kata sandi berhasil diatur ulang. Silakan masuk dengan kata sandi baru.
ja: パスワードをリセットしました。新しいパスワードでログインしてください。
ko: 비밀번호가 재설정되었습니다. 새 비밀번호로 로그인하세요.
ms: Kata laluan berjaya diset semula. Sila log masuk dengan kata laluan baharu.
pt: Senha redefinida. Inicie sessão com a nova senha.
th: รีเซ็ตรหัสผ่านสำเร็จ โปรดเข้าสู่ระบบด้วยรหัสผ่านใหม่
vi: Đã đặt lại mật khẩu. Vui lòng đăng nhập bằng mật khẩu mới
zh_hans: 密码已重置，请使用新密码登录
zh_hant: 密碼已重置，請使用新密碼登入

# 我已有重置令牌，去设置新密码
source: I already have a reset token — set a new password
ar: لدي رمز إعادة التعيين — اضبط كلمة مرور جديدة
es: Ya tengo el token de restablecimiento — establecer una nueva contraseña
id: Saya sudah punya token pengaturan ulang — atur kata sandi baru
ja: リセットトークンをお持ちの方 — 新しいパスワードを設定
ko: 재설정 토큰이 있습니다 — 새 비밀번호 설정
ms: Saya sudah ada token set semula — tetapkan kata laluan baharu
pt: Já tenho o token de redefinição — definir nova senha
th: มีโทเค็นรีเซ็ตอยู่แล้ว — ตั้งรหัสผ่านใหม่
vi: Tôi đã có mã đặt lại — thiết lập mật khẩu mới
zh_hans: 我已有重置令牌，去设置新密码
zh_hant: 我已有重置令牌，去設定新密碼

# 登录方式：邮箱登录
source: Sign-in method: Email
ar: طريقة تسجيل الدخول: البريد الإلكتروني
es: Método de inicio de sesión: correo electrónico
id: Metode masuk: Email
ja: ログイン方法：メール
ko: 로그인 방식: 이메일
ms: Kaedah log masuk: E-mel
pt: Método de início de sessão: e-mail
th: วิธีลงชื่อเข้าใช้: อีเมล
vi: Phương thức đăng nhập: Email
zh_hans: 登录方式：邮箱登录
zh_hant: 登入方式：電子郵件

# 登录方式：Apple 登录（已设置密码）
source: Sign-in method: Apple Sign-In (password set)
ar: طريقة تسجيل الدخول: Apple (تم تعيين كلمة المرور)
es: Método de inicio de sesión: Apple (contraseña establecida)
id: Metode masuk: Apple (kata sandi sudah diatur)
ja: ログイン方法：Apple サインイン（パスワード設定済み）
ko: 로그인 방식: Apple 로그인(비밀번호 설정됨)
ms: Kaedah log masuk: Apple (kata laluan ditetapkan)
pt: Método de início de sessão: Apple (senha definida)
th: วิธีลงชื่อเข้าใช้: Apple (ตั้งรหัสผ่านแล้ว)
vi: Phương thức đăng nhập: Apple (đã đặt mật khẩu)
zh_hans: 登录方式：Apple 登录（已设置密码）
zh_hant: 登入方式：Apple 登入（已設定密碼）

# 登录方式：Apple 登录（未设置密码）
source: Sign-in method: Apple Sign-In (no password set)
ar: طريقة تسجيل الدخول: Apple (لم يتم تعيين كلمة المرور)
es: Método de inicio de sesión: Apple (sin contraseña)
id: Metode masuk: Apple (tanpa kata sandi)
ja: ログイン方法：Apple サインイン（パスワード未設定）
ko: 로그인 방식: Apple 로그인(비밀번호 미설정)
ms: Kaedah log masuk: Apple (tiada kata laluan)
pt: Método de início de sessão: Apple (sem senha)
th: วิธีลงชื่อเข้าใช้: Apple (ยังไม่ตั้งรหัสผ่าน)
vi: Phương thức đăng nhập: Apple (chưa đặt mật khẩu)
zh_hans: 登录方式：Apple 登录（未设置密码）
zh_hant: 登入方式：Apple 登入（未設定密碼）

# 请输入名称
source: Enter your first name
ar: أدخل الاسم الأول
es: Introduce el nombre
id: Masukkan nama depan
ja: 名前を入力してください
ko: 이름을 입력하세요
ms: Masukkan nama pertama
pt: Insira o primeiro nome
th: กรุณากรอกชื่อ
vi: Nhập tên
zh_hans: 请输入名称
zh_hant: 請輸入名字

# 姓氏
source: Last Name
ar: الكنية
es: Apellido
id: Nama belakang
ja: 姓
ko: 성
ms: Nama keluarga
pt: Sobrenome
th: นามสกุล
vi: Họ
zh_hans: 姓氏
zh_hant: 姓氏

# 编辑邮箱
source: Edit Email
ar: تعديل البريد الإلكتروني
es: Editar correo
ja: メールアドレスを編集
ko: 이메일 수정
ms: Edit e-mel
pt: Editar e-mail
th: แก้ไขอีเมล
vi: Chỉnh sửa email
zh_hans: 编辑邮箱
zh_hant: 編輯郵箱

# 保存资料
source: Save Profile
ar: حفظ الملف الشخصي
es: Guardar perfil
id: Simpan profil
ja: プロフィールを保存
ko: 프로필 저장
ms: Simpan profil
pt: Guardar perfil
th: บันทึกโปรไฟล์
vi: Lưu hồ sơ
zh_hans: 保存资料
zh_hant: 儲存資料

# 您当前尚未设置密码。点击下方按钮创建密码，以便后续更改邮箱与密码。
source: You haven't set a password yet. Create one below to enable changing email and password.
ar: لم تقم بتعيين كلمة مرور بعد. أنشئ واحدة أدناه لتمكين تغيير البريد الإلكتروني وكلمة المرور.
es: Aún no has establecido una contraseña. Créala abajo para poder cambiar el correo y la contraseña.
id: Anda belum mengatur kata sandi. Buat di bawah untuk mengubah email dan kata sandi.
ja: 現在パスワードが設定されていません。下のボタンでパスワードを作成すると、今後メールアドレスやパスワードを変更できます。
ko: 아직 비밀번호가 설정되지 않았습니다. 아래에서 비밀번호를 생성하면 이메일과 비밀번호 변경이 가능합니다.
ms: Belum menetapkan kata laluan. Cipta di bawah untuk menukar e-mel dan kata laluan.
pt: Você ainda não definiu uma senha. Crie abaixo para poder alterar o e-mail e a senha.
th: คุณยังไม่ได้ตั้งรหัสผ่าน สร้างรหัสด้านล่างเพื่อเปลี่ยนอีเมลและรหัสผ่านในภายหลัง
vi: Bạn chưa đặt mật khẩu. Tạo bên dưới để thay đổi email và mật khẩu sau này.
zh_hans: 您当前尚未设置密码。点击下方按钮创建密码，以便后续更改邮箱与密码。
zh_hant: 目前尚未設定密碼。請在下方建立密碼，以便後續更改郵箱與密碼。

# 创建密码
source: Create Password
ar: إنشاء كلمة مرور
es: Crear contraseña
id: Buat kata sandi
ja: パスワードを作成
ko: 비밀번호 생성
ms: Cipta kata laluan
pt: Criar senha
th: สร้างรหัสผ่าน
vi: Tạo mật khẩu
zh_hans: 创建密码
zh_hant: 建立密碼

# 当前密码
source: Current Password
ar: كلمة المرور الحالية
es: Contraseña actual
id: Kata sandi saat ini
ja: 現在のパスワード
ko: 현재 비밀번호
ms: Kata laluan semasa
pt: Senha atual
th: รหัสผ่านปัจจุบัน
vi: Mật khẩu hiện tại
zh_hans: 当前密码
zh_hant: 目前密碼

# 更新密码
source: Update Password
ar: تحديث كلمة المرور
es: Actualizar contraseña
id: Perbarui kata sandi
ja: パスワードを更新
ko: 비밀번호 업데이트
ms: Kemas kini kata laluan
pt: Atualizar senha
th: อัปเดตรหัสผ่าน
vi: Cập nhật mật khẩu
zh_hans: 更新密码
zh_hant: 更新密碼

# 删除您的账户
source: Delete Your Account
ar: حذف حسابك
es: Eliminar tu cuenta
id: Hapus akun Anda
ja: アカウントを削除
ko: 계정 삭제
ms: Padam akaun anda
pt: Excluir sua conta
th: ลบบัญชีของคุณ
vi: Xóa tài khoản của bạn
zh_hans: 删除您的账户
zh_hant: 刪除您的帳戶

# 您可以永久删除您的账户，完成后无法撤销。
source: You can permanently delete your account; this cannot be undone.
ar: يمكنك حذف الحساب نهائيًا؛ لا يمكن التراجع عن ذلك.
es: Puedes eliminar tu cuenta de forma permanente; no se puede deshacer.
id: Anda dapat menghapus akun secara permanen; tindakan ini tidak dapat dibatalkan.
ja: アカウントを永久に削除できます。実行後は元に戻せません。
ko: 계정을 영구 삭제할 수 있으며, 되돌릴 수 없습니다.
ms: Anda boleh memadam akaun secara kekal; tindakan ini tidak boleh diundur.
pt: Você pode excluir a conta permanentemente; não é possível desfazer.
th: คุณสามารถลบบัญชีได้อย่างถาวรและไม่สามารถย้อนกลับได้
vi: Bạn có thể xóa vĩnh viễn tài khoản; thao tác này không thể hoàn tác.
zh_hans: 您可以永久删除您的账户，完成后无法撤销。
zh_hant: 您可以永久刪除帳戶，完成後無法撤銷。

# 删除账户
source: Delete Account
ar: حذف الحساب
es: Eliminar cuenta
id: Hapus akun
ja: アカウントを削除
ko: 계정 삭제
ms: Padam akaun
pt: Excluir conta
th: ลบบัญชี
vi: Xóa tài khoản
zh_hans: 删除账户
zh_hant: 刪除帳戶

# 当前邮箱
source: Current Email
ar: البريد الإلكتروني الحالي
es: Correo actual
id: Email saat ini
ja: 現在のメールアドレス
ko: 현재 이메일
ms: E-mel semasa
pt: E-mail atual
th: อีเมลปัจจุบัน
vi: Email hiện tại
zh_hans: 当前邮箱
zh_hant: 目前郵箱

# 验证与新邮箱
source: Verification & New Email
ar: التحقق والبريد الإلكتروني الجديد
es: Verificación y correo nuevo
id: Verifikasi & Email baru
ja: 確認と新しいメールアドレス
ko: 인증 및 새 이메일
ms: Pengesahan & E-mel baharu
pt: Verificação e novo e-mail
th: การยืนยันและอีเมลใหม่
vi: Xác minh & Email mới
zh_hans: 验证与新邮箱
zh_hant: 驗證與新郵箱

# 新的电子邮件地址
source: New Email Address
ar: عنوان بريد إلكتروني جديد
es: Nueva dirección de correo
id: Alamat email baru
ja: 新しいメールアドレス
ko: 새 이메일 주소
ms: Alamat e-mel baharu
pt: Novo endereço de e-mail
th: ที่อยู่อีเมลใหม่
vi: Địa chỉ email mới
zh_hans: 新的电子邮件地址
zh_hant: 新的電子郵件地址

# 保存邮箱
source: Save Email
ar: حفظ البريد الإلكتروني
es: Guardar correo
id: Simpan email
ja: メールアドレスを保存
ko: 이메일 저장
ms: Simpan e-mel
pt: Guardar e-mail
th: บันทึกอีเมล
vi: Lưu email
zh_hans: 保存邮箱
zh_hant: 儲存郵箱

# 请输入有效的新邮箱与当前密码
source: Enter a valid new email and your current password
ar: أدخل بريدًا إلكترونيًا جديدًا صالحًا وكلمة المرور الحالية
es: Introduce un nuevo correo válido y tu contraseña actual
id: Masukkan email baru yang valid dan kata sandi saat ini
ja: 有効な新しいメールアドレスと現在のパスワードを入力してください
ko: 유효한 새 이메일과 현재 비밀번호를 입력하세요
ms: Masukkan e-mel baharu yang sah dan kata laluan semasa
pt: Insira um novo e-mail válido e a sua senha atual
th: กรุณากรอกอีเมลใหม่ที่ถูกต้องและรหัสผ่านปัจจุบัน
vi: Nhập email mới hợp lệ và mật khẩu hiện tại
zh_hans: 请输入有效的新邮箱与当前密码
zh_hant: 請輸入有效的新郵箱與目前密碼

# 保存密码
source: Save Password
ar: حفظ كلمة المرور
es: Guardar contraseña
id: Simpan kata sandi
ja: パスワードを保存
ko: 비밀번호 저장
ms: Simpan kata laluan
pt: Guardar senha
th: บันทึกรหัสผ่าน
vi: Lưu mật khẩu
zh_hans: 保存密码
zh_hant: 儲存密碼

# 密码已更新，请重新登录
source: Password updated. Please sign in again
ar: تم تحديث كلمة المرور. الرجاء تسجيل الدخول مرة أخرى
es: Contraseña actualizada. Inicia sesión de nuevo
id: Kata sandi diperbarui. Silakan masuk lagi
ja: パスワードを更新しました。再度ログインしてください。
ko: 비밀번호가 업데이트되었습니다. 다시 로그인하세요
ms: Kata laluan dikemas kini. Sila log masuk semula
pt: Senha atualizada. Faça login novamente
th: อัปเดตรหัสผ่านแล้ว กรุณาเข้าสู่ระบบอีกครั้ง
vi: Mật khẩu đã được cập nhật. Vui lòng đăng nhập lại
zh_hans: 密码已更新，请重新登录
zh_hant: 密碼已更新，請重新登入

# 代理商名称
source: Agent Name
ar: اسم الوكيل
es: Nombre del agente
id: Nama Agen
ja: 代理店名
ko: 에이전트 이름
ms: Nama Ejen
pt: Nome do agente
th: ชื่อเอเจนต์
vi: Tên đại lý
zh_hans: 代理商名称
zh_hant: 代理商名稱
