Repository: ChaosSpiritVS/eSIM
Catalog: Simigo/Simigo/Resources/Localizable/*.lproj/Localizable.strings
Languages: ar, es, id, ja, ko, ms, pt, th, vi, zh_hans, zh_hant

# 扫描订单详情页的 eSIM 激活二维码
source: Scan the eSIM activation QR code from the order details page
ar: امسح رمز QR لتفعيل eSIM من صفحة تفاصيل الطلب
es: Escanear el código QR de activación de eSIM desde la página del pedido
id: Pindai QR aktivasi eSIM dari halaman detail pesanan
ja: 注文詳細ページの eSIM アクティベーション用QRコードをスキャンしてください
ko: 주문 상세의 eSIM 활성화 QR 코드 스캔
ms: Imbas kod QR pengaktifan eSIM dari halaman butiran pesanan
pt: Digitalizar o QR de ativação da eSIM na página do pedido
th: สแกน QR โค้ดเปิดใช้งาน eSIM จากหน้ารายละเอียดคำสั่งซื้อ
vi: Quét mã QR kích hoạt eSIM từ trang chi tiết đơn hàng
zh_hans: 扫描订单详情页的 eSIM 激活二维码
zh_hant: 掃描訂單詳情頁的 eSIM 啟用 QR 碼

# 继续支付
source: Continue Payment
ar: متابعة الدفع
es: Continuar pago
id: Lanjutkan pembayaran
ja: 支払いを続ける
ko: 결제 계속
ms: Teruskan bayaran
pt: Continuar pagamento
th: ชำระเงินต่อ
vi: Tiếp tục thanh toán
zh_hans: 继续支付
zh_hant: 繼續支付

# 重试支付
source: Retry Payment
ar: إعادة محاولة الدفع
es: Reintentar pago
id: Coba bayar lagi
ja: 支払いを再試行
ko: 결제 재시도
ms: Cuba bayar lagi
pt: Tentar pagar novamente
th: ลองชำระเงินอีกครั้ง
vi: Thử thanh toán lại
zh_hans: 重试支付
zh_hant: 重試支付

# 支付成功后，您将获得安装二维码与步骤说明。
source: After payment, you will get a QR code and instructions.
ar: بعد الدفع ستحصل على رمز QR للتثبيت وتعليمات.
es: Tras el pago, recibirás el QR de instalación y las instrucciones.
id: Setelah pembayaran, Anda akan menerima QR pemasangan dan petunjuk.
ja: 支払いが成功すると、インストール用QRコードと手順が表示されます。
ko: 결제 후 설치용 QR 코드와 안내가 제공됩니다.
ms: Selepas bayaran, anda akan menerima QR pemasangan dan panduan.
pt: Após o pagamento, receberá o QR de instalação e as instruções.
th: เมื่อชำระเงินสำเร็จ คุณจะได้รับ QR ติดตั้งและคำแนะนำ
vi: Sau khi thanh toán, bạn sẽ nhận mã QR cài đặt và hướng dẫn.
zh_hans: 支付成功后，您将获得安装二维码与步骤说明。
zh_hant: 支付成功後，您將獲得安裝 QR 碼與步驟說明。

# 结算
source: Checkout
ar: الدفع
es: Pago
id: Pembayaran
ja: チェックアウト
ko: 결제
ms: Pembayaran
pt: Finalizar compra
th: ชำระเงิน
vi: Thanh toán
zh_hans: 结算
zh_hant: 結算

# 正在支付…
source: Processing payment…
ar: جاري معالجة الدفع…
es: Procesando pago…
id: Memproses pembayaran…
ja: 支払いを処理中…
ko: 결제 처리 중…
ms: Memproses pembayaran…
pt: Processando pagamento…
th: กำลังดำเนินการชำระเงิน…
vi: Đang xử lý thanh toán…
zh_hans: 正在支付…
zh_hant: 正在支付…

# 当前离线，请连接网络后再重试支付
source: Currently offline. Connect to the network and retry payment
ar: أنت غير متصل. اتصل بالشبكة ثم أعد محاولة الدفع
es: Actualmente sin conexión. Conéctate a la red y vuelve a intentar el pago
id: Sedang offline. Sambungkan jaringan lalu coba bayar lagi
ja: 現在オフラインです。ネットワークに接続してから支払いを再試行してください。
ko: 오프라인입니다. 네트워크 연결 후 결제를 재시도하세요
ms: Luar talian. Sambung rangkaian dan cuba bayar lagi
pt: Está offline. Ligue-se à rede e tente pagar novamente
th: ออฟไลน์อยู่ เชื่อมต่อเครือข่ายแล้วลองชำระเงินอีกครั้ง
vi: Đang ngoại tuyến. Kết nối mạng và thử thanh toán lại
zh_hans: 当前离线，请连接网络后再重试支付
zh_hant: 目前離線，請連線後再重試支付

# 支付成功，已刷新详情与用量
source: Payment succeeded; refreshed details and usage
ar: تم الدفع بنجاح؛ تم تحديث التفاصيل والاستخدام
es: Pago exitoso; detalles y uso actualizados
id: Pembayaran berhasil; detail dan penggunaan telah diperbarui
ja: 支払いに成功しました。詳細と使用量を更新しました
ko: 결제 성공; 상세 정보와 사용량을 새로고침했습니다
ms: Pembayaran berjaya; butiran dan penggunaan telah dikemas kini
pt: Pagamento bem-sucedido; detalhes e uso atualizados
th: ชำระเงินสำเร็จ; รีเฟรชรายละเอียดและการใช้งานแล้ว
vi: Thanh toán thành công; đã làm mới chi tiết và mức dùng
zh_hans: 支付成功，已刷新详情与用量
zh_hant: 支付成功，已重新整理詳情與用量

# 当前付款方式不可用，已为您切换为可用方式
source: Selected payment method is unavailable; switched to an available option
ar: طريقة الدفع المحددة غير متاحة؛ تم التبديل إلى طريقة متاحة
es: El método de pago seleccionado no está disponible; se cambió a una opción disponible
id: Metode pembayaran terpilih tidak tersedia; dialihkan ke opsi yang tersedia
ja: 選択した支払い方法は利用できません。利用可能な方法に切り替えました
ko: 선택한 결제 수단을 사용할 수 없어 사용 가능한 수단으로 변경했습니다
ms: Kaedah pembayaran yang dipilih tidak tersedia; ditukar kepada pilihan yang tersedia
pt: O método de pagamento selecionado não está disponível; alterado para uma opção disponível
th: วิธีชำระเงินที่เลือกใช้ไม่ได้; ได้สลับไปเป็นตัวเลือกที่ใช้ได้
vi: Phương thức thanh toán đã chọn không khả dụng; đã chuyển sang tùy chọn khả dụng
zh_hans: 当前付款方式不可用，已为您切换为可用方式
zh_hant: 目前付款方式不可用，已為您切換為可用方式

# 请选择付款方式
source: Please select a payment method
ar: يرجى اختيار طريقة الدفع
es: Seleccione un método de pago
id: Silakan pilih metode pembayaran
ja: 支払い方法を選択してください
ko: 결제 방법을 선택하세요
ms: Sila pilih kaedah pembayaran
pt: Selecione um método de pagamento
th: โปรดเลือกวิธีการชำระเงิน
vi: Vui lòng chọn phương thức thanh toán
zh_hans: 请选择付款方式
zh_hant: 請選擇付款方式

# 缺少套餐信息
source: Missing bundle information
ar: معلومات الباقة مفقودة
es: Falta información del paquete
id: Informasi paket tidak tersedia
ja: プラン情報が不足しています
ko: 패키지 정보가 없습니다
ms: Maklumat pakej tidak tersedia
pt: Faltam informações do pacote
th: ไม่มีข้อมูลแพ็คเกจ
vi: Thiếu thông tin gói
zh_hans: 缺少套餐信息
zh_hant: 缺少套餐資訊

# 支付成功，已重新整理订单与用量
source: Payment succeeded; refreshed orders and usage
ar: تم الدفع بنجاح. تم تحديث الطلبات والاستخدام
es: Pago exitoso; pedidos y uso actualizados
id: Pembayaran berhasil; pesanan dan penggunaan telah diperbarui
ja: 支払いに成功しました。注文と使用量を更新しました
ko: 결제 성공. 주문과 사용량을 업데이트했습니다
pt: Pagamento bem‑sucedido; pedidos e uso atualizados
vi: Thanh toán thành công; đã cập nhật đơn hàng và mức dùng
zh_hans: 支付成功，已重新整理订单与用量
zh_hant: 支付成功，已重新整理訂單與用量

# 如无法扫描二维码，可输入激活码或下载配置文件。
source: If QR scanning fails, enter the activation code or download the profile.
ar: إذا فشل مسح رمز QR، أدخل رمز التفعيل أو قم بتنزيل الملف التعريفي
es: Si falla el escaneo del QR, introduce el código de activación o descarga el perfil
id: Jika pemindaian QR gagal, masukkan kode aktivasi atau unduh profil.
ja: QRコードをスキャンできない場合は、アクティベーションコードを入力するか構成プロファイルをダウンロードしてください。
ko: QR 스캔에 실패하면 활성화 코드를 입력하거나 프로파일을 다운로드하세요
ms: Jika imbasan QR gagal, masukkan kod pengaktifan atau muat turun profil.
pt: Se o QR falhar, introduza o código de ativação ou transfira o perfil.
th: หากสแกน QR ไม่ได้ ให้ป้อนรหัสเปิดใช้งานหรือดาวน์โหลดโปรไฟล์
vi: Nếu không quét được QR, hãy nhập mã kích hoạt hoặc tải hồ sơ cấu hình
zh_hans: 如无法扫描二维码，可输入激活码或下载配置文件。
zh_hant: 若無法掃描 QR 碼，可輸入啟用碼或下載設定檔。

# 已复制激活码
source: Activation code copied
ar: تم نسخ رمز التفعيل
es: Código de activación copiado
id: Kode aktivasi disalin
ja: アクティベーションコードをコピーしました
ko: 활성화 코드가 복사되었습니다
ms: Kod pengaktifan disalin
pt: Código de ativação copiado
th: คัดลอกรหัสเปิดใช้งานแล้ว
vi: Đã sao chép mã kích hoạt
zh_hans: 已复制激活码
zh_hant: 已複製啟用碼

# 已复制 SM-DP+ 地址
source: SM-DP+ address copied
ar: تم نسخ عنوان SM-DP+
es: Dirección SM-DP+ copiada
id: Alamat SM-DP+ disalin
ja: SM-DP+ アドレスをコピーしました
ko: SM-DP+ 주소가 복사되었습니다
ms: Alamat SM-DP+ disalin
pt: Endereço SM-DP+ copiado
th: คัดลอกที่อยู่ SM-DP+ แล้ว
vi: Đã sao chép địa chỉ SM-DP+
zh_hans: 已复制 SM-DP+ 地址
zh_hant: 已複製 SM-DP+ 位址

# 安装指南
source: Installation Guide
ar: دليل التثبيت
es: Guía de instalación
id: Panduan instalasi
ja: インストールガイド
ko: 설치 가이드
ms: Panduan pemasangan
pt: Guia de instalação
th: คู่มือการติดตั้ง
vi: Hướng dẫn cài đặt
zh_hans: 安装指南
zh_hant: 安裝指南

# 查看 eSIM 安装指南
source: View eSIM Installation Guide
ar: عرض دليل تثبيت eSIM
es: Ver guía de instalación de eSIM
id: Lihat panduan instalasi eSIM
ja: eSIM インストールガイドを見る
ko: eSIM 설치 가이드 보기
ms: Lihat panduan pemasangan eSIM
pt: Ver guia de instalação da eSIM
th: ดูคู่มือการติดตั้ง eSIM
vi: Xem hướng dẫn cài đặt eSIM
zh_hans: 查看 eSIM 安装指南
zh_hant: 查看 eSIM 安裝指南

# 扫描二维码以安装 eSIM
source: Scan the QR code to install eSIM
ar: امسح رمز QR لتثبيت eSIM
es: Escanea el QR para instalar la eSIM
id: Pindai QR untuk memasang eSIM
ja: QR コードをスキャンして eSIM をインストール
ko: QR 코드를 스캔하여 eSIM 설치
ms: Imbas kod QR untuk memasang eSIM
pt: Digitalize o QR para instalar a eSIM
th: สแกน QR เพื่อติดตั้ง eSIM
vi: Quét mã QR để cài eSIM
zh_hans: 扫描二维码以安装 eSIM
zh_hant: 掃描 QR 碼以安裝 eSIM

# 激活码
source: Activation Code
ar: رمز التفعيل
es: Código de activación
id: Kode aktivasi
ja: アクティベーションコード
ko: 활성화 코드
ms: Kod pengaktifan
pt: Código de ativação
th: รหัสเปิดใช้งาน
vi: Mã kích hoạt
zh_hans: 激活码
zh_hant: 啟用碼

# 复制激活码
source: Copy activation code
ar: نسخ رمز التفعيل
es: Copiar código de activación
id: Salin kode aktivasi
ja: アクティベーションコードをコピー
ko: 활성화 코드 복사
ms: Salin kod pengaktifan
pt: Copiar código de ativação
th: คัดลอกรหัสเปิดใช้งาน
vi: Sao chép mã kích hoạt
zh_hans: 复制激活码
zh_hant: 複製啟用碼

# SM-DP+ 地址
source: SM-DP+ Address
ar: عنوان SM-DP+
es: Dirección SM-DP+
id: Alamat SM-DP+
ja: SM-DP+ アドレス
ko: SM-DP+ 주소
ms: Alamat SM-DP+
pt: Endereço SM-DP+
th: ที่อยู่ SM-DP+
vi: Địa chỉ SM-DP+
zh_hans: SM-DP+ 地址
zh_hant: SM-DP+ 位址

# 复制 SM-DP+ 地址
source: Copy SM-DP+ address
ar: نسخ عنوان SM-DP+
es: Copiar dirección SM-DP+
id: Salin alamat SM-DP+
ja: SM-DP+ アドレスをコピー
ko: SM-DP+ 주소 복사
ms: Salin alamat SM-DP+
pt: Copiar endereço SM-DP+
th: คัดลอกที่อยู่ SM-DP+
vi: Sao chép địa chỉ SM-DP+
zh_hans: 复制 SM-DP+ 地址
zh_hant: 複製 SM-DP+ 位址

# 安装步骤
source: Installation Steps
ar: خطوات التثبيت
es: Pasos de instalación
id: Langkah pemasangan
ja: インストール手順
ko: 설치 단계
ms: Langkah pemasangan
pt: Passos de instalação
th: ขั้นตอนการติดตั้ง
vi: Các bước cài đặt
zh_hans: 安装步骤
zh_hant: 安裝步驟

# 如无法扫描二维码，可输入激活码。
source: If you cannot scan the QR code, enter the activation code.
ar: إذا تعذر مسح QR، أدخل رمز التفعيل.
es: Si no puedes escanear el QR, introduce el código de activación.
id: Jika tidak bisa memindai QR, masukkan kode aktivasi.
ja: QRコードをスキャンできない場合はアクティベーションコードを入力してください。
ko: QR 스캔이 불가하면 활성화 코드를 입력하세요.
ms: Jika tidak dapat mengimbas QR, masukkan kod pengaktifan.
pt: Se não conseguir digitalizar o QR, introduza o código de ativação.
th: หากสแกน QR ไม่ได้ ให้กรอกรหัสเปิดใช้งาน
vi: Nếu không quét được QR, hãy nhập mã kích hoạt.
zh_hans: 如无法扫描二维码，可输入激活码。
zh_hant: 若無法掃描 QR 碼，可輸入啟用碼。

# eSIM 安装指南
source: eSIM Installation Guide
ar: دليل تثبيت eSIM
es: Guía de instalación de eSIM
id: Panduan pemasangan eSIM
ja: eSIM インストールガイド
ko: eSIM 설치 가이드
ms: Panduan pemasangan eSIM
pt: Guia de instalação da eSIM
th: คู่มือการติดตั้ง eSIM
vi: Hướng dẫn cài đặt eSIM
zh_hans: eSIM 安装指南
zh_hant: eSIM 安裝指南

# 方式一：通过二维码安装
source: Method 1: Install via QR code
ar: الطريقة 1: التثبيت عبر رمز QR
es: Método 1: Instalar con código QR
id: Metode 1: Instal dengan QR code
ja: 方法1：QRコードでインストール
ko: 방법 1: QR 코드로 설치
ms: Kaedah 1: Pasang dengan kod QR
pt: Método 1: Instalar com código QR
th: วิธีที่ 1: ติดตั้งด้วย QR โค้ด
vi: Cách 1: Cài bằng mã QR
zh_hans: 方式一：通过二维码安装
zh_hant: 方式一：透過 QR 碼安裝

# 打开 iPhone 设置 > 蜂窝网络 (Cellular)
source: Open iPhone Settings > Cellular
ar: افتح إعدادات iPhone > البيانات الخلوية
es: Abrir Ajustes de iPhone > Datos móviles
id: Buka Pengaturan iPhone > Seluler
ja: iPhoneの設定 > モバイル通信（Cellular）を開く
ko: iPhone 설정 > 셀룰러 열기
ms: Buka Tetapan iPhone > Selular
pt: Abrir Definições do iPhone > Dados móveis
th: เปิดการตั้งค่า iPhone > เซลลูลาร์
vi: Mở Cài đặt iPhone > Di động
zh_hans: 打开 iPhone 设置 > 蜂窝网络 (Cellular)
zh_hant: 打開 iPhone 設定 > 行動網路 (Cellular)

# 方式二：手动输入激活码安装
source: Method 2: Install using activation code
ar: الطريقة 2: التثبيت بإدخال رمز التفعيل
es: Método 2: Instalar introduciendo el código de activación
id: Metode 2: Instal dengan memasukkan kode aktivasi
ja: 方法2：アクティベーションコードを手動入力してインストール
ko: 방법 2: 활성화 코드를 입력하여 설치
ms: Kaedah 2: Pasang dengan memasukkan kod pengaktifan
pt: Método 2: Instalar introduzindo o código de ativação
th: วิธีที่ 2: ติดตั้งโดยกรอกรหัสเปิดใช้งาน
vi: Cách 2: Cài đặt bằng mã kích hoạt
zh_hans: 方式二：手动输入激活码安装
zh_hant: 方式二：手動輸入啟用碼安裝

# 打开 设置 > 蜂窝网络 > 添加蜂窝套餐
source: Open Settings > Cellular > Add Cellular Plan
ar: افتح الإعدادات > البيانات الخلوية > إضافة خطة خلوية
es: Abrir Ajustes > Datos móviles > Añadir plan
id: Buka Pengaturan > Seluler > Tambah Paket Seluler
ja: 設定 > モバイル通信 > モバイル通信プランを追加 を開く
ko: 설정 > 셀룰러 > 셀룰러 요금제 추가
ms: Buka Tetapan > Selular > Tambah Pelan Selular
pt: Abrir Definições > Dados móveis > Adicionar plano
th: เปิด การตั้งค่า > เซลลูลาร์ > เพิ่มแพลนเซลลูลาร์
vi: Mở Cài đặt > Di động > Thêm gói di động
zh_hans: 打开 设置 > 蜂窝网络 > 添加蜂窝套餐
zh_hant: 打開 設定 > 行動網路 > 新增行動方案

# 选择 手动输入详细信息（Enter Details Manually）
source: Choose Enter Details Manually
ar: اختر إدخال التفاصيل يدويًا
es: Seleccionar Introducir detalles manualmente
id: Pilih Masukkan detail secara manual
ja: 手動で詳細を入力（Enter Details Manually）を選択
ko: 세부 정보를 수동 입력 선택
ms: Pilih Masukkan butiran secara manual
pt: Selecionar Introduzir detalhes manualmente
th: เลือก กรอกรายละเอียดด้วยตนเอง
vi: Chọn Nhập chi tiết thủ công
zh_hans: 选择 手动输入详细信息（Enter Details Manually）
zh_hant: 選擇 手動輸入詳細資訊（Enter Details Manually）

# a. SM-DP+ 地址（由运营商提供）
source: a. SM-DP+ Address (provided by carrier)
ar: a. عنوان SM-DP+ (يقدمه المزود)
es: a. Dirección SM-DP+ (proveedor)
id: a. Alamat SM-DP+ (disediakan operator)
ja: a. SM-DP+ アドレス（キャリア提供）
ko: a. SM-DP+ 주소(통신사 제공)
ms: a. Alamat SM-DP+ (disediakan oleh operator)
pt: a. Endereço SM-DP+ (fornecido pela operadora)
th: a. ที่อยู่ SM-DP+ (ผู้ให้บริการระบุ)
vi: a. Địa chỉ SM-DP+ (nhà mạng cung cấp)
zh_hans: a. SM-DP+ 地址（由运营商提供）
zh_hant: a. SM-DP+ 位址（由電信商提供）

# b. 激活码（Activation Code 或 Matching ID）
source: b. Activation Code or Matching ID
ar: b. رمز التفعيل أو معرف المطابقة
es: b. Código de activación o Matching ID
id: b. Kode aktivasi atau Matching ID
ja: b. アクティベーションコード（Activation Code / Matching ID）
ko: b. 활성화 코드 또는 매칭 ID
ms: b. Kod pengaktifan atau Matching ID
pt: b. Código de ativação ou Matching ID
th: b. รหัสเปิดใช้งาน หรือ Matching ID
vi: b. Mã kích hoạt hoặc Matching ID
zh_hans: b. 激活码（Activation Code 或 Matching ID）
zh_hant: b. 啟用碼（Activation Code 或 Matching ID）

# c. 确认码（Confirmation Code）
source: c. Confirmation Code
ar: c. رمز التأكيد
es: c. Código de confirmación
id: c. Kode konfirmasi
ja: c. 確認コード（Confirmation Code）
ko: c. 확인 코드
ms: c. Kod pengesahan
pt: c. Código de confirmação
th: c. รหัสยืนยัน
vi: c. Mã xác nhận
zh_hans: c. 确认码（Confirmation Code）
zh_hant: c. 確認碼（Confirmation Code）

# 进入“设置”> 蜂窝网络，然后选择 eSIM
source: Go to Settings > Cellular and select the eSIM
ar: اذهب إلى الإعدادات > البيانات الخلوية ثم اختر eSIM
es: Ir a Ajustes > Datos móviles y seleccionar eSIM
id: Masuk ke Pengaturan > Seluler dan pilih eSIM
ja: 設定 > モバイル通信 に移動し、eSIM を選択
ko: 설정 > 셀룰러로 이동하여 eSIM 선택
ms: Pergi ke Tetapan > Selular dan pilih eSIM
pt: Ir a Definições > Dados móveis e selecionar a eSIM
th: ไปที่ การตั้งค่า > เซลลูลาร์ แล้วเลือก eSIM
vi: Vào Cài đặt > Di động và chọn eSIM
zh_hans: 进入“设置”> 蜂窝网络，然后选择 eSIM
zh_hant: 進入「設定」> 行動網路，然後選擇 eSIM

# 打开“启用此线路”
source: Enable This Line
ar: فعّل ‘تمكين هذا الخط’
es: Activar ‘Habilitar esta línea’
id: Aktifkan ‘Aktifkan Jalur ini’
ja: この回線を有効にする をオンにする
ko: ‘이 회선 활성화’ 켜기
ms: Hidupkan ‘Aktifkan talian ini’
pt: Ativar ‘Ativar esta linha’
th: เปิด ‘เปิดใช้งานสายนี้’
vi: Bật ‘Bật tuyến này’
zh_hans: 打开“启用此线路”
zh_hant: 打開「啟用此路線」

# 进入“设置”> 蜂窝网络 > 蜂窝数据网络，并选择使用该 eSIM
source: Go to Settings > Cellular > Cellular Data and select this eSIM
ar: اذهب إلى الإعدادات > البيانات الخلوية > بيانات خلوية واختر هذه eSIM
es: Ir a Ajustes > Datos móviles > Datos móviles y seleccionar esta eSIM
id: Masuk ke Pengaturan > Seluler > Data Seluler dan pilih eSIM ini
ja: 設定 > モバイル通信 > モバイルデータ通信 に移動し、この eSIM を選択
ko: 설정 > 셀룰러 > 셀룰러 데이터에서 이 eSIM 선택
ms: Pergi ke Tetapan > Selular > Data Selular dan pilih eSIM ini
pt: Ir a Definições > Dados móveis > Dados móveis e selecionar esta eSIM
th: ไปที่ การตั้งค่า > เซลลูลาร์ > ข้อมูลเซลลูลาร์ แล้วเลือก eSIM นี้
vi: Vào Cài đặt > Di động > Dữ liệu di động và chọn eSIM này
zh_hans: 进入“设置”> 蜂窝网络 > 蜂窝数据网络，并选择使用该 eSIM
zh_hant: 進入「設定」> 行動網路 > 行動數據，並選擇使用該 eSIM

# 根据需要打开“数据漫游”
source: Enable Data Roaming if needed
ar: فعّل تجوال البيانات عند الحاجة
es: Activar Itinerancia de datos si es necesario
id: Aktifkan Data Roaming bila perlu
ja: 必要に応じて データローミング をオンにする
ko: 필요 시 데이터 로밍 켜기
ms: Hidupkan Perayauan Data jika perlu
pt: Ativar Roaming de dados se necessário
th: เปิด ‘โรมมิ่งข้อมูล’ ตามต้องการ
vi: Bật Chuyển vùng dữ liệu nếu cần
zh_hans: 根据需要打开“数据漫游”
zh_hant: 依需要開啟「數據漫遊」

# 打开 设置 > 网络和互联网 > SIM 卡 或 移动网络
source: Open Settings > Network & Internet > SIM or Mobile network
ar: افتح الإعدادات > الشبكة والإنترنت > SIM أو شبكة المحمول
es: Abrir Ajustes > Red e Internet > SIM o Red móvil
id: Buka Pengaturan > Jaringan & Internet > SIM atau Jaringan seluler
ja: 設定 > ネットワークとインターネット > SIM または モバイルネットワーク を開く
ko: 설정 > 네트워크 및 인터넷 > SIM 또는 모바일 네트워크 열기
ms: Buka Tetapan > Rangkaian & Internet > SIM atau Rangkaian mudah alih
pt: Abrir Definições > Rede e Internet > SIM ou Rede móvel
th: เปิด การตั้งค่า > เครือข่ายและอินเทอร์เน็ต > SIM หรือ เครือข่ายมือถือ
vi: Mở Cài đặt > Mạng & Internet > SIM hoặc Mạng di động
zh_hans: 打开 设置 > 网络和互联网 > SIM 卡 或 移动网络
zh_hant: 打開 設定 > 網路與網際網路 > SIM 卡 或 行動網路

# 选择 使用二维码
source: Select Use QR code
ar: اختر استخدام رمز QR
es: Seleccionar Usar código QR
id: Pilih Gunakan QR code
ja: QRコードの使用 を選択
ko: QR 코드 사용 선택
ms: Pilih Guna kod QR
pt: Selecionar Usar código QR
th: เลือก ใช้ QR โค้ด
vi: Chọn Sử dụng mã QR
zh_hans: 选择 使用二维码
zh_hant: 選擇 使用 QR 碼

# 进入 设置 > 网络和互联网 > SIM 卡 > 添加 eSIM
source: Go to Settings > Network & Internet > SIM > Add eSIM
ar: اذهب إلى الإعدادات > الشبكة والإنترنت > SIM > إضافة eSIM
es: Ir a Ajustes > Red e Internet > SIM > Añadir eSIM
id: Masuk ke Pengaturan > Jaringan & Internet > SIM > Tambah eSIM
ja: 設定 > ネットワークとインターネット > SIM > eSIM を追加 に移動
ko: 설정 > 네트워크 및 인터넷 > SIM > eSIM 추가
ms: Pergi ke Tetapan > Rangkaian & Internet > SIM > Tambah eSIM
pt: Ir a Definições > Rede e Internet > SIM > Adicionar eSIM
th: ไปที่ การตั้งค่า > เครือข่ายและอินเทอร์เน็ต > SIM > เพิ่ม eSIM
vi: Vào Cài đặt > Mạng & Internet > SIM > Thêm eSIM
zh_hans: 进入 设置 > 网络和互联网 > SIM 卡 > 添加 eSIM
zh_hant: 進入 設定 > 網路與網際網路 > SIM 卡 > 新增 eSIM

# 进入 输入激活码/匹配码
source: Go to Enter activation/matching code
ar: انتقل إلى إدخال رمز التفعيل/المطابقة
es: Ir a Introducir código de activación/matching
id: Masuk ke Masukkan kode aktivasi/kode pencocokan
ja: アクティベーションコード/照合コードの入力 に移動
ko: 활성화/매칭 코드 입력으로 이동
ms: Pergi ke Masukkan kod pengaktifan/kod padanan
pt: Ir a Introduzir código de ativação/matching
th: ไปที่ กรอกรหัสเปิดใช้งาน/รหัสจับคู่
vi: Vào Nhập mã kích hoạt/mã khớp
zh_hans: 进入 输入激活码/匹配码
zh_hant: 進入 輸入啟用碼/配對碼

# 手动输入：
source: Enter manually:
ar: إدخال يدوي:
es: Introducir manualmente:
id: Masukkan secara manual:
ja: 手動入力：
ko: 수동 입력:
ms: Masukkan secara manual:
pt: Introdução manual:
th: กรอกด้วยตนเอง:
vi: Nhập thủ công:
zh_hans: 手动输入：
zh_hant: 手動輸入：

# a. SM-DP+ 地址
source: a. SM-DP+ Address
ar: a. عنوان SM-DP+
es: a. Dirección SM-DP+
id: a. Alamat SM-DP+
ja: a. SM-DP+ アドレス
ko: a. SM-DP+ 주소
ms: a. Alamat SM-DP+
pt: a. Endereço SM-DP+
th: a. ที่อยู่ SM-DP+
vi: a. Địa chỉ SM-DP+
zh_hans: a. SM-DP+ 地址
zh_hant: a. SM-DP+ 位址

# b. 激活码 / 匹配 ID
source: b. Activation Code / Matching ID
ar: b. رمز التفعيل / معرف المطابقة
es: b. Código de activación / Matching ID
id: b. Kode aktivasi / Matching ID
ja: b. アクティベーションコード / 照合ID
ko: b. 활성화 코드 / 매칭 ID
ms: b. Kod pengaktifan / Matching ID
pt: b. Código de ativação / Matching ID
th: b. รหัสเปิดใช้งาน / Matching ID
vi: b. Mã kích hoạt / Matching ID
zh_hans: b. 激活码 / 匹配 ID
zh_hant: b. 啟用碼 / 配對 ID

# c. 确认码（如有）
source: c. Confirmation Code (if any)
ar: c. رمز التأكيد (إن وجد)
es: c. Código de confirmación (si aplica)
id: c. Kode konfirmasi (jika ada)
ja: c. 確認コード（該当する場合）
ko: c. 확인 코드(있는 경우)
ms: c. Kod pengesahan (jika ada)
pt: c. Código de confirmação (se aplicável)
th: c. รหัสยืนยัน (ถ้ามี)
vi: c. Mã xác nhận (nếu có)
zh_hans: c. 确认码（如有）
zh_hant: c. 確認碼（如有）

# 点击 连接/下载/应用，完成安装
source: Tap Connect/Download/Apply to complete
ar: اضغط اتصال/تنزيل/تطبيق للإكمال
es: Tocar Conectar/Descargar/Aplicar para completar
id: Ketuk Hubungkan/Unduh/Terapkan untuk menyelesaikan
ja: 接続/ダウンロード/適用 をタップして完了
ko: 연결/다운로드/적용을 탭하여 완료
ms: Ketik Sambung/Muat turun/Guna untuk selesai
pt: Tocar Ligar/Transferir/Aplicar para concluir
th: แตะ เชื่อมต่อ/ดาวน์โหลด/นำไปใช้ เพื่อเสร็จสิ้น
vi: Chạm Kết nối/Tải/Áp dụng để hoàn tất
zh_hans: 点击 连接/下载/应用，完成安装
zh_hant: 點選 連線/下載/套用，完成安裝

# 在 设置 > 网络和互联网 > SIM 卡中，打开 eSIM 开关
source: In Settings > Network & Internet > SIM, turn on the eSIM
ar: في الإعدادات > الشبكة والإنترنت > SIM، فعّل مفتاح eSIM
es: En Ajustes > Red e Internet > SIM, activar la eSIM
id: Di Pengaturan > Jaringan & Internet > SIM, aktifkan eSIM
ja: 設定 > ネットワークとインターネット > SIM で、eSIM スイッチをオンにする
ko: 설정 > 네트워크 및 인터넷 > SIM에서 eSIM 스위치 켜기
ms: Dalam Tetapan > Rangkaian & Internet > SIM, hidupkan suis eSIM
pt: Em Definições > Rede e Internet > SIM, ative a eSIM
th: ใน การตั้งค่า > เครือข่ายและอินเทอร์เน็ต > SIM ให้เปิดสวิตช์ eSIM
vi: Trong Cài đặt > Mạng & Internet > SIM, bật eSIM
zh_hans: 在 设置 > 网络和互联网 > SIM 卡中，打开 eSIM 开关
zh_hant: 在 設定 > 網路與網際網路 > SIM 卡中，打開 eSIM 開關

# 将该 eSIM 设为默认数据线路，必要时启用数据漫游
source: Set this eSIM as default data; enable roaming if needed
ar: اجعل هذه eSIM خط البيانات الافتراضي وفعل التجوال إن لزم
es: Establecer esta eSIM como datos por defecto; activar itinerancia si es necesario
id: Set eSIM ini sebagai data default; aktifkan roaming jika perlu
ja: この eSIM をデフォルトのデータ回線に設定し、必要に応じてデータローミングをオンにする
ko: 이 eSIM을 기본 데이터로 설정하고 필요 시 로밍 활성화
ms: Tetapkan eSIM ini sebagai data lalai; hidupkan perayauan jika perlu
pt: Defina esta eSIM como dados padrão; ative o roaming se necessário
th: ตั้ง eSIM นี้เป็นช่องทางข้อมูลเริ่มต้น และเปิดโรมมิ่งเมื่อจำเป็น
vi: Đặt eSIM này làm dữ liệu mặc định; bật chuyển vùng nếu cần
zh_hans: 将该 eSIM 设为默认数据线路，必要时启用数据漫游
zh_hant: 將該 eSIM 設為預設數據路線，必要時啟用數據漫遊
