Repository: ChaosSpiritVS/eSIM
Catalog: Simigo/Simigo/Resources/Localizable/*.lproj/Localizable.strings
Languages: ar, es, id, ja, ko, ms, pt, th, vi, zh_hans, zh_hant

# 合理使用政策简介
source: Acceptable Use Policy Overview
zh_hans: 合理使用政策简介

# 请合理使用网络资源，禁止滥用或非法用途。
source: Use network resources responsibly; abuse or illegal use is prohibited.
zh_hans: 请合理使用网络资源，禁止滥用或非法用途。

# 我们可能在过度使用时采取限制措施。
source: We may enforce limits in cases of excessive use.
zh_hans: 我们可能在过度使用时采取限制措施。

# 更多详尽条款请访问官网合理使用政策页面。
source: Visit our website for full acceptable use policy.
zh_hans: 更多详尽条款请访问官网合理使用政策页面。

# Cookie 政策简介
source: Cookie Policy Overview
zh_hans: Cookie 政策简介

# 我们使用 Cookie 与类似技术改善体验与分析性能。
source: We use cookies and similar technologies to improve experience and analyze performance.
zh_hans: 我们使用 Cookie 与类似技术改善体验与分析性能。

# 您可在浏览器或系统设置中管理 Cookie 偏好。
source: Manage cookie preferences in your browser or system settings.
zh_hans: 您可在浏览器或系统设置中管理 Cookie 偏好。

# 更多详尽条款请访问官网 Cookie 政策页面。
source: Visit our website for the full cookie policy.
zh_hans: 更多详尽条款请访问官网 Cookie 政策页面。

# 品牌名
source: eSIM Home
es: Simigo
ms: Simigo
vi: Simigo
