Repository: ChaosSpiritVS/eSIM
Catalog: Simigo/Simigo/Resources/Localizable/*.lproj/Localizable.strings
Languages: ar, es, id, ja, ko, ms, pt, th, vi, zh_hans, zh_hant

# 两次输入的密码不一致
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين
es: Las contraseñas no coinciden
id: Kata sandi tidak cocok
ja: 入力されたパスワードが一致しません
ko: 비밀번호가 일치하지 않습니다
ms: Kata laluan tidak sepadan
pt: As senhas não coincidem
th: รหัสผ่านไม่ตรงกัน
vi: Mật khẩu không khớp
zh_hans: 两次输入的密码不一致
zh_hant: 兩次輸入的密碼不一致

# 代理商中心
source: Agent Center
ar: مركز الوكلاء
es: Centro de agentes
id: Pusat Agen
ja: 代理店センター
ko: 대리점 센터
ms: Pusat Ejen
pt: Centro de Agentes
th: ศูนย์ตัวแทน
vi: Trung tâm đại lý
zh_hans: 代理商中心
zh_hant: 代理商中心

# 账单列表
source: Bills
ar: قائمة الفواتير
es: Lista de facturas
id: Daftar Tagihan
ja: 請求書一覧
ko: 청구서 목록
ms: Senarai Bil
pt: Lista de faturas
th: รายการบิล
vi: Danh sách hóa đơn
zh_hans: 账单列表
zh_hant: 帳單列表

# 代理商ID
source: Agent ID
ar: معرّف الوكيل
es: ID de agente
id: ID Agen
ja: 代理店ID
ko: 에이전트 ID
ms: ID Ejen
pt: ID do agente
th: รหัสตัวแทน
vi: ID đại lý
zh_hans: 代理商ID
zh_hant: 代理商ID

# 用户名
source: Username
ar: اسم المستخدم
es: Nombre de usuario
id: Nama Pengguna
ja: ユーザー名
ko: 사용자 이름
ms: Nama Pengguna
pt: Nome de usuário
th: ชื่อผู้ใช้
vi: Tên người dùng
zh_hans: 用户名
zh_hant: 使用者名稱

# 余额
source: Balance
ar: الرصيد
es: Saldo
id: Saldo
ja: 残高
ko: 잔액
ms: Baki
pt: Saldo
th: ยอดเงินคงเหลือ
vi: Số dư
zh_hans: 余额
zh_hant: 餘額

# 分成比例
source: Revenue Share
ar: نسبة مشاركة الإيرادات
es: Porcentaje de reparto de ingresos
id: Rasio Bagi Hasil
ja: 収益分配率
ko: 수익 분배율
ms: Kadar Perkongsian Hasil
pt: Taxa de partilha de receita
th: อัตราส่วนแบ่งรายได้
vi: Tỷ lệ chia sẻ doanh thu
zh_hans: 分成比例
zh_hant: 分潤比例

# 暂无账户数据或别名模式未开启
source: No account data, or alias mode disabled.
ar: لا توجد بيانات حساب أو وضع الاسم المستعار غير ممكّن
es: Sin datos de cuenta o modo alias desactivado
id: Tidak ada data akun atau mode alias dinonaktifkan
ja: アカウントデータがない、またはエイリアスモードが無効です。
ko: 계정 데이터가 없거나 별칭 모드가 꺼져 있습니다
ms: Tiada data akaun atau mod alias dilumpuhkan
pt: Sem dados da conta ou modo de alias desativado
th: ไม่มีข้อมูลบัญชีหรือโหมดนามแฝงถูกปิด
vi: Không có dữ liệu tài khoản hoặc chế độ bí danh bị tắt
zh_hans: 暂无账户数据或别名模式未开启
zh_hant: 暫無帳戶資料或別名模式未開啟

# 账单筛选
source: Filter Bills
ar: تصفية الفواتير
es: Filtrar facturas
id: Filter Tagihan
ja: 請求書を絞り込み
ko: 청구서 필터
ms: Penapis Bil
pt: Filtrar faturas
th: ตัวกรองบิล
vi: Lọc hóa đơn
zh_hans: 账单筛选
zh_hant: 帳單篩選

# 参考号（可选）
source: Reference (optional)
ar: رقم مرجعي (اختياري)
es: Número de referencia (opcional)
id: Nomor Referensi (opsional)
ja: 参照番号（任意）
ko: 참조 번호(선택)
ms: No. Rujukan (pilihan)
pt: Número de referência (opcional)
th: หมายเลขอ้างอิง (ตัวเลือก)
vi: Số tham chiếu (tùy chọn)
zh_hans: 参考号（可选）
zh_hant: 參考號（選填）

# 开始日期 YYYY-MM-DD（可选）
source: Start Date YYYY-MM-DD (optional)
ar: تاريخ البداية YYYY-MM-DD (اختياري)
es: Fecha de inicio YYYY-MM-DD (opcional)
id: Tanggal Mulai YYYY-MM-DD (opsional)
ja: 開始日 YYYY-MM-DD（任意）
ko: 시작 날짜 YYYY-MM-DD(선택)
ms: Tarikh Mula YYYY-MM-DD (pilihan)
pt: Data de início YYYY-MM-DD (opcional)
th: วันที่เริ่ม YYYY-MM-DD (ตัวเลือก)
vi: Ngày bắt đầu YYYY-MM-DD (tùy chọn)
zh_hans: 开始日期 YYYY-MM-DD（可选）
zh_hant: 開始日期 YYYY-MM-DD（選填）

# 结束日期 YYYY-MM-DD（可选）
source: End Date YYYY-MM-DD (optional)
ar: تاريخ الانتهاء YYYY-MM-DD (اختياري)
es: Fecha de fin YYYY-MM-DD (opcional)
id: Tanggal Selesai YYYY-MM-DD (opsional)
ja: 終了日 YYYY-MM-DD（任意）
ko: 종료 날짜 YYYY-MM-DD(선택)
ms: Tarikh Tamat YYYY-MM-DD (pilihan)
pt: Data de término YYYY-MM-DD (opcional)
th: วันที่สิ้นสุด YYYY-MM-DD (ตัวเลือก)
vi: Ngày kết thúc YYYY-MM-DD (tùy chọn)
zh_hans: 结束日期 YYYY-MM-DD（可选）
zh_hant: 結束日期 YYYY-MM-DD（選填）

# 筛选账单
source: Filter Bills
ar: تصفية الفواتير
es: Filtrar facturas
id: Saring Tagihan
ja: 請求書を絞り込む
ko: 청구서 필터링
ms: Tapis Bil
pt: Filtrar faturas
th: กรองบิล
vi: Lọc hóa đơn
zh_hans: 筛选账单
zh_hant: 篩選帳單

# 暂无账单
source: No bills
ar: لا توجد فواتير
es: No hay facturas
id: Tidak ada tagihan
ja: 請求書はありません
ko: 청구서가 없습니다
ms: Tiada bil
pt: Sem faturas
th: ไม่มีบิล
vi: Không có hóa đơn
zh_hans: 暂无账单
zh_hant: 暫無帳單

# 类型：%@ · 时间：%@
source: Type: %@ · Time: %@
ar: النوع: %@ · الوقت: %@
es: Tipo: %@ · Hora: %@
id: Tipe: %@ · Waktu: %@
ja: 種類：%@ · 時刻：%@
ko: 유형: %@ · 시간: %@
ms: Jenis: %@ · Masa: %@
pt: Tipo: %@ · Hora: %@
th: ประเภท: %@ · เวลา: %@
vi: Loại: %@ · Thời gian: %@
zh_hans: 类型：%@ · 时间：%@
zh_hant: 類型：%@ · 時間：%@

# 活跃
source: Active
ar: نشط
es: Activo
id: Aktif
ko: 활성
ms: Aktif
pt: Ativo
th: ใช้งานอยู่
vi: Hoạt động
zh_hans: 活跃
zh_hant: 活躍

# 禁用
source: Disabled
ar: معطل
es: Desactivado
id: Dinonaktifkan
ja: 無効
ko: 비활성
ms: Dilumpuhkan
pt: Desativado
th: ปิดใช้งาน
vi: Vô hiệu hóa
zh_hans: 禁用
zh_hant: 停用

# 状态(%@)
source: Status(%@)
ar: الحالة(%@)
es: Estado(%@)
id: Negara(%@)
ko: 상태(%@)
ms: Negeri(%@)
pt: Estado(%@)
th: สถานะ(%@)
vi: Trạng thái(%@)
zh_hans: 状态(%@)
zh_hant: 狀態(%@)

# 收入
source: Income
ar: دخل
es: Ingresos
id: Pemasukan
ja: 収入
ko: 수입
ms: Pendapatan
pt: Receita
th: รายรับ
vi: Thu nhập
zh_hans: 收入
zh_hant: 收入

# 支出
source: Expense
ar: مصروف
es: Gastos
id: Pengeluaran
ja: 支出
ko: 지출
ms: Perbelanjaan
pt: Despesa
th: รายจ่าย
vi: Chi tiêu
zh_hans: 支出
zh_hant: 支出

# 别名模式未开启或仓库不可用
source: Alias mode not enabled or repository unavailable
ar: وضع الاسم المستعار غير مفعّل أو المستودع غير متاح
es: Modo alias no habilitado o repositorio no disponible
id: Mode alias belum diaktifkan atau repositori tidak tersedia
ja: エイリアスモードが有効でないか、リポジトリが利用できません
ko: 별칭 모드가 활성화되지 않았거나 저장소를 사용할 수 없습니다
ms: Mod alias tidak diaktifkan atau repositori tidak tersedia
pt: Modo de alias não habilitado ou repositório indisponível
th: โหมดนามแฝงไม่ได้เปิดใช้งานหรือคลังข้อมูลไม่พร้อมใช้งาน
vi: Chế độ bí danh chưa bật hoặc kho không khả dụng
zh_hans: 别名模式未开启或仓库不可用
zh_hant: 别名模式未开启或仓库不可用

# 隐私政策简介
source: Privacy Policy Overview
ar: نظرة عامة على سياسة الخصوصية
es: Resumen de la Política de privacidad
id: Ringkasan Kebijakan Privasi
ja: プライバシーポリシー概要
ko: 개인정보처리방침 개요
ms: Ringkasan Dasar Privasi
pt: Resumo da Política de Privacidade
th: ภาพรวมนโยบายความเป็นส่วนตัว
vi: Tổng quan về Chính sách quyền riêng tư
zh_hans: 隐私政策简介
zh_hant: 隱私政策簡介

# 我们收集的信息包括：设备标识、使用数据与诊断。
source: We collect device identifiers, usage data, and diagnostics.
ar: نجمع معرفات الأجهزة وبيانات الاستخدام ومعلومات التشخيص
es: Recopilamos identificadores de dispositivo, datos de uso e información de diagnóstico
id: Kami mengumpulkan pengenal perangkat, data penggunaan, dan diagnostik.
ja: 当社は、デバイス識別子、利用データ、診断情報を収集します。
ko: 당사는 기기 식별자, 사용 데이터 및 진단 정보를 수집합니다
ms: Maklumat yang kami kumpul termasuk: pengenal peranti, data penggunaan dan diagnostik.
pt: Recolhemos identificadores de dispositivo, dados de utilização e diagnósticos.
th: เราเก็บตัวระบุอุปกรณ์ ข้อมูลการใช้งาน และการวินิจฉัย
vi: Chúng tôi thu thập mã định danh thiết bị, dữ liệu sử dụng và thông tin chẩn đoán
zh_hans: 我们收集的信息包括：设备标识、使用数据与诊断。
zh_hant: 我們收集的資訊包括：設備識別、使用資料與診斷。

# 我们仅用于提供服务、改进体验与安全风控。
source: We use data to provide service, improve experience, and for security.
ar: نستخدم البيانات لتقديم الخدمة وتحسين التجربة ولأغراض الأمان
es: Usamos los datos para prestar el servicio, mejorar la experiencia y por seguridad
id: Kami menggunakan data untuk menyediakan layanan, meningkatkan pengalaman, dan keamanan.
ja: サービス提供、体験の改善、セキュリティのためにのみ利用します。
ko: 이 데이터는 서비스 제공, 사용자 경험 개선 및 보안을 위해서만 사용합니다
ms: Data digunakan hanya untuk menyediakan perkhidmatan, menambah baik pengalaman dan kawalan keselamatan.
pt: Usamos os dados para prestar serviço, melhorar a experiência e por segurança.
th: เราใช้ข้อมูลเพื่อให้บริการ ปรับปรุงประสบการณ์ และเพื่อความปลอดภัย
vi: Chúng tôi chỉ dùng dữ liệu để cung cấp dịch vụ, cải thiện trải nghiệm và bảo mật
zh_hans: 我们仅用于提供服务、改进体验与安全风控。
zh_hant: 我們僅用於提供服務、改善體驗與安全風控。

# 更多详尽条款请访问官网隐私政策页面。
source: Visit our website for the full privacy policy.
ar: للمزيد من التفاصيل، تفضل بزيارة صفحة سياسة الخصوصية على الموقع
es: Consulta la Política de privacidad completa en nuestro sitio web
id: Kunjungi situs web kami untuk kebijakan privasi lengkap.
ja: 詳細は公式サイトのプライバシーポリシーをご覧ください。
ko: 자세한 내용은 웹사이트의 개인정보처리방침을 확인하세요
ms: Lawati laman web rasmi untuk Dasar Privasi penuh.
pt: Consulte a Política de Privacidade completa no nosso site.
th: ดูรายละเอียดฉบับเต็มได้ที่หน้า นโยบายความเป็นส่วนตัว บนเว็บไซต์
vi: Xem đầy đủ tại trang Chính sách quyền riêng tư trên website
zh_hans: 更多详尽条款请访问官网隐私政策页面。
zh_hant: 更多詳盡條款請參閱官網隱私政策頁面。

# 服务条款简介
source: Terms of Service Overview
ar: نظرة عامة على شروط الخدمة
es: Resumen de los Términos de servicio
id: Ringkasan Ketentuan Layanan
ja: 利用規約概要
ko: 서비스 이용약관 개요
ms: Ringkasan Terma Perkhidmatan
pt: Resumo dos Termos de Serviço
th: ภาพรวมข้อกำหนดการให้บริการ
vi: Tổng quan về Điều khoản dịch vụ
zh_hans: 服务条款简介
zh_hant: 服務條款簡介

# 更多详尽条款请访问官网服务条款页面。
source: Visit our website for full terms of service.
ar: للمزيد من التفاصيل، تفضل بزيارة صفحة شروط الخدمة على الموقع
es: Consulta los Términos de servicio completos en nuestro sitio web
id: Kunjungi situs web kami untuk ketentuan layanan lengkap.
ja: 詳細は公式サイトの利用規約をご覧ください。
ko: 자세한 내용은 웹사이트의 이용약관을 확인하세요
ms: Lawati laman web rasmi untuk Terma Perkhidmatan penuh.
pt: Consulte os Termos de Serviço completos no nosso site.
th: ดูรายละเอียดฉบับเต็มได้ที่หน้า ข้อกำหนดการให้บริการ บนเว็บไซต์
vi: Xem đầy đủ tại trang Điều khoản dịch vụ trên website
zh_hans: 更多详尽条款请访问官网服务条款页面。
zh_hant: 更多詳盡條款請參閱官網服務條款頁面。

# 条款与条件
source: Terms & Conditions
ar: الشروط والأحكام
es: Términos y Condiciones
id: Syarat & Ketentuan
ja: 規約と条件
ko: 이용 약관
ms: Terma & Syarat
pt: Termos e Condições
th: ข้อกำหนดและเงื่อนไข
vi: Điều khoản & Điều kiện
zh_hans: 条款与条件
zh_hant: 條款與條件

# 说明
source: Description
ar: الوصف
es: Descripción
id: Deskripsi
ja: 説明
ko: 설명
ms: Perihalan
pt: Descrição
th: คำอธิบาย
vi: Mô tả
zh_hans: 说明
zh_hant: 說明

# 网络与覆盖
source: Network & Coverage
ar: الشبكة والتغطية
es: Red y cobertura
id: Jaringan & Cakupan
ja: ネットワークと通信範囲
ko: 네트워크 및 커버리지
ms: Rangkaian & Liputan
pt: Rede e cobertura
th: เครือข่ายและพื้นที่ให้บริการ
vi: Mạng & Phủ sóng
zh_hans: 网络与覆盖
zh_hant: 網路與覆蓋

# 支持热点共享
source: Hotspot Supported
ar: يدعم مشاركة النقاط الساخنة
es: Compatible con compartir internet
id: Mendukung hotspot
ja: テザリング対応
ko: 핫스팟 공유 지원
ms: Sokong hotspot
pt: Suporta partilha de hotspot
th: รองรับฮอตสปอต
vi: Hỗ trợ chia sẻ điểm phát
zh_hans: 支持热点共享
zh_hant: 支援熱點共享

# 不支持热点共享
source: Hotspot Not Supported
ar: لا يدعم مشاركة النقاط الساخنة
es: No compatible con compartir internet
id: Tidak mendukung hotspot
ja: テザリング非対応
ko: 핫스팟 공유 미지원
ms: Tidak sokong hotspot
pt: Não suporta partilha de hotspot
th: ไม่รองรับฮอตสปอต
vi: Không hỗ trợ chia sẻ điểm phát
zh_hans: 不支持热点共享
zh_hant: 不支援熱點共享

# 下单后将生成订单与安装说明，确认购买即表示同意服务条款。
source: An order and installation instructions will be generated. By confirming purchase you agree to the Terms of Service.
ar: بعد الطلب سيتم إنشاء طلب وتعليمات التثبيت. تأكيد الشراء يعني الموافقة على شروط الخدمة
es: Se generarán el pedido y las instrucciones de instalación. Confirmar la compra implica aceptar los Términos de servicio
id: Pesanan dan instruksi pemasangan akan dibuat. Dengan mengonfirmasi pembelian, Anda menyetujui Ketentuan Layanan.
ja: 注文後に注文およびインストール手順が生成されます。購入の確定は利用規約への同意を意味します。
ko: 주문 후 주문서와 설치 안내가 생성됩니다. 구매를 확인하면 이용약관에 동의한 것으로 간주합니다
ms: Pesanan dan arahan pemasangan akan dijana. Dengan mengesahkan pembelian, anda bersetuju dengan Terma Perkhidmatan.
pt: O pedido e as instruções de instalação serão gerados. Ao confirmar a compra, concorda com os Termos de Serviço.
th: ระบบจะสร้างคำสั่งซื้อและคำแนะนำการติดตั้ง การยืนยันการซื้อถือเป็นการยอมรับข้อกำหนดการให้บริการ
vi: Sau khi đặt, hệ thống sẽ tạo đơn hàng và hướng dẫn cài đặt. Xác nhận mua nghĩa là bạn đồng ý với Điều khoản dịch vụ
zh_hans: 下单后将生成订单与安装说明，确认购买即表示同意服务条款。
zh_hant: 下單後將生成訂單與安裝說明，確認購買即表示同意服務條款。

# 服务范围
source: Coverage
ar: نطاق الخدمة
es: Cobertura
id: Cakupan
ja: 通信範囲
ko: 서비스 범위
ms: Liputan
pt: Cobertura
th: พื้นที่ให้บริการ
vi: Phạm vi dịch vụ
zh_hans: 服务范围
zh_hant: 服務範圍

# 数据
source: Data
ar: البيانات
es: Datos
ja: データ
ko: 데이터
pt: Dados
th: ข้อมูล
vi: Dữ liệu
zh_hans: 数据
zh_hant: 數據

# 有效期
source: Validity
ar: الصلاحية
es: Validez
id: Masa berlaku
ja: 有効期間
ko: 유효기간
ms: Tempoh sah
pt: Validade
th: ระยะเวลา
vi: Thời hạn
zh_hans: 有效期
zh_hant: 有效期

# %@ • 有效期 %d 天
source: %@ • Valid for %d days
ar: %@ • الصلاحية %d يومًا
es: %@ • Válido por %d días
id: %@ • Masa berlaku %d hari
ja: %@ • 有効期間 %d 日間
ko: %@ • 유효기간 %d일
ms: %@ • Tempoh sah %d hari
pt: %@ • Válido por %d dias
th: %@ • อายุการใช้งาน %d วัน
vi: %@ • Hiệu lực %d ngày
zh_hans: %@ • 有效期 %d 天
zh_hant: %@ • 有效期 %d 天

# 关闭并重新打开“蜂窝数据”
source: Toggle Cellular Data off and on
ar: أوقف بيانات خلوية وأعد تشغيلها
es: Desactivar y activar de nuevo los Datos móviles
id: Matikan dan nyalakan kembali Data Seluler
ja: 「モバイルデータ通信」をオフにしてからオンにする
ko: 셀룰러 데이터를 끄고 다시 켜기
ms: Matikan dan hidupkan semula Data Selular
pt: Desligar e voltar a ligar os Dados móveis
th: ปิดและเปิด ‘ข้อมูลเซลลูลาร์’ ใหม่
vi: Tắt và bật lại Dữ liệu di động
zh_hans: 关闭并重新打开“蜂窝数据”
zh_hant: 關閉並重新開啟「行動數據」

# 测试数据开关或切换飞行模式，如无信号可手动选择网络
source: Toggle data/flight mode; if no signal, select network manually
ar: بدّل بين البيانات/وضع الطيران؛ إن لم توجد إشارة اختر الشبكة يدويًا
es: Alternar datos o modo avión; si no hay señal, seleccionar la red manualmente
id: Ubah data atau mode pesawat; jika tidak ada sinyal, pilih jaringan secara manual
ja: データ通信のスイッチを試すか機内モードを切り替えます。電波がない場合は手動でネットワークを選択してください
ko: 데이터 또는 비행 모드 토글. 신호가 없으면 네트워크 수동 선택
ms: Tukar data atau mod pesawat; jika tiada isyarat, pilih rangkaian secara manual
pt: Alternar dados ou modo avião; se não houver sinal, selecione a rede manualmente
th: สลับข้อมูลหรือโหมดเครื่องบิน หากไม่มีสัญญาณให้เลือกเครือข่ายด้วยตนเอง
vi: Chuyển đổi dữ liệu/Chế độ máy bay; nếu không có tín hiệu, chọn mạng thủ công
zh_hans: 测试数据开关或切换飞行模式，如无信号可手动选择网络
zh_hant: 切換數據開關或飛航模式，若無信號可手動選擇網路

# 您可以在出行前购买 eSIM。有效期不会因为提前购买而开始，只有当首次连接到覆盖区域内的网络时才开始计算。购买前请以套餐详情中的有效期与覆盖说明为准。
source: You can buy before travel. Validity starts upon first connection in the coverage area. Refer to the bundle's validity and coverage in its details.
ar: يمكنك الشراء قبل السفر. تبدأ الصلاحية عند أول اتصال ضمن منطقة التغطية. راجع تفاصيل الباقة للصلاحية والتغطية
es: Puedes comprarla antes del viaje. La validez comienza solo al conectarte por primera vez dentro del área de cobertura. Consulta la validez y cobertura en los detalles del paquete.
id: Anda dapat membeli sebelum bepergian. Masa berlaku dimulai saat pertama terhubung di area cakupan. Lihat masa berlaku dan cakupan di detail paket.
ja: 旅行前に購入できます。有効期間はカバー地域のネットワークに初めて接続した時点から開始します。購入前にプラン詳細の有効期間と通信範囲の説明をご確認ください。
ko: 여행 전에 구매할 수 있습니다. 유효기간은 커버리지 지역에서 처음 연결될 때 시작됩니다. 구매 전에 플랜 상세의 유효기간과 커버리지 설명을 확인하세요
ms: Anda boleh membeli sebelum perjalanan. Tempoh sah bermula apabila pertama kali bersambung dalam kawasan liputan. Rujuk tempoh sah dan liputan dalam butiran pakej.
pt: Pode comprar antes da viagem. A validade começa ao conectar‑se pela primeira vez na área de cobertura. Consulte a validade e a cobertura nos detalhes do pacote.
th: สามารถซื้อได้ก่อนเดินทาง ระยะเวลามีผลเมื่อเชื่อมต่อครั้งแรกในพื้นที่ครอบคลุม โปรดดูรายละเอียดระยะเวลาและพื้นที่ครอบคลุมในหน้าแพ็กเกจ
zh_hans: 您可以在出行前购买 eSIM。有效期不会因为提前购买而开始，只有当首次连接到覆盖区域内的网络时才开始计算。购买前请以套餐详情中的有效期与覆盖说明为准。
zh_hant: 您可以在出行前購買 eSIM。有效期不會因為提前購買而開始，只有當首次連接到覆蓋區域內的網路時才開始計算。購買前請以套餐詳情中的有效期與覆蓋說明為準。

# 版本信息与说明
source: Version info and notes
ar: معلومات الإصدار والملاحظات
es: Información de la versión y notas
id: Info versi dan catatan
ja: バージョン情報と説明
ko: 버전 정보 및 안내
ms: Maklumat versi dan nota
pt: Informações da versão e notas
th: ข้อมูลเวอร์ชันและหมายเหตุ
vi: Thông tin phiên bản và ghi chú
zh_hans: 版本信息与说明
zh_hant: 版本資訊與說明

# 补充说明
source: Additional details
ar: تفاصيل إضافية
es: Detalles adicionales
id: Keterangan tambahan
ja: 補足説明
ko: 추가 설명
ms: Butiran tambahan
pt: Detalhes adicionais
th: รายละเอียดเพิ่มเติม
vi: Chi tiết bổ sung
zh_hans: 补充说明
zh_hant: 補充說明

# 当前处于离线状态，请检查网络连接
source: You are offline. Check your network connection
ar: أنت غير متصل. يرجى التحقق من اتصال الشبكة
es: Estás sin conexión. Comprueba tu conexión de red
id: Anda sedang offline. Periksa koneksi jaringan Anda
ja: 現在オフラインです。ネットワーク接続を確認してください
ko: 오프라인 상태입니다. 네트워크 연결을 확인하세요
ms: Anda sedang luar talian. Semak sambungan rangkaian anda
pt: Você está offline. Verifique sua conexão de rede
th: ขณะนี้ออฟไลน์ โปรดตรวจสอบการเชื่อมต่อเครือข่าย
vi: Bạn đang ngoại tuyến. Vui lòng kiểm tra kết nối mạng
zh_hans: 当前处于离线状态，请检查网络连接
zh_hant: 目前處於離線狀態，請檢查網路連線

# 服务暂时不可用，请稍后重试
source: Service temporarily unavailable. Please try again later
ar: الخدمة غير متاحة مؤقتًا. يرجى المحاولة لاحقًا
es: Servicio temporalmente no disponible. Inténtalo de nuevo más tarde
id: Layanan tidak tersedia sementara. Silakan coba lagi nanti
ja: サービスは一時的に利用できません。後で再試行してください
ko: 서비스를 일시적으로 사용할 수 없습니다. 나중에 다시 시도하세요
ms: Perkhidmatan tidak tersedia buat sementara. Cuba lagi kemudian
pt: Serviço temporariamente indisponível. Tente novamente mais tarde
th: บริการไม่พร้อมใช้งานชั่วคราว โปรดลองอีกครั้งในภายหลัง
vi: Dịch vụ tạm thời không khả dụng. Vui lòng thử lại sau
zh_hans: 服务暂时不可用，请稍后重试
zh_hant: 服務暫時不可用，請稍後重試

# 未能加载套餐信息
source: Failed to load bundle info
ar: فشل تحميل معلومات الباقة
es: No se pudo cargar la información del paquete
id: Gagal memuat info paket
ja: プラン情報の読み込みに失敗しました
ko: 상품 정보를 불러오지 못했습니다
ms: Gagal memuat maklumat pakej
pt: Falha ao carregar informações do pacote
th: โหลดข้อมูลแพ็กเกจไม่สำเร็จ
vi: Tải thông tin gói thất bại
zh_hans: 未能加载套餐信息
zh_hant: 未能載入套餐資訊

# 未能加载套餐详情
source: Failed to load bundle detail
ar: فشل تحميل تفاصيل الباقة
es: No se pudo cargar el detalle del paquete
id: Gagal memuat detail paket
ja: プラン詳細の読み込みに失敗しました
ko: 패키지 상세를 불러오지 못했습니다
ms: Gagal memuat butiran pakej
pt: Falha ao carregar detalhes do pacote
th: ไม่สามารถโหลดรายละเอียดแพ็กเกจ
vi: Không thể tải chi tiết gói
zh_hans: 未能加载套餐详情
zh_hant: 未能加載套餐詳情

# 无结果
source: No results
ar: لا توجد نتائج
es: Sin resultados
id: Tidak ada hasil
ja: 結果がありません
ko: 결과 없음
ms: Tiada hasil
pt: Sem resultados
th: ไม่พบผลลัพธ์
vi: Không có kết quả
zh_hans: 无结果
zh_hant: 無結果

# 网络异常：请检查网络后重试（%@）
source: Network error: check connection and retry (%@)
ar: خطأ في الشبكة: تحقق من الاتصال ثم أعد المحاولة (%@)
es: Error de red: verifica la conexión e inténtalo de nuevo (%@)
id: Kesalahan jaringan: periksa koneksi lalu coba lagi (%@)
ja: ネットワーク異常：接続を確認して再試行してください（%@）
ko: 네트워크 오류: 연결 확인 후 재시도 (%@)
ms: Ralat rangkaian: semak sambungan dan cuba lagi (%@)
pt: Erro de rede: verifique a ligação e tente novamente (%@)
th: เครือข่ายผิดปกติ: ตรวจสอบการเชื่อมต่อแล้วลองอีกครั้ง (%@)
vi: Lỗi mạng: kiểm tra kết nối và thử lại (%@)
zh_hans: 网络异常：请检查网络后重试（%@）
zh_hant: 網路異常：請檢查網路後重試（%@）

# 服务暂时不可用，请稍后重试（%@）
source: Service unavailable, please try later (%@)
ar: الخدمة غير متاحة مؤقتًا، حاول لاحقًا (%@)
es: Servicio temporalmente no disponible, inténtalo más tarde (%@)
id: Layanan tidak tersedia sementara, coba lagi nanti (%@)
ja: サービスは一時的に利用できません。後で再試行してください（%@）
ko: 서비스 불가: 잠시 후 다시 시도 (%@)
ms: Perkhidmatan tidak tersedia buat sementara, cuba lagi kemudian (%@)
pt: Serviço temporariamente indisponível, tente mais tarde (%@)
th: บริการไม่พร้อมใช้งานชั่วคราว โปรดลองภายหลัง (%@)
vi: Dịch vụ tạm thời không khả dụng, thử lại sau (%@)
zh_hans: 服务暂时不可用，请稍后重试（%@）
zh_hant: 服務暫不可用，請稍後重試（%@）

# 查看服务条款
source: View Terms
ar: عرض شروط الخدمة
es: Ver Términos de servicio
id: Lihat Ketentuan Layanan
ja: 利用規約を見る
ko: 서비스 약관 보기
ms: Lihat Terma Perkhidmatan
pt: Ver Termos de serviço
th: ดูข้อกำหนดในการให้บริการ
vi: Xem Điều khoản dịch vụ
zh_hans: 查看服务条款
zh_hant: 查看服務條款

# 立即购买
source: Buy Now
ar: اشترِ الآن
es: Comprar ahora
id: Beli sekarang
ja: 今すぐ購入
ko: 지금 구매
ms: Beli sekarang
pt: Comprar agora
th: ซื้อเลย
vi: Mua ngay
zh_hans: 立即购买
zh_hant: 立即購買

# 确认下单
source: Checkout
ar: تأكيد الطلب
es: Confirmar pedido
id: Konfirmasi pesanan
ja: 注文を確定
ko: 주문 확인
ms: Sahkan pesanan
pt: Confirmar pedido
th: ยืนยันการสั่งซื้อ
vi: Xác nhận đặt hàng
zh_hans: 确认下单
zh_hant: 確認下單

# 暂无符合条件的订单
source: No orders match the filter
ar: لا توجد طلبات مطابقة للمرشح
es: No hay pedidos que coincidan con el filtro
id: Tidak ada pesanan sesuai filter
ja: 条件に合致する注文はありません
ko: 필터에 일치하는 주문이 없습니다
ms: Tiada pesanan yang sepadan dengan penapis
pt: Nenhum pedido corresponde ao filtro
th: ไม่มีคำสั่งซื้อที่ตรงกับตัวกรอง
vi: Không có đơn hàng phù hợp với bộ lọc
zh_hans: 暂无符合条件的订单
zh_hant: 暫無符合條件的訂單

# 筛选
source: Filters
ar: عوامل التصفية
es: Filtros
id: Filter
ja: フィルター
ko: 필터
ms: Tapis
pt: Filtros
th: ตัวกรอง
vi: Bộ lọc
zh_hans: 筛选
zh_hant: 篩選

# 下载配置文件（.mobileconfig）
source: Download profile (.mobileconfig)
ar: تنزيل الملف التعريفي (.mobileconfig)
es: Descargar perfil (.mobileconfig)
id: Unduh profil (.mobileconfig)
ja: 構成プロファイル（.mobileconfig）をダウンロード
ko: 프로파일 다운로드 (.mobileconfig)
ms: Muat turun profil (.mobileconfig)
pt: Baixar perfil (.mobileconfig)
th: ดาวน์โหลดโปรไฟล์ (.mobileconfig)
vi: Tải hồ sơ cấu hình (.mobileconfig)
zh_hans: 下载配置文件（.mobileconfig）
zh_hant: 下載設定檔（.mobileconfig）

# 售后
source: After-sales
ar: خدمة ما بعد البيع
es: Postventa
ja: アフターサービス
ko: 애프터서비스
ms: Perkhidmatan selepas jualan
pt: Pós-venda
th: บริการหลังการขาย
vi: Dịch vụ hậu mãi
zh_hans: 售后
zh_hant: 售後

# 申请退款
source: Request Refund
ar: طلب استرداد
es: Solicitar reembolso
ja: 返金を申請
ko: 환불 신청
ms: Mohon bayaran balik
pt: Solicitar reembolso
th: ขอคืนเงิน
vi: Yêu cầu hoàn tiền
zh_hans: 申请退款
zh_hant: 申請退款

# 确认申请退款？
source: Confirm refund request?
ar: تأكيد طلب الاسترداد؟
es: ¿Confirmar solicitud de reembolso?
ja: 返金申請を確認しますか？
ko: 환불 신청을 확인하시겠습니까?
ms: Sahkan permohonan bayaran balik?
pt: Confirmar solicitação de reembolso?
th: ยืนยันคำขอคืนเงินหรือไม่?
vi: Xác nhận yêu cầu hoàn tiền?
zh_hans: 确认申请退款？
zh_hant: 確認申請退款？

# 确认申请
source: Confirm
ar: تأكيد
es: Confirmar
ja: 申請を確認
ko: 신청 확인
ms: Sahkan
pt: Confirmar
th: ยืนยัน
vi: Xác nhận
zh_hans: 确认申请
zh_hant: 確認申請

# 取消
source: Cancel
ar: إلغاء
es: Cancelar
id: Batal
ja: キャンセル
ko: 취소
ms: Batal
pt: Cancelar
th: ยกเลิก
vi: Hủy
zh_hans: 取消
zh_hant: 取消

# 退款申请已提交
source: Refund request submitted
ar: تم إرسال طلب الاسترداد
es: Solicitud de reembolso enviada
ja: 返金申請を送信しました
ko: 환불 신청이 제출되었습니다
ms: Permohonan bayaran balik telah dihantar
pt: Solicitação de reembolso enviada
th: ส่งคำขอคืนเงินแล้ว
vi: Đã gửi yêu cầu hoàn tiền
zh_hans: 退款申请已提交
zh_hant: 退款申請已提交

# 帮助与支持
source: Help & Support
ar: المساعدة والدعم
es: Ayuda y soporte
id: Bantuan & Dukungan
ja: ヘルプとサポート
ko: 도움말 및 지원
ms: Bantuan & Sokongan
pt: Ajuda e suporte
th: ความช่วยเหลือและสนับสนุน
vi: Trợ giúp & Hỗ trợ
zh_hans: 帮助与支持
zh_hant: 幫助與支援

# 如需帮助，您可以通过以下方式联系我们：
source: If you need help, contact us via:
ar: إذا كنت بحاجة إلى المساعدة، اتصل بنا عبر:
es: Si necesitas ayuda, contáctanos a través de:
id: Jika perlu bantuan, hubungi kami melalui:
ja: ヘルプが必要な場合は次の方法でお問い合わせください：
ko: 도움이 필요하면 다음 방법으로 문의하세요:
ms: Jika anda perlukan bantuan, hubungi kami melalui:
pt: Se precisa de ajuda, entre em contato por:
th: หากต้องการความช่วยเหลือ ติดต่อเราได้ผ่าน:
vi: Nếu cần hỗ trợ, liên hệ qua:
zh_hans: 如需帮助，您可以通过以下方式联系我们：
zh_hant: 如需幫助，您可以透過以下方式聯絡我們：

# 打开帮助中心
source: Open Help Center
ar: فتح مركز المساعدة
es: Abrir el Centro de Ayuda
id: Buka Pusat Bantuan
ja: ヘルプセンターを開く
ko: 도움말 센터 열기
ms: Buka Pusat Bantuan
pt: Abrir Central de Ajuda
th: เปิดศูนย์ช่วยเหลือ
vi: Mở Trung tâm trợ giúp
zh_hans: 打开帮助中心
zh_hant: 打開幫助中心

# 关闭
source: Close
ar: إغلاق
id: penutup
ja: 閉鎖
ko: 폐쇄
pt: Fechar
th: ปิด
zh_hans: 关闭
zh_hant: 關閉

# 发送邮件至 support@example.com
source: Email support@example.com
ar: إرسال بريد إلى support@example.com
es: Enviar correo a support@example.com
id: Email ke support@example.com
ja: support@example.com にメールを送信
ko: support@example.com 으로 이메일 보내기
ms: Emel support@example.com
pt: Enviar e-mail para support@example.com
th: อีเมลไปที่ support@example.com
vi: Gửi email tới support@example.com
zh_hans: 发送邮件至 support@example.com
zh_hant: 傳送郵件至 support@example.com
